[Killed] Throw_
Application/Actions/Action.php:36:13
         try {
             return $this->action($request, $response, $args);
         } catch (DomainRecordNotFoundException $e) {
-            throw new HttpNotFoundException($request, $e->getMessage());
+            new HttpNotFoundException($request, $e->getMessage());
         }
     }
killedBy: MatchBot\Tests\Application\Actions\Donations\GetTest::testIdNotFound
statusReason: 1) MatchBot\Tests\Application\Actions\Donations\GetTest::testIdNotFound
Failed asserting that exception of type "TypeError" matches expected exception "Slim\Exception\HttpNotFoundException". Message was: "MatchBot\Application\Actions\Action::__invoke(): Return value must be of type Psr\Http\Message\ResponseInterface, none returned" at
/home/barney/projects/matchbot/src/Application/Actions/Action.p

[NoCoverage] ProtectedVisibility
Application/Actions/Action.php:52:5
      * @return mixed
      * @throws HttpBadRequestException
      */
-    protected function resolveArg(Request $request, string $name, array $args)
+    private function resolveArg(Request $request, string $name, array $args)
     {
         if (!isset($args[$name])) {

[NoCoverage] LogicalNot
Application/Actions/Action.php:54:9
      */
     protected function resolveArg(Request $request, string $name, array $args)
     {
-        if (!isset($args[$name])) {
+        if (isset($args[$name])) {
             throw new HttpBadRequestException($request, "Could not resolve argument `{$name}`.");
         }

[NoCoverage] Throw_
Application/Actions/Action.php:55:13
     protected function resolveArg(Request $request, string $name, array $args)
     {
         if (!isset($args[$name])) {
-            throw new HttpBadRequestException($request, "Could not resolve argument `{$name}`.");
+            new HttpBadRequestException($request, "Could not resolve argument `{$name}`.");
         }
 

[Killed] ProtectedVisibility
Application/Actions/Action.php:68:5
      *                                      avoid noise from known issues.
      * @return Response with 400 HTTP response code.
      */
-    protected function validationError(
+    private function validationError(Response $response, string $logMessage, ?string $publicMessage = null, bool $reduceSeverity = false) : Response
         Response $response,
         string $logMessage,
killedBy: MatchBot\Tests\Application\Actions\Hooks\StripePayoutUpdateTest::testMissingSignature
statusReason: 1) MatchBot\Tests\Application\Actions\Hooks\StripePayoutUpdateTest::testMissingSignature
Error: Call to private method MatchBot\Application\Actions\Action::validationError() from scope MatchBot\Application\Actions\Hooks\Stripe

/home/barney/projects/matchbot/src/Application/Actions/Hooks/Stripe.php:53
/home/barney/projects/matchbot/src/Application/Actions/Hooks/StripePayoutUpdate.php:54
/home/barn

[Survived] FalseValue
Application/Actions/Action.php:72:9
         Response $response,
         string $logMessage,
         ?string $publicMessage = null,
-        bool $reduceSeverity = false
+        protected function validationError(Response $response, string $logMessage, ?string $publicMessage = null, bool $reduceSeverity = true) : Response
     ): Response {
         if ($reduceSeverity) {

[Survived] IfNegation
Application/Actions/Action.php:74:9
         ?string $publicMessage = null,
         bool $reduceSeverity = false
     ): Response {
-        if ($reduceSeverity) {
-            $this->logger->info($logMessage);
-        } else {
-            $this->logger->warning($logMessage);
-        }
+        if (!$reduceSeverity) {
         $error = new ActionError(ActionError::BAD_REQUEST, $publicMessage ?? $logMessage);
 

[Survived] MethodCallRemoval
Application/Actions/Action.php:75:13
         bool $reduceSeverity = false
     ): Response {
         if ($reduceSeverity) {
-            $this->logger->info($logMessage);
+            
         } else {
             $this->logger->warning($logMessage);

[Survived] MethodCallRemoval
Application/Actions/Action.php:77:13
         if ($reduceSeverity) {
             $this->logger->info($logMessage);
         } else {
-            $this->logger->warning($logMessage);
+            
         }
         $error = new ActionError(ActionError::BAD_REQUEST, $publicMessage ?? $logMessage);

[Killed] Coalesce
Application/Actions/Action.php:79:9
         } else {
             $this->logger->warning($logMessage);
         }
-        $error = new ActionError(ActionError::BAD_REQUEST, $publicMessage ?? $logMessage);
+        $error = new ActionError(ActionError::BAD_REQUEST, $logMessage ?? $publicMessage);
 
         return $this->respond($response, new ActionPayload(400, null, $error));
killedBy: MatchBot\Tests\Application\Actions\Donations\CreateTest::testDeserialiseError
statusReason: 1) MatchBot\Tests\Application\Actions\Donations\CreateTest::testDeserialiseError
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
 '{\n
     "error": {\n
         "type": "BAD_REQUEST",\n

[Killed] DecrementInteger
Application/Actions/Action.php:81:9
         }
         $error = new ActionError(ActionError::BAD_REQUEST, $publicMessage ?? $logMessage);
 
-        return $this->respond($response, new ActionPayload(400, null, $error));
+        return $this->respond($response, new ActionPayload(399, null, $error));
     }
 
killedBy: MatchBot\Tests\Application\Actions\Hooks\StripePayoutUpdateTest::testMissingSignature
statusReason: 1) MatchBot\Tests\Application\Actions\Hooks\StripePayoutUpdateTest::testMissingSignature
Failed asserting that 399 matches expected 400.

/home/barney/projects/matchbot/tests/Application/Actions/Hooks/StripePayoutUpdateTest.php:76

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.

[Killed] IncrementInteger
Application/Actions/Action.php:81:9
         }
         $error = new ActionError(ActionError::BAD_REQUEST, $publicMessage ?? $logMessage);
 
-        return $this->respond($response, new ActionPayload(400, null, $error));
+        return $this->respond($response, new ActionPayload(401, null, $error));
     }
 
killedBy: MatchBot\Tests\Application\Actions\Hooks\StripePayoutUpdateTest::testMissingSignature
statusReason: 1) MatchBot\Tests\Application\Actions\Hooks\StripePayoutUpdateTest::testMissingSignature
Failed asserting that 401 matches expected 400.

/home/barney/projects/matchbot/tests/Application/Actions/Hooks/StripePayoutUpdateTest.php:76

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.

[Killed] IncrementInteger
Application/Actions/Action.php:88:5
      * @param  array|object|null $data
      * @return Response
      */
-    protected function respondWithData(Response $response, $data = null, int $statusCode = 200): Response
+    protected function respondWithData(Response $response, $data = null, int $statusCode = 201) : Response
     {
         $payload = new ActionPayload($statusCode, $data);
killedBy: MatchBot\Tests\Application\Actions\GetPaymentMethodsTest::testSuccess
statusReason: 1) MatchBot\Tests\Application\Actions\GetPaymentMethodsTest::testSuccess
Failed asserting that 201 matches expected 200.

/home/barney/projects/matchbot/tests/Application/Actions/GetPaymentMethodsTest.php:50

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.

[Killed] ProtectedVisibility
Application/Actions/Action.php:88:5
      * @param  array|object|null $data
      * @return Response
      */
-    protected function respondWithData(Response $response, $data = null, int $statusCode = 200): Response
+    private function respondWithData(Response $response, $data = null, int $statusCode = 200) : Response
     {
         $payload = new ActionPayload($statusCode, $data);
killedBy: MatchBot\Tests\Application\Actions\UpdatePaymentMethodTest::testItUpdatesAPaymentMethod
statusReason: 1) MatchBot\Tests\Application\Actions\UpdatePaymentMethodTest::testItUpdatesAPaymentMethod
Error: Call to private method MatchBot\Application\Actions\Action::respondWithData() from scope MatchBot\Application\Actions\UpdatePaymentMethod

/home/barney/projects/matchbot/src/Application/Actions/UpdatePaymentMethod.php:86
/home/barney/projects/matchbot/src/Application/Actions/Action.php:31
/home/barney

[Killed] ProtectedVisibility
Application/Actions/Action.php:98:5
      * @param ActionPayload $payload
      * @return Response
      */
-    protected function respond(Response $response, ActionPayload $payload): Response
+    private function respond(Response $response, ActionPayload $payload) : Response
     {
         $json = json_encode($payload, JSON_PRETTY_PRINT);
killedBy: MatchBot\Tests\Monolog\Processor\AwsTraceIdProcessorTest::testContextAdded
statusReason: 1) MatchBot\Tests\Monolog\Processor\AwsTraceIdProcessorTest::testContextAdded
Error: Call to private method MatchBot\Application\Actions\Action::respond() from scope MatchBot\Application\Actions\Status

/home/barney/projects/matchbot/src/Application/Actions/Status.php:68
/home/barney/projects/matchbot/src/Application/Actions/Action.php:31
/home/barney/projects/matchbot/vendor/slim/slim/Slim/Handle

[Killed] MethodCallRemoval
Application/Actions/Action.php:101:9
     protected function respond(Response $response, ActionPayload $payload): Response
     {
         $json = json_encode($payload, JSON_PRETTY_PRINT);
-        $response->getBody()->write($json);
+        
 
         return $response
killedBy: MatchBot\Tests\Application\Actions\GetPaymentMethodsTest::testSuccess
statusReason: 1) MatchBot\Tests\Application\Actions\GetPaymentMethodsTest::testSuccess
Failed asserting that an empty string is valid JSON.

/home/barney/projects/matchbot/tests/Application/Actions/GetPaymentMethodsTest.php:49

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.
