[Killed] PublicVisibility
Application/Auth/DonationToken.php:25:5
      * @param string $donationId UUID for a donation
      * @return string Signed JWS
      */
-    public static function create(string $donationId): string
+    protected static function create(string $donationId) : string
     {
         /**
killedBy: MatchBot\Tests\Application\Auth\DonationTokenTest::testCreateReturnsValidLookingToken
statusReason: 1) MatchBot\Tests\Application\Auth\DonationTokenTest::testCreateReturnsValidLookingToken
Error: Call to protected method MatchBot\Application\Auth\DonationToken::create() from scope MatchBot\Tests\Application\Auth\DonationTokenTest

/home/barney/projects/matchbot/tests/Application/Auth/DonationTokenTest.php:15

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] DecrementInteger
Application/Auth/DonationToken.php:34:13
         $claims = [
             'iss' => getenv('BASE_URI'),
             'iat' => time(),
-            'exp' => time() + (30 * 86400), // Expire in 30 days
+            'exp' => time() + 30 * 86399,
             'sub' => [
                 'donationId' => $donationId,
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

......................................................            54 / 54 (100%)

Time: 00:03.138, Memory: 32.00 MB

OK (54 tests, 539 assertions)

[Killed] IncrementInteger
Application/Auth/DonationToken.php:34:13
         $claims = [
             'iss' => getenv('BASE_URI'),
             'iat' => time(),
-            'exp' => time() + (30 * 86400), // Expire in 30 days
+            'exp' => time() + 31 * 86400,
             'sub' => [
                 'donationId' => $donationId,
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

......................................................            54 / 54 (100%)

Time: 00:03.138, Memory: 32.00 MB

OK (54 tests, 539 assertions)

[Killed] PublicVisibility
Application/Auth/DonationToken.php:49:5
      * @param LoggerInterface   $logger
      * @return bool Whether the token is valid for the given donation.
      */
-    public static function check(string $donationId, string $jws, LoggerInterface $logger): bool
+    protected static function check(string $donationId, string $jws, LoggerInterface $logger) : bool
     {
         $key = new Key(static::getSecret(), static::$algorithm);
killedBy: MatchBot\Tests\Application\Auth\DonationTokenTest::testCheckPassesWhenAllValid
statusReason: 1) MatchBot\Tests\Application\Auth\DonationTokenTest::testCheckPassesWhenAllValid
Error: Call to protected method MatchBot\Application\Auth\DonationToken::check() from scope MatchBot\Tests\Application\Auth\DonationTokenTest

/home/barney/projects/matchbot/tests/Application/Auth/DonationTokenTest.php:24

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] MethodCallRemoval
Application/Auth/DonationToken.php:60:13
             // requests. In the event that we find they are sending partial JWTs (rather than
             // none) and so getting here we might consider further reducing this log to `info()`
             // level so we can spot more serious issues.
-            $logger->warning("JWT error: decoding for donation ID $donationId: $type - {$exception->getMessage()}");
+            
 
             return false;
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

........................................                          40 / 40 (100%)

Time: 00:03.104, Memory: 26.00 MB

OK (40 tests, 334 assertions)

[Killed] NotIdentical
Application/Auth/DonationToken.php:65:9
             return false;
         }
 
-        if ($decodedJwtBody->iss !== getenv('BASE_URI')) {
+        if ($decodedJwtBody->iss === getenv('BASE_URI')) {
             $logger->error("JWT error: issued by wrong site {$decodedJwtBody->iss}");
 
killedBy: MatchBot\Tests\Application\Auth\DonationTokenTest::testCheckPassesWhenAllValid
statusReason: 1) MatchBot\Tests\Application\Auth\DonationTokenTest::testCheckPassesWhenAllValid
Failed asserting that false is true.

/home/barney/projects/matchbot/tests/Application/Auth/DonationTokenTest.php:24

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[NoCoverage] MethodCallRemoval
Application/Auth/DonationToken.php:66:13
         }
 
         if ($decodedJwtBody->iss !== getenv('BASE_URI')) {
-            $logger->error("JWT error: issued by wrong site {$decodedJwtBody->iss}");
+            
 
             return false;

[Killed] NotIdentical
Application/Auth/DonationToken.php:71:9
             return false;
         }
 
-        if ($donationId !== $decodedJwtBody->sub->donationId) {
+        if ($donationId === $decodedJwtBody->sub->donationId) {
             // We've seen this rarely from things like sharing thank you URLs across browsers / devices.
             // We want stats of this on dashboards to monitor frequency, but not error alarms.
killedBy: MatchBot\Tests\Application\Auth\DonationTokenTest::testCheckPassesWhenAllValid
statusReason: 1) MatchBot\Tests\Application\Auth\DonationTokenTest::testCheckPassesWhenAllValid
Failed asserting that false is true.

/home/barney/projects/matchbot/tests/Application/Auth/DonationTokenTest.php:24

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] MethodCallRemoval
Application/Auth/DonationToken.php:74:13
         if ($donationId !== $decodedJwtBody->sub->donationId) {
             // We've seen this rarely from things like sharing thank you URLs across browsers / devices.
             // We want stats of this on dashboards to monitor frequency, but not error alarms.
-            $logger->warning("JWT error: Not authorised for donation ID $donationId");
+            
 
             return false;
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

........................................                          40 / 40 (100%)

Time: 00:03.100, Memory: 26.00 MB

OK (40 tests, 334 assertions)
