[Killed] MethodCallRemoval
Application/Actions/DeletePaymentMethod.php:25:9
         private StripeClient $stripeClient,
         LoggerInterface $logger
     ) {
-        parent::__construct($logger);
+        
     }
 
killedBy: MatchBot\Tests\Application\Actions\UpdatePaymentMethodTest::testItRefusesToToUpdatePaymentMethodThatDoesNotBelongToRquester
statusReason: 1) MatchBot\Tests\Application\Actions\UpdatePaymentMethodTest::testItRefusesToToUpdatePaymentMethodThatDoesNotBelongToRquester
Error: Typed property MatchBot\Application\Actions\Action::$logger must not be accessed before initialization

/home/barney/projects/matchbot/src/Application/Actions/DeletePaymentMethod.php:37
/home/barney/projects/matchbot/src/Application/Actions/Action.php:34
/home/barne

[Killed] LogicalNot
Application/Actions/DeletePaymentMethod.php:50:9
             $allPaymentMethodsOfCustomer
         );
 
-        if (!in_array($paymentMethodId, $allCustomersPaymentMethodIds, true)) {
+        if (in_array($paymentMethodId, $allCustomersPaymentMethodIds, true)) {
             $this->logger->warning(
                 "Refusing to delete stripe payment method as not found for customer",
killedBy: MatchBot\Tests\Application\Actions\UpdatePaymentMethodTest::testItRefusesToToUpdatePaymentMethodThatDoesNotBelongToRquester
statusReason: 1) MatchBot\Tests\Application\Actions\UpdatePaymentMethodTest::testItRefusesToToUpdatePaymentMethodThatDoesNotBelongToRquester
Some predictions failed:
Double\Stripe\Service\PaymentMethodService\P1:
  No calls expected that match:
      Double\Stripe\Service\PaymentMethodService\P1->detach(*)
    but 1 was made:
      - detach("stripe_payment_method_id_35") @ src/Application/Actions/DeletePaymentM

[Survived] MethodCallRemoval
Application/Actions/DeletePaymentMethod.php:51:13
         );
 
         if (!in_array($paymentMethodId, $allCustomersPaymentMethodIds, true)) {
-            $this->logger->warning(
-                "Refusing to delete stripe payment method as not found for customer",
-                compact('customerId', 'paymentMethodId')
-            );
+            
 
             return $this->respondWithData(

[Killed] MethodCallRemoval
Application/Actions/DeletePaymentMethod.php:64:13
         }
 
         try {
-            $this->stripeClient->paymentMethods->detach($paymentMethodId);
+            
         } catch (InvalidRequestException $e) {
             $this->logger->error(
killedBy: MatchBot\Tests\Application\Actions\DeletePaymentMethodTest::testItDeletesAPaymentMethod
statusReason: 1) MatchBot\Tests\Application\Actions\DeletePaymentMethodTest::testItDeletesAPaymentMethod
Some predictions failed:
Double\Stripe\Service\PaymentMethodService\P1:
  Expected exactly 1 calls that match:
      Double\Stripe\Service\PaymentMethodService\P1->detach(exact("stripe_payment_method_id_35"))
    but none were made.

/home/barney/projects/matchbot/vendor/phpspec/prophecy-phpunit/src/Prophecy

[NoCoverage] MethodCallRemoval
Application/Actions/DeletePaymentMethod.php:66:13
         try {
             $this->stripeClient->paymentMethods->detach($paymentMethodId);
         } catch (InvalidRequestException $e) {
-            $this->logger->error(
-                "Failed to delete payment method, error: " . $e->getMessage(),
-                compact('customerId', 'paymentMethodId')
-            );
+            
             return $this->respondWithData($response, ['error' => "Could not delete payment method"], 400);
         }

[NoCoverage] ConcatOperandRemoval
Application/Actions/DeletePaymentMethod.php:67:17
             $this->stripeClient->paymentMethods->detach($paymentMethodId);
         } catch (InvalidRequestException $e) {
             $this->logger->error(
-                "Failed to delete payment method, error: " . $e->getMessage(),
+                $this->logger->error($e->getMessage(), compact('customerId', 'paymentMethodId'));
                 compact('customerId', 'paymentMethodId')
             );

[NoCoverage] ConcatOperandRemoval
Application/Actions/DeletePaymentMethod.php:67:17
             $this->stripeClient->paymentMethods->detach($paymentMethodId);
         } catch (InvalidRequestException $e) {
             $this->logger->error(
-                "Failed to delete payment method, error: " . $e->getMessage(),
+                $this->logger->error("Failed to delete payment method, error: ", compact('customerId', 'paymentMethodId'));
                 compact('customerId', 'paymentMethodId')
             );

[NoCoverage] IncrementInteger
Application/Actions/DeletePaymentMethod.php:70:13
                 "Failed to delete payment method, error: " . $e->getMessage(),
                 compact('customerId', 'paymentMethodId')
             );
-            return $this->respondWithData($response, ['error' => "Could not delete payment method"], 400);
+            return $this->respondWithData($response, ['error' => "Could not delete payment method"], 401);
         }
 

[NoCoverage] DecrementInteger
Application/Actions/DeletePaymentMethod.php:70:13
                 "Failed to delete payment method, error: " . $e->getMessage(),
                 compact('customerId', 'paymentMethodId')
             );
-            return $this->respondWithData($response, ['error' => "Could not delete payment method"], 400);
+            return $this->respondWithData($response, ['error' => "Could not delete payment method"], 399);
         }
 
