[Killed] LogicalNot
Application/Auth/PersonManagementAuthMiddleware.php:41:9
     {
         $routeContext = RouteContext::fromRequest($request);
         $route = $routeContext->getRoute();
-        if (!$route) {
+        if ($route) {
             $this->logger->info('Security: No route in context');
             $this->unauthorised($this->logger, false, $request);
killedBy: MatchBot\Tests\Application\Actions\GetPaymentMethodsTest::testSuccess
statusReason: 1) MatchBot\Tests\Application\Actions\GetPaymentMethodsTest::testSuccess
Slim\Exception\HttpUnauthorizedException: Unauthorised

/home/barney/projects/matchbot/src/Application/Auth/ErrorTrait.php:26
/home/barney/projects/matchbot/src/Application/Auth/PersonManagementAuthMiddleware.php:36
/home/barney/projects/matchbot/vendor/slim/slim/Slim/MiddlewareDispatcher.php:168
/home/barney/projects/matchbo

[Killed] MethodCallRemoval
Application/Auth/PersonManagementAuthMiddleware.php:42:13
         $routeContext = RouteContext::fromRequest($request);
         $route = $routeContext->getRoute();
         if (!$route) {
-            $this->logger->info('Security: No route in context');
+            
             $this->unauthorised($this->logger, false, $request);
         }
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

.....                                                               5 / 5 (100%)

Time: 00:00.025, Memory: 16.00 MB

OK (5 tests, 10 assertions)

[Killed] FalseValue
Application/Auth/PersonManagementAuthMiddleware.php:43:13
         $route = $routeContext->getRoute();
         if (!$route) {
             $this->logger->info('Security: No route in context');
-            $this->unauthorised($this->logger, false, $request);
+            $this->unauthorised($this->logger, true, $request);
         }
 
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

.....                                                               5 / 5 (100%)

Time: 00:00.024, Memory: 16.00 MB

OK (5 tests, 10 assertions)

[Killed] MethodCallRemoval
Application/Auth/PersonManagementAuthMiddleware.php:43:13
         $route = $routeContext->getRoute();
         if (!$route) {
             $this->logger->info('Security: No route in context');
-            $this->unauthorised($this->logger, false, $request);
+            
         }
 
killedBy: MatchBot\Tests\Application\Auth\PersonManagementAuthMiddlewareTest::testNoRouteInContext
statusReason: 1) MatchBot\Tests\Application\Auth\PersonManagementAuthMiddlewareTest::testNoRouteInContext
Failed asserting that exception of type "Error" matches expected exception "Slim\Exception\HttpUnauthorizedException". Message was: "Call to a member function getArgument() on null" at
/home/barney/projects/matchbot/src/Application/Auth/PersonManagementAuthMiddleware.php:38
/home/barney/projects/matchbot/te

[Killed] MethodCallRemoval
Application/Auth/PersonManagementAuthMiddleware.php:50:13
         $this->jws = $request->getHeaderLine('x-tbg-auth');
 
         if (empty($this->jws)) {
-            $this->logger->info('Security: No JWT provided');
+            
             $this->unauthorised($this->logger, true, $request);
         }
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

.....                                                               5 / 5 (100%)

Time: 00:00.026, Memory: 16.00 MB

OK (5 tests, 10 assertions)

[Killed] LogicalNot
Application/Auth/PersonManagementAuthMiddleware.php:54:9
             $this->unauthorised($this->logger, true, $request);
         }
 
-        if (!$this->token->check($personId, $this->jws, $this->logger)) {
+        if ($this->token->check($personId, $this->jws, $this->logger)) {
             $this->logger->info(sprintf('Security: JWT check failed for person ID %s', $personId));
             $this->unauthorised($this->logger, false, $request);
killedBy: MatchBot\Tests\Application\Actions\GetPaymentMethodsTest::testSuccess
statusReason: 1) MatchBot\Tests\Application\Actions\GetPaymentMethodsTest::testSuccess
Slim\Exception\HttpUnauthorizedException: Unauthorised

/home/barney/projects/matchbot/src/Application/Auth/ErrorTrait.php:26
/home/barney/projects/matchbot/src/Application/Auth/PersonManagementAuthMiddleware.php:46
/home/barney/projects/matchbot/vendor/slim/slim/Slim/MiddlewareDispatcher.php:168
/home/barney/projects/matchbo

[Killed] MethodCallRemoval
Application/Auth/PersonManagementAuthMiddleware.php:55:13
         }
 
         if (!$this->token->check($personId, $this->jws, $this->logger)) {
-            $this->logger->info(sprintf('Security: JWT check failed for person ID %s', $personId));
+            
             $this->unauthorised($this->logger, false, $request);
         }
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

..............                                                    14 / 14 (100%)

Time: 00:00.066, Memory: 22.00 MB

OK (14 tests, 205 assertions)

[Killed] FalseValue
Application/Auth/PersonManagementAuthMiddleware.php:56:13
 
         if (!$this->token->check($personId, $this->jws, $this->logger)) {
             $this->logger->info(sprintf('Security: JWT check failed for person ID %s', $personId));
-            $this->unauthorised($this->logger, false, $request);
+            $this->unauthorised($this->logger, true, $request);
         }
 
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

..............                                                    14 / 14 (100%)

Time: 00:00.081, Memory: 22.00 MB

OK (14 tests, 205 assertions)

[Killed] MethodCallRemoval
Application/Auth/PersonManagementAuthMiddleware.php:56:13
 
         if (!$this->token->check($personId, $this->jws, $this->logger)) {
             $this->logger->info(sprintf('Security: JWT check failed for person ID %s', $personId));
-            $this->unauthorised($this->logger, false, $request);
+            
         }
 
killedBy: MatchBot\Tests\Application\Actions\Donations\CreateTest::testMatchedCampaignAndPspCustomerIdButWrongPersonInRoute
statusReason: 1) MatchBot\Tests\Application\Actions\Donations\CreateTest::testMatchedCampaignAndPspCustomerIdButWrongPersonInRoute
Attempt to read property "id" on null

/home/barney/projects/matchbot/src/Application/Actions/Donations/Create.php:239
/home/barney/projects/matchbot/src/Application/Actions/Action.php:34
/home/barney/projects/matchbot/vendor/slim/slim/Slim/Handlers/Strategies/RequestResponse.php:38

[Killed] MethodCallRemoval
Application/Auth/PersonManagementAuthMiddleware.php:59:9
             $this->unauthorised($this->logger, false, $request);
         }
 
-        $this->checkCompleteness($request);
+        
 
         return $handler->handle($request->withAttribute(self::PSP_ATTRIBUTE_NAME, IdentityToken::getPspId($this->jws)));
killedBy: MatchBot\Tests\Application\Auth\PersonWithPasswordAuthMiddlewareTest::testIncompleteDonorJwt
statusReason: 1) MatchBot\Tests\Application\Auth\PersonWithPasswordAuthMiddlewareTest::testIncompleteDonorJwt
Failed asserting that exception of type "Stripe\Exception\AuthenticationException" matches expected exception "Slim\Exception\HttpUnauthorizedException". Message was: "Invalid API Key provided: sk_test_***********eKey" at
/home/barney/projects/matchbot/vendor/stripe/stripe-php/lib/Exception/ApiErrorExce

[Killed] ProtectedVisibility
Application/Auth/PersonManagementAuthMiddleware.php:64:5
         return $handler->handle($request->withAttribute(self::PSP_ATTRIBUTE_NAME, IdentityToken::getPspId($this->jws)));
     }
 
-    protected function checkCompleteness(ServerRequestInterface $request): void
+    private function checkCompleteness(ServerRequestInterface $request) : void
     {
         // No-op: we allow both values for this base middleware. This should be extended
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

..............                                                    14 / 14 (100%)

Time: 00:00.074, Memory: 22.00 MB

OK (14 tests, 205 assertions)
