[NoCoverage] InstanceOf_
Application/Handlers/HttpErrorHandler.php:35:9
             'An internal error has occurred while processing your request.'
         );
 
-        if ($exception instanceof HttpException) {
+        if (false) {
             $statusCode = $exception->getCode();
             $error->setDescription($exception->getMessage());

[NoCoverage] InstanceOf_
Application/Handlers/HttpErrorHandler.php:35:9
             'An internal error has occurred while processing your request.'
         );
 
-        if ($exception instanceof HttpException) {
+        if (true) {
             $statusCode = $exception->getCode();
             $error->setDescription($exception->getMessage());

[NoCoverage] InstanceOf_
Application/Handlers/HttpErrorHandler.php:39:13
             $statusCode = $exception->getCode();
             $error->setDescription($exception->getMessage());
 
-            if ($exception instanceof HttpNotFoundException) {
+            if (false) {
                 $error->setType(ActionError::RESOURCE_NOT_FOUND);
             } elseif ($exception instanceof HttpMethodNotAllowedException) {

[NoCoverage] InstanceOf_
Application/Handlers/HttpErrorHandler.php:39:13
             $statusCode = $exception->getCode();
             $error->setDescription($exception->getMessage());
 
-            if ($exception instanceof HttpNotFoundException) {
+            if (true) {
                 $error->setType(ActionError::RESOURCE_NOT_FOUND);
             } elseif ($exception instanceof HttpMethodNotAllowedException) {

[NoCoverage] InstanceOf_
Application/Handlers/HttpErrorHandler.php:43:13
                 $error->setType(ActionError::RESOURCE_NOT_FOUND);
             } elseif ($exception instanceof HttpMethodNotAllowedException) {
                 $error->setType(ActionError::NOT_ALLOWED);
-            } elseif ($exception instanceof HttpUnauthorizedException) {
+            } elseif (false) {
                 $error->setType(ActionError::UNAUTHENTICATED);
             } elseif ($exception instanceof HttpForbiddenException) {

[NoCoverage] InstanceOf_
Application/Handlers/HttpErrorHandler.php:43:13
                 $error->setType(ActionError::RESOURCE_NOT_FOUND);
             } elseif ($exception instanceof HttpMethodNotAllowedException) {
                 $error->setType(ActionError::NOT_ALLOWED);
-            } elseif ($exception instanceof HttpUnauthorizedException) {
+            } elseif (true) {
                 $error->setType(ActionError::UNAUTHENTICATED);
             } elseif ($exception instanceof HttpForbiddenException) {

[NoCoverage] MethodCallRemoval
Application/Handlers/HttpErrorHandler.php:44:17
             } elseif ($exception instanceof HttpMethodNotAllowedException) {
                 $error->setType(ActionError::NOT_ALLOWED);
             } elseif ($exception instanceof HttpUnauthorizedException) {
-                $error->setType(ActionError::UNAUTHENTICATED);
+                
             } elseif ($exception instanceof HttpForbiddenException) {
                 $error->setType(ActionError::INSUFFICIENT_PRIVILEGES);

[NoCoverage] InstanceOf_
Application/Handlers/HttpErrorHandler.php:45:13
                 $error->setType(ActionError::NOT_ALLOWED);
             } elseif ($exception instanceof HttpUnauthorizedException) {
                 $error->setType(ActionError::UNAUTHENTICATED);
-            } elseif ($exception instanceof HttpForbiddenException) {
+            } elseif (true) {
                 $error->setType(ActionError::INSUFFICIENT_PRIVILEGES);
             } elseif ($exception instanceof HttpBadRequestException) {

[NoCoverage] InstanceOf_
Application/Handlers/HttpErrorHandler.php:45:13
                 $error->setType(ActionError::NOT_ALLOWED);
             } elseif ($exception instanceof HttpUnauthorizedException) {
                 $error->setType(ActionError::UNAUTHENTICATED);
-            } elseif ($exception instanceof HttpForbiddenException) {
+            } elseif (false) {
                 $error->setType(ActionError::INSUFFICIENT_PRIVILEGES);
             } elseif ($exception instanceof HttpBadRequestException) {

[NoCoverage] MethodCallRemoval
Application/Handlers/HttpErrorHandler.php:46:17
             } elseif ($exception instanceof HttpUnauthorizedException) {
                 $error->setType(ActionError::UNAUTHENTICATED);
             } elseif ($exception instanceof HttpForbiddenException) {
-                $error->setType(ActionError::INSUFFICIENT_PRIVILEGES);
+                
             } elseif ($exception instanceof HttpBadRequestException) {
                 $error->setType(ActionError::BAD_REQUEST);

[NoCoverage] InstanceOf_
Application/Handlers/HttpErrorHandler.php:47:13
                 $error->setType(ActionError::UNAUTHENTICATED);
             } elseif ($exception instanceof HttpForbiddenException) {
                 $error->setType(ActionError::INSUFFICIENT_PRIVILEGES);
-            } elseif ($exception instanceof HttpBadRequestException) {
+            } elseif (false) {
                 $error->setType(ActionError::BAD_REQUEST);
             } elseif ($exception instanceof HttpNotImplementedException) {

[NoCoverage] InstanceOf_
Application/Handlers/HttpErrorHandler.php:47:13
                 $error->setType(ActionError::UNAUTHENTICATED);
             } elseif ($exception instanceof HttpForbiddenException) {
                 $error->setType(ActionError::INSUFFICIENT_PRIVILEGES);
-            } elseif ($exception instanceof HttpBadRequestException) {
+            } elseif (true) {
                 $error->setType(ActionError::BAD_REQUEST);
             } elseif ($exception instanceof HttpNotImplementedException) {

[NoCoverage] MethodCallRemoval
Application/Handlers/HttpErrorHandler.php:48:17
             } elseif ($exception instanceof HttpForbiddenException) {
                 $error->setType(ActionError::INSUFFICIENT_PRIVILEGES);
             } elseif ($exception instanceof HttpBadRequestException) {
-                $error->setType(ActionError::BAD_REQUEST);
+                
             } elseif ($exception instanceof HttpNotImplementedException) {
                 $error->setType(ActionError::NOT_IMPLEMENTED);

[NoCoverage] InstanceOf_
Application/Handlers/HttpErrorHandler.php:49:13
                 $error->setType(ActionError::INSUFFICIENT_PRIVILEGES);
             } elseif ($exception instanceof HttpBadRequestException) {
                 $error->setType(ActionError::BAD_REQUEST);
-            } elseif ($exception instanceof HttpNotImplementedException) {
+            } elseif (false) {
                 $error->setType(ActionError::NOT_IMPLEMENTED);
             }

[NoCoverage] InstanceOf_
Application/Handlers/HttpErrorHandler.php:49:13
                 $error->setType(ActionError::INSUFFICIENT_PRIVILEGES);
             } elseif ($exception instanceof HttpBadRequestException) {
                 $error->setType(ActionError::BAD_REQUEST);
-            } elseif ($exception instanceof HttpNotImplementedException) {
+            } elseif (true) {
                 $error->setType(ActionError::NOT_IMPLEMENTED);
             }

[NoCoverage] LogicalAnd
Application/Handlers/HttpErrorHandler.php:55:13
         }
 
         if (
-            !($exception instanceof HttpException)
-            && ($exception instanceof Exception || $exception instanceof Throwable)
+            if ((!$exception instanceof HttpException || ($exception instanceof Exception || $exception instanceof Throwable)) && $this->displayErrorDetails) { $exception instanceof Throwable)
             && $this->displayErrorDetails
         ) {

[NoCoverage] LogicalNot
Application/Handlers/HttpErrorHandler.php:55:13
         }
 
         if (
-            !($exception instanceof HttpException)
+            if ($exception instanceof HttpException && ($exception instanceof Exception || $exception instanceof Throwable) && $this->displayErrorDetails) {
             && ($exception instanceof Exception || $exception instanceof Throwable)
             && $this->displayErrorDetails

[NoCoverage] InstanceOf_
Application/Handlers/HttpErrorHandler.php:56:13
 
         if (
             !($exception instanceof HttpException)
-            && ($exception instanceof Exception || $exception instanceof Throwable)
+            if (!$exception instanceof HttpException && (false || $exception instanceof Throwable) && $this->displayErrorDetails) {
             && $this->displayErrorDetails
         ) {

[NoCoverage] LogicalOr
Application/Handlers/HttpErrorHandler.php:56:13
 
         if (
             !($exception instanceof HttpException)
-            && ($exception instanceof Exception || $exception instanceof Throwable)
+            if (!$exception instanceof HttpException && ($exception instanceof Exception && $exception instanceof Throwable) && $this->displayErrorDetails) {
             && $this->displayErrorDetails
         ) {

[NoCoverage] MethodCallRemoval
Application/Handlers/HttpErrorHandler.php:59:13
             && ($exception instanceof Exception || $exception instanceof Throwable)
             && $this->displayErrorDetails
         ) {
-            $error->setDescription($exception->getMessage());
+            
         }
 

[NoCoverage] LogicalNot
Application/Handlers/HttpErrorHandler.php:68:9
         $response = $this->responseFactory->createResponse($statusCode);
         $response->getBody()->write($encodedPayload);
 
-        if (!($this->exception instanceof HttpException)) {
+        if ($this->exception instanceof HttpException) {
             $this->logError(sprintf(
                 "%s: %s \n#\n %s \n %s",

[NoCoverage] InstanceOf_
Application/Handlers/HttpErrorHandler.php:68:9
         $response = $this->responseFactory->createResponse($statusCode);
         $response->getBody()->write($encodedPayload);
 
-        if (!($this->exception instanceof HttpException)) {
+        if (!false) {
             $this->logError(sprintf(
                 "%s: %s \n#\n %s \n %s",

[NoCoverage] MethodCallRemoval
Application/Handlers/HttpErrorHandler.php:69:13
         $response->getBody()->write($encodedPayload);
 
         if (!($this->exception instanceof HttpException)) {
-            $this->logError(sprintf(
-                "%s: %s \n#\n %s \n %s",
-                get_class($this->exception),
-                $this->exception->getMessage(),
-                $this->exception->getFile() . ":" . $this->exception->getLine(),
-                $this->exception->getTraceAsString(),
-            ));
+            
         }
 

[NoCoverage] ConcatOperandRemoval
Application/Handlers/HttpErrorHandler.php:73:17
                 "%s: %s \n#\n %s \n %s",
                 get_class($this->exception),
                 $this->exception->getMessage(),
-                $this->exception->getFile() . ":" . $this->exception->getLine(),
+                $this->logError(sprintf("%s: %s \n#\n %s \n %s", get_class($this->exception), $this->exception->getMessage(), ":" . $this->exception->getLine(), $this->exception->getTraceAsString()));
                 $this->exception->getTraceAsString(),
             ));

[NoCoverage] ConcatOperandRemoval
Application/Handlers/HttpErrorHandler.php:73:17
                 "%s: %s \n#\n %s \n %s",
                 get_class($this->exception),
                 $this->exception->getMessage(),
-                $this->exception->getFile() . ":" . $this->exception->getLine(),
+                $this->logError(sprintf("%s: %s \n#\n %s \n %s", get_class($this->exception), $this->exception->getMessage(), $this->exception->getFile() . ":", $this->exception->getTraceAsString()));
                 $this->exception->getTraceAsString(),
             ));
