[NoCoverage] Foreach_
Application/Actions/Donations/Confirm.php:49:9
     {
         $exceptionMessage = $exception->getMessage();
 
-        foreach (self::EXPECTED_STRIPE_INVALID_REQUEST_MESSAGES as $expectedMessage) {
-            if (str_contains($exceptionMessage, $expectedMessage)) {
-                return true;
-            }
-        }
+        foreach (array() as $expectedMessage) {
 
         return false;

[NoCoverage] IfNegation
Application/Actions/Donations/Confirm.php:50:13
         $exceptionMessage = $exception->getMessage();
 
         foreach (self::EXPECTED_STRIPE_INVALID_REQUEST_MESSAGES as $expectedMessage) {
-            if (str_contains($exceptionMessage, $expectedMessage)) {
-                return true;
-            }
+            if (!str_contains($exceptionMessage, $expectedMessage)) {
         }
 

[NoCoverage] TrueValue
Application/Actions/Donations/Confirm.php:51:17
 
         foreach (self::EXPECTED_STRIPE_INVALID_REQUEST_MESSAGES as $expectedMessage) {
             if (str_contains($exceptionMessage, $expectedMessage)) {
-                return true;
+                return false;
             }
         }

[Survived] IncrementInteger
Application/Actions/Donations/Confirm.php:67:17
     {
         try {
             $requestBody = json_decode(
-                $request->getBody()->getContents(), true, 512, JSON_THROW_ON_ERROR
+                $requestBody = json_decode($request->getBody()->getContents(), true, 513, JSON_THROW_ON_ERROR);
             );
         } catch (\JsonException) {

[Survived] DecrementInteger
Application/Actions/Donations/Confirm.php:67:17
     {
         try {
             $requestBody = json_decode(
-                $request->getBody()->getContents(), true, 512, JSON_THROW_ON_ERROR
+                $requestBody = json_decode($request->getBody()->getContents(), true, 511, JSON_THROW_ON_ERROR);
             );
         } catch (\JsonException) {

[NoCoverage] Throw_
Application/Actions/Donations/Confirm.php:70:13
                 $request->getBody()->getContents(), true, 512, JSON_THROW_ON_ERROR
             );
         } catch (\JsonException) {
-            throw new HttpBadRequestException($request, 'Cannot parse request body as JSON');
+            new HttpBadRequestException($request, 'Cannot parse request body as JSON');
         }
         \assert(is_array($requestBody));

[Survived] MethodCallRemoval
Application/Actions/Donations/Confirm.php:77:9
         $pamentMethodId = $requestBody['stripePaymentMethodId'];
         \assert((is_string($pamentMethodId)));
 
-        $this->entityManager->beginTransaction();
+        
 
         $donation = $this->donationRepository->findAndLockOneBy(['uuid' => $args['donationId']]);

[Killed] ArrayItemRemoval
Application/Actions/Donations/Confirm.php:79:9
 
         $this->entityManager->beginTransaction();
 
-        $donation = $this->donationRepository->findAndLockOneBy(['uuid' => $args['donationId']]);
+        $donation = $this->donationRepository->findAndLockOneBy([]);
         if (! $donation) {
             throw new NotFoundException();
killedBy: MatchBot\Tests\Application\Actions\Donations\ConfirmTest::test_it_confirms_a_card_donation
statusReason: 1) MatchBot\Tests\Application\Actions\Donations\ConfirmTest::test_it_confirms_a_card_donation
MatchBot\Client\NotFoundException: 

/home/barney/projects/matchbot/src/Application/Actions/Donations/Confirm.php:63
/home/barney/projects/matchbot/src/Application/Actions/Action.php:34
/home/barney/projects/matchbot/tests/Application/Actions/Donations/ConfirmTest.php:343
/home/barney/projects/matchbot/te

[Killed] LogicalNot
Application/Actions/Donations/Confirm.php:80:9
         $this->entityManager->beginTransaction();
 
         $donation = $this->donationRepository->findAndLockOneBy(['uuid' => $args['donationId']]);
-        if (! $donation) {
+        if ($donation) {
             throw new NotFoundException();
         }
killedBy: MatchBot\Tests\Application\Actions\Donations\ConfirmTest::test_it_confirms_a_card_donation
statusReason: 1) MatchBot\Tests\Application\Actions\Donations\ConfirmTest::test_it_confirms_a_card_donation
MatchBot\Client\NotFoundException: 

/home/barney/projects/matchbot/src/Application/Actions/Donations/Confirm.php:63
/home/barney/projects/matchbot/src/Application/Actions/Action.php:34
/home/barney/projects/matchbot/tests/Application/Actions/Donations/ConfirmTest.php:343
/home/barney/projects/matchbot/te

[NoCoverage] Throw_
Application/Actions/Donations/Confirm.php:81:13
 
         $donation = $this->donationRepository->findAndLockOneBy(['uuid' => $args['donationId']]);
         if (! $donation) {
-            throw new NotFoundException();
+            new NotFoundException();
         }
 

[Killed] NotIdentical
Application/Actions/Donations/Confirm.php:87:9
         $paymentIntentId = $donation->getTransactionId();
         $paymentMethod = $this->stripeClient->paymentMethods->retrieve($pamentMethodId);
 
-        if ($paymentMethod->type !== 'card') {
+        if ($paymentMethod->type === 'card') {
             throw new HttpBadRequestException($request, 'Confirm endpoint only supports card payments for now');
         }
killedBy: MatchBot\Tests\Application\Actions\Donations\ConfirmTest::test_it_confirms_a_card_donation
statusReason: 1) MatchBot\Tests\Application\Actions\Donations\ConfirmTest::test_it_confirms_a_card_donation
Slim\Exception\HttpBadRequestException: Confirm endpoint only supports card payments for now

/home/barney/projects/matchbot/src/Application/Actions/Donations/Confirm.php:68
/home/barney/projects/matchbot/src/Application/Actions/Action.php:34
/home/barney/projects/matchbot/tests/Application/Actions/Donati

[NoCoverage] Throw_
Application/Actions/Donations/Confirm.php:88:13
         $paymentMethod = $this->stripeClient->paymentMethods->retrieve($pamentMethodId);
 
         if ($paymentMethod->type !== 'card') {
-            throw new HttpBadRequestException($request, 'Confirm endpoint only supports card payments for now');
+            new HttpBadRequestException($request, 'Confirm endpoint only supports card payments for now');
         }
 

[Killed] LogicalNot
Application/Actions/Donations/Confirm.php:100:9
         // two letter upper string, e.g. 'GB', 'US'.
         $cardCountry = $paymentMethod->card->country;
         \assert(is_string($cardCountry));
-        if (! in_array($cardBrand, Calculator::STRIPE_CARD_BRANDS, true)) {
+        if (in_array($cardBrand, Calculator::STRIPE_CARD_BRANDS, true)) {
             throw new HttpBadRequestException($request, "Unrecognised card brand");
         }
killedBy: MatchBot\Tests\Application\Actions\Donations\ConfirmTest::test_it_confirms_a_card_donation
statusReason: 1) MatchBot\Tests\Application\Actions\Donations\ConfirmTest::test_it_confirms_a_card_donation
Slim\Exception\HttpBadRequestException: Unrecognised card brand

/home/barney/projects/matchbot/src/Application/Actions/Donations/Confirm.php:79
/home/barney/projects/matchbot/src/Application/Actions/Action.php:34
/home/barney/projects/matchbot/tests/Application/Actions/Donations/ConfirmTest.php:343
/home

[NoCoverage] Throw_
Application/Actions/Donations/Confirm.php:101:13
         $cardCountry = $paymentMethod->card->country;
         \assert(is_string($cardCountry));
         if (! in_array($cardBrand, Calculator::STRIPE_CARD_BRANDS, true)) {
-            throw new HttpBadRequestException($request, "Unrecognised card brand");
+            new HttpBadRequestException($request, "Unrecognised card brand");
         }
 

[Killed] MethodCallRemoval
Application/Actions/Donations/Confirm.php:107:9
         // at present if the following line was left out we would charge a wrong fee in some cases. I'm not happy with
         // that, would like to find a way to make it so if its left out we get an error instead - either by having
         // derive fees return a value, or making functions like Donation::getCharityFeeGross throw if called before it.
-        $this->donationRepository->deriveFees($donation, $cardBrand, $cardCountry);
+        
 
         $this->stripeClient->paymentIntents->update($paymentIntentId, [
killedBy: MatchBot\Tests\Application\Actions\Donations\ConfirmTest::test_it_confirms_a_card_donation
statusReason: 1) MatchBot\Tests\Application\Actions\Donations\ConfirmTest::test_it_confirms_a_card_donation
Prophecy\Exception\Call\UnexpectedCallException: Unexpected method call on Double\Stripe\Service\PaymentIntentService\P3:
  - update(
        "PAYMENT_INTENT_ID",
        ["metadata" => ["stripeFeeRechargeGross" => "0.00", "stripeFeeRechargeNet" => "0.00", "stripeFeeRechargeVat" => "0.00"], "application_f

[Killed] MethodCallRemoval
Application/Actions/Donations/Confirm.php:109:9
         // derive fees return a value, or making functions like Donation::getCharityFeeGross throw if called before it.
         $this->donationRepository->deriveFees($donation, $cardBrand, $cardCountry);
 
-        $this->stripeClient->paymentIntents->update($paymentIntentId, [
-            // only setting things that may need to be updated at this point.
-            'metadata' => [
-                'stripeFeeRechargeGross' => $donation->getCharityFeeGross(),
-                'stripeFeeRechargeNet' => $donation->getCharityFee(),
-                'stripeFeeRechargeVat' => $donation->getCharityFeeVat(),
-            ],
-            // See https://stripe.com/docs/connect/destination-charges#application-fee
-            // Update the fee amount in case the final charge was from
-            // e.g. a Non EU / Amex card where fees are varied.
-            'application_fee_amount' => $donation->getAmountToDeductFractional(),
-            // Note that `on_behalf_of` is set up on create and is *not allowed* on update.
-        ]);
+        
 
         try {
killedBy: MatchBot\Tests\Application\Actions\Donations\ConfirmTest::test_it_confirms_a_card_donation
statusReason: 1) MatchBot\Tests\Application\Actions\Donations\ConfirmTest::test_it_confirms_a_card_donation
Some predictions failed:
Double\Stripe\Service\PaymentIntentService\P3:
  No calls have been made that match:
      Double\Stripe\Service\PaymentIntentService\P3->update(exact("PAYMENT_INTENT_ID"), exact(["metadata" => ["stripeFeeRechargeGross" => "42.00", "stripeFeeRechargeNet" => "42.00", "stripeFeeRech

[Killed] ArrayItem
Application/Actions/Donations/Confirm.php:119:13
             // See https://stripe.com/docs/connect/destination-charges#application-fee
             // Update the fee amount in case the final charge was from
             // e.g. a Non EU / Amex card where fees are varied.
-            'application_fee_amount' => $donation->getAmountToDeductFractional(),
+            'application_fee_amount' > $donation->getAmountToDeductFractional(),
             // Note that `on_behalf_of` is set up on create and is *not allowed* on update.
         ]);
killedBy: MatchBot\Tests\Application\Actions\Donations\ConfirmTest::test_it_confirms_a_card_donation
statusReason: 1) MatchBot\Tests\Application\Actions\Donations\ConfirmTest::test_it_confirms_a_card_donation
Prophecy\Exception\Call\UnexpectedCallException: Unexpected method call on Double\Stripe\Service\PaymentIntentService\P3:
  - update(
        "PAYMENT_INTENT_ID",
        ["metadata" => ["stripeFeeRechargeGross" => "42.00", "stripeFeeRechargeNet" => "42.00", "stripeFeeRechargeVat" => "0.00"], 0 => true]

[Killed] MethodCallRemoval
Application/Actions/Donations/Confirm.php:124:13
         ]);
 
         try {
-            $this->stripeClient->paymentIntents->confirm($paymentIntentId, [
-                'payment_method' => $pamentMethodId,
-            ]);
+            
         } catch (CardException $exception) {
             $exceptionClass = get_class($exception);
killedBy: MatchBot\Tests\Application\Actions\Donations\ConfirmTest::test_it_confirms_a_card_donation
statusReason: 1) MatchBot\Tests\Application\Actions\Donations\ConfirmTest::test_it_confirms_a_card_donation
Some predictions failed:
Double\Stripe\Service\PaymentIntentService\P3:
  No calls have been made that match:
      Double\Stripe\Service\PaymentIntentService\P3->confirm(exact("PAYMENT_INTENT_ID"), exact(["payment_method" => "PAYMENT_METHOD_ID"]))
    but expected at least one.

/home/barney/projects/mat

[Killed] ArrayItemRemoval
Application/Actions/Donations/Confirm.php:124:13
         ]);
 
         try {
-            $this->stripeClient->paymentIntents->confirm($paymentIntentId, [
-                'payment_method' => $pamentMethodId,
-            ]);
+            $this->stripeClient->paymentIntents->confirm($paymentIntentId, []);
         } catch (CardException $exception) {
             $exceptionClass = get_class($exception);
killedBy: MatchBot\Tests\Application\Actions\Donations\ConfirmTest::test_it_confirms_a_card_donation
statusReason: 1) MatchBot\Tests\Application\Actions\Donations\ConfirmTest::test_it_confirms_a_card_donation
Prophecy\Exception\Call\UnexpectedCallException: Unexpected method call on Double\Stripe\Service\PaymentIntentService\P3:
  - confirm(
        "PAYMENT_INTENT_ID",
        []
    )
expected calls were:
  - retrieve(

[Survived] MethodCallRemoval
Application/Actions/Donations/Confirm.php:129:13
             ]);
         } catch (CardException $exception) {
             $exceptionClass = get_class($exception);
-            $this->logger->info(sprintf(
-                'Stripe %s on Confirm for donation %s (%s): %s',
-                $exceptionClass,
-                $donation->getUuid(),
-                $paymentIntentId,
-                $exception->getMessage(),
-            ));
+            
 
             $this->entityManager->rollback();

[Survived] MethodCallRemoval
Application/Actions/Donations/Confirm.php:137:13
                 $exception->getMessage(),
             ));
 
-            $this->entityManager->rollback();
+            
 
             return new JsonResponse([

[Killed] ArrayItemRemoval
Application/Actions/Donations/Confirm.php:140:17
             $this->entityManager->rollback();
 
             return new JsonResponse([
-                'error' => [
-                    'message' => $exception->getMessage(),
-                    'code' => $exception->getStripeCode(),
-                    'decline_code' => $exception->getDeclineCode(),
-                ],
+                return new JsonResponse(['error' => ['code' => $exception->getStripeCode(), 'decline_code' => $exception->getDeclineCode()]], 402);
             ], 402);
         } catch (InvalidRequestException $exception) {
killedBy: MatchBot\Tests\Application\Actions\Donations\ConfirmTest::testItReturns402OnDecline
statusReason: 1) MatchBot\Tests\Application\Actions\Donations\ConfirmTest::testItReturns402OnDecline
Failed asserting that two arrays are identical.
--- Expected
+++ Actual
@@ @@
 Array &0 (
     'error' => Array &1 (
-        'message' => 'Your card was declined'

[Killed] DecrementInteger
Application/Actions/Donations/Confirm.php:145:13
                     'code' => $exception->getStripeCode(),
                     'decline_code' => $exception->getDeclineCode(),
                 ],
-            ], 402);
+            return new JsonResponse(['error' => ['message' => $exception->getMessage(), 'code' => $exception->getStripeCode(), 'decline_code' => $exception->getDeclineCode()]], 401);
         } catch (InvalidRequestException $exception) {
             // We've seen card test bots, and no humans, try to reuse payment methods like this as of Oct '23. For now
killedBy: MatchBot\Tests\Application\Actions\Donations\ConfirmTest::testItReturns402OnDecline
statusReason: 1) MatchBot\Tests\Application\Actions\Donations\ConfirmTest::testItReturns402OnDecline
Failed asserting that 401 is identical to 402.

/home/barney/projects/matchbot/tests/Application/Actions/Donations/ConfirmTest.php:117

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] IncrementInteger
Application/Actions/Donations/Confirm.php:145:13
                     'code' => $exception->getStripeCode(),
                     'decline_code' => $exception->getDeclineCode(),
                 ],
-            ], 402);
+            return new JsonResponse(['error' => ['message' => $exception->getMessage(), 'code' => $exception->getStripeCode(), 'decline_code' => $exception->getDeclineCode()]], 403);
         } catch (InvalidRequestException $exception) {
             // We've seen card test bots, and no humans, try to reuse payment methods like this as of Oct '23. For now
killedBy: MatchBot\Tests\Application\Actions\Donations\ConfirmTest::testItReturns402OnDecline
statusReason: 1) MatchBot\Tests\Application\Actions\Donations\ConfirmTest::testItReturns402OnDecline
Failed asserting that 403 is identical to 402.

/home/barney/projects/matchbot/tests/Application/Actions/Donations/ConfirmTest.php:117

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] IfNegation
Application/Actions/Donations/Confirm.php:156:13
             $paymentMethodReuseAttempted = (
                 str_contains($exception->getMessage(), 'The provided PaymentMethod was previously used')
             );
-            if ($paymentMethodReuseAttempted) {
-                $this->logger->warning(sprintf(
-                    'Stripe InvalidRequestException on Confirm for donation %s (%s): %s',
-                    $donation->getUuid(),
-                    $paymentIntentId,
-                    $exception->getMessage(),
-                ));
-
-                $this->entityManager->rollback();
-
-                return new JsonResponse([
-                    'error' => [
-                        'message' => 'Payment method cannot be used again',
-                        'code' => $exception->getStripeCode(),
-                    ],
-                ], 402);
-            }
+            if (!$paymentMethodReuseAttempted) {
 
             if (!$this->errorMessageFromStripeIsExpected($exception)) {
killedBy: MatchBot\Tests\Application\Actions\Donations\ConfirmTest::testItReturns402OnStalePaymentMethodReuse
statusReason: 1) MatchBot\Tests\Application\Actions\Donations\ConfirmTest::testItReturns402OnStalePaymentMethodReuse
Stripe\Exception\InvalidRequestException: The provided PaymentMethod was previously used with a PaymentIntent without Customer attachment...

/home/barney/projects/matchbot/vendor/stripe/stripe-php/lib/Exception/ApiErrorException.php:38
/home/barney/projects/matchbot/vendor/stripe/stripe-php/lib/

[Survived] MethodCallRemoval
Application/Actions/Donations/Confirm.php:157:17
                 str_contains($exception->getMessage(), 'The provided PaymentMethod was previously used')
             );
             if ($paymentMethodReuseAttempted) {
-                $this->logger->warning(sprintf(
-                    'Stripe InvalidRequestException on Confirm for donation %s (%s): %s',
-                    $donation->getUuid(),
-                    $paymentIntentId,
-                    $exception->getMessage(),
-                ));
+                
 
                 $this->entityManager->rollback();

[Killed] DecrementInteger
Application/Actions/Donations/Confirm.php:171:17
                         'message' => 'Payment method cannot be used again',
                         'code' => $exception->getStripeCode(),
                     ],
-                ], 402);
+                return new JsonResponse(['error' => ['message' => 'Payment method cannot be used again', 'code' => $exception->getStripeCode()]], 401);
             }
 
killedBy: MatchBot\Tests\Application\Actions\Donations\ConfirmTest::testItReturns402OnStalePaymentMethodReuse
statusReason: 1) MatchBot\Tests\Application\Actions\Donations\ConfirmTest::testItReturns402OnStalePaymentMethodReuse
Failed asserting that 401 is identical to 402.

/home/barney/projects/matchbot/tests/Application/Actions/Donations/ConfirmTest.php:174

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] IncrementInteger
Application/Actions/Donations/Confirm.php:171:17
                         'message' => 'Payment method cannot be used again',
                         'code' => $exception->getStripeCode(),
                     ],
-                ], 402);
+                return new JsonResponse(['error' => ['message' => 'Payment method cannot be used again', 'code' => $exception->getStripeCode()]], 403);
             }
 
killedBy: MatchBot\Tests\Application\Actions\Donations\ConfirmTest::testItReturns402OnStalePaymentMethodReuse
statusReason: 1) MatchBot\Tests\Application\Actions\Donations\ConfirmTest::testItReturns402OnStalePaymentMethodReuse
Failed asserting that 403 is identical to 402.

/home/barney/projects/matchbot/tests/Application/Actions/Donations/ConfirmTest.php:174

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[NoCoverage] LogicalNot
Application/Actions/Donations/Confirm.php:174:13
                 ], 402);
             }
 
-            if (!$this->errorMessageFromStripeIsExpected($exception)) {
+            if ($this->errorMessageFromStripeIsExpected($exception)) {
                 throw $exception;
             }

[NoCoverage] Throw_
Application/Actions/Donations/Confirm.php:175:17
             }
 
             if (!$this->errorMessageFromStripeIsExpected($exception)) {
-                throw $exception;
+                $exception;
             }
 

[NoCoverage] MethodCallRemoval
Application/Actions/Donations/Confirm.php:179:13
             }
 
             $exceptionClass = get_class($exception);
-            $this->logger->warning(sprintf(
-                'Stripe %s on Confirm for donation %s (%s): %s',
-                $exceptionClass,
-                $donation->getUuid(),
-                $paymentIntentId,
-                $exception->getMessage(),
-            ));
+            
 
             $this->entityManager->rollback();

[NoCoverage] ArrayItem
Application/Actions/Donations/Confirm.php:191:21
 
             return new JsonResponse([
                 'error' => [
-                    'message' => $exception->getMessage(),
+                    return new JsonResponse(['error' => ['message' > $exception->getMessage(), 'code' => $exception->getStripeCode()]], 402);
                     'code' => $exception->getStripeCode()
                 ],

[NoCoverage] ArrayItem
Application/Actions/Donations/Confirm.php:192:21
             return new JsonResponse([
                 'error' => [
                     'message' => $exception->getMessage(),
-                    'code' => $exception->getStripeCode()
+                    return new JsonResponse(['error' => ['message' => $exception->getMessage(), 'code' > $exception->getStripeCode()]], 402);
                 ],
             ], 402);

[NoCoverage] DecrementInteger
Application/Actions/Donations/Confirm.php:194:13
                     'message' => $exception->getMessage(),
                     'code' => $exception->getStripeCode()
                 ],
-            ], 402);
+            return new JsonResponse(['error' => ['message' => $exception->getMessage(), 'code' => $exception->getStripeCode()]], 401);
         } catch (ApiErrorException $exception) {
             $this->logger->error(sprintf(

[NoCoverage] IncrementInteger
Application/Actions/Donations/Confirm.php:194:13
                     'message' => $exception->getMessage(),
                     'code' => $exception->getStripeCode()
                 ],
-            ], 402);
+            return new JsonResponse(['error' => ['message' => $exception->getMessage(), 'code' => $exception->getStripeCode()]], 403);
         } catch (ApiErrorException $exception) {
             $this->logger->error(sprintf(

[Survived] MethodCallRemoval
Application/Actions/Donations/Confirm.php:196:13
                 ],
             ], 402);
         } catch (ApiErrorException $exception) {
-            $this->logger->error(sprintf(
-                'Stripe %s on Confirm for donation %s (%s): %s',
-                get_class($exception),
-                $donation->getUuid(),
-                $paymentIntentId,
-                $exception->getMessage(),
-            ));
+            
 
             $this->entityManager->rollback();

[Killed] ArrayItemRemoval
Application/Actions/Donations/Confirm.php:207:17
             $this->entityManager->rollback();
 
             return new JsonResponse([
-                'error' => [
-                    'message' => $exception->getMessage(),
-                    'code' => $exception->getStripeCode(),
-                ],
+                return new JsonResponse(['error' => ['code' => $exception->getStripeCode()]], 500);
             ], 500);
         }
killedBy: MatchBot\Tests\Application\Actions\Donations\ConfirmTest::testItReturns500OnApiError
statusReason: 1) MatchBot\Tests\Application\Actions\Donations\ConfirmTest::testItReturns500OnApiError
Failed asserting that two arrays are identical.
--- Expected
+++ Actual
@@ @@
 Array &0 (
     'error' => Array &1 (
-        'message' => 'Stripe is down!'

[Killed] DecrementInteger
Application/Actions/Donations/Confirm.php:211:13
                     'message' => $exception->getMessage(),
                     'code' => $exception->getStripeCode(),
                 ],
-            ], 500);
+            return new JsonResponse(['error' => ['message' => $exception->getMessage(), 'code' => $exception->getStripeCode()]], 499);
         }
 
killedBy: MatchBot\Tests\Application\Actions\Donations\ConfirmTest::testItReturns500OnApiError
statusReason: 1) MatchBot\Tests\Application\Actions\Donations\ConfirmTest::testItReturns500OnApiError
Failed asserting that 499 is identical to 500.

/home/barney/projects/matchbot/tests/Application/Actions/Donations/ConfirmTest.php:226

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] IncrementInteger
Application/Actions/Donations/Confirm.php:211:13
                     'message' => $exception->getMessage(),
                     'code' => $exception->getStripeCode(),
                 ],
-            ], 500);
+            return new JsonResponse(['error' => ['message' => $exception->getMessage(), 'code' => $exception->getStripeCode()]], 501);
         }
 
killedBy: MatchBot\Tests\Application\Actions\Donations\ConfirmTest::testItReturns500OnApiError
statusReason: 1) MatchBot\Tests\Application\Actions\Donations\ConfirmTest::testItReturns500OnApiError
Failed asserting that 501 is identical to 500.

/home/barney/projects/matchbot/tests/Application/Actions/Donations/ConfirmTest.php:226

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Survived] MethodCallRemoval
Application/Actions/Donations/Confirm.php:216:9
 
         $updatedIntent = $this->stripeClient->paymentIntents->retrieve($paymentIntentId);
 
-        $this->entityManager->flush();
+        
 
         return new JsonResponse([

[Killed] ArrayItemRemoval
Application/Actions/Donations/Confirm.php:218:9
 
         $this->entityManager->flush();
 
-        return new JsonResponse([
-            'paymentIntent' => [
-                'status' => $updatedIntent->status,
-                'client_secret' => $updatedIntent->status === 'requires_action'
-                    ?  $updatedIntent->client_secret
-                    : null,
-            ],
-        ]);
+        return new JsonResponse([]);
     }
 }
killedBy: MatchBot\Tests\Application\Actions\Donations\ConfirmTest::test_it_confirms_a_card_donation
statusReason: 1) MatchBot\Tests\Application\Actions\Donations\ConfirmTest::test_it_confirms_a_card_donation
Failed asserting that two arrays are identical.
--- Expected
+++ Actual
@@ @@
-Array &0 (
-    'paymentIntent' => Array &1 (
-        'status' => 'requires_action'
