[Killed] CastString
Application/Actions/Donations/Create.php:60:9
         // JWS, this is null.
         $customerId = $request->getAttribute(PersonWithPasswordAuthMiddleware::PSP_ATTRIBUTE_NAME);
 
-        $body = (string) $request->getBody();
+        $body = $request->getBody();
 
         try {
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

..............                                                    14 / 14 (100%)

Time: 00:00.068, Memory: 22.00 MB

OK (14 tests, 205 assertions)

[Killed] Catch_
Application/Actions/Donations/Create.php:65:9
         try {
             /** @var DonationCreate $donationData */
             $donationData = $this->serializer->deserialize($body, DonationCreate::class, 'json');
-        } catch (\TypeError | UnexpectedValueException $exception) { // UnexpectedValueException is the Serializer one,
-            // not the global one
-
-            // Ideally rather than catching type error we would configure the seralizer use
-            // the Symfony\Component\PropertyInfo\Extractor\ReflectionExtractor and then it would throw a
-            // NotNormalizableValueException instead of calling the constructor and having that throw a TypeError.
-            //
-            // But that requires more changes than I want to make right now to either Donation http model used for
-            // updates, as well as the DonationCreate model used here or the tests that sometimes pass strings where
-            // numbers are specified or vice versa.
-
-            $this->logger->info("Donation Create non-serialisable payload was: $body");
-
-            $message = 'Donation Create data deserialise error';
-            $exceptionType = get_class($exception);
-
-            return $this->validationError(
-                $response,
-                "$message: $exceptionType - {$exception->getMessage()}",
-                $message,
-                empty($body), // Suspected bot / junk traffic sometimes sends blank payload.
-            );
-        }
+        } catch (\TypeError $exception) {
 
         try {
killedBy: MatchBot\Tests\Application\Actions\Donations\CreateTest::testDeserialiseError
statusReason: 1) MatchBot\Tests\Application\Actions\Donations\CreateTest::testDeserialiseError
Symfony\Component\Serializer\Exception\NotEncodableValueException: Control character error, possibly incorrectly encoded

/home/barney/projects/matchbot/vendor/symfony/serializer/Encoder/JsonDecode.php:92
/home/barney/projects/matchbot/vendor/symfony/serializer/Encoder/JsonEncoder.php:54
/home/barney/projects/matchbot

[Killed] Catch_
Application/Actions/Donations/Create.php:65:9
         try {
             /** @var DonationCreate $donationData */
             $donationData = $this->serializer->deserialize($body, DonationCreate::class, 'json');
-        } catch (\TypeError | UnexpectedValueException $exception) { // UnexpectedValueException is the Serializer one,
-            // not the global one
-
-            // Ideally rather than catching type error we would configure the seralizer use
-            // the Symfony\Component\PropertyInfo\Extractor\ReflectionExtractor and then it would throw a
-            // NotNormalizableValueException instead of calling the constructor and having that throw a TypeError.
-            //
-            // But that requires more changes than I want to make right now to either Donation http model used for
-            // updates, as well as the DonationCreate model used here or the tests that sometimes pass strings where
-            // numbers are specified or vice versa.
-
-            $this->logger->info("Donation Create non-serialisable payload was: $body");
-
-            $message = 'Donation Create data deserialise error';
-            $exceptionType = get_class($exception);
-
-            return $this->validationError(
-                $response,
-                "$message: $exceptionType - {$exception->getMessage()}",
-                $message,
-                empty($body), // Suspected bot / junk traffic sometimes sends blank payload.
-            );
-        }
+        } catch (UnexpectedValueException $exception) {
 
         try {
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

..............                                                    14 / 14 (100%)

Time: 00:00.069, Memory: 22.00 MB

OK (14 tests, 205 assertions)

[Killed] MethodCallRemoval
Application/Actions/Donations/Create.php:76:13
             // updates, as well as the DonationCreate model used here or the tests that sometimes pass strings where
             // numbers are specified or vice versa.
 
-            $this->logger->info("Donation Create non-serialisable payload was: $body");
+            
 
             $message = 'Donation Create data deserialise error';
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

..............                                                    14 / 14 (100%)

Time: 00:00.067, Memory: 22.00 MB

OK (14 tests, 205 assertions)

[Killed] CatchBlockRemoval
Application/Actions/Donations/Create.php:89:9
             );
         }
 
-        try {
-            $donation = $this->donationRepository->buildFromApiRequest($donationData);
-        } catch (\UnexpectedValueException $exception) {
-            $this->logger->info("Donation Create model load failure payload was: $body");
-
-            $message = 'Donation Create data initial model load';
-            $this->logger->warning($message . ': ' . $exception->getMessage());
-
-            return $this->validationError($response, $message . ': ' . $exception->getMessage(), $exception->getMessage());
-        } catch (UniqueConstraintViolationException $exception) {
-            // If we get this, the most likely explanation is that another donation request
-            // created the same campaign a very short time before this request tried to. We
-            // saw this 3 times in the opening minutes of CC20 on 1 Dec 2020.
-            // If this happens, the latest campaign data should already have been pulled and
-            // persisted in the last second. So give the same call one more try, as
-            // buildFromApiRequest() should perform a fresh call to `CampaignRepository::findOneBy()`.
-            $this->logger->info(sprintf(
-                'Got campaign pull UniqueConstraintViolationException for campaign ID %s. Trying once more.',
-                $donationData->projectId,
-            ));
-            $donation = $this->donationRepository->buildFromApiRequest($donationData);
-        }
+        
 
         if ($customerId !== $donation->getPspCustomerId()) {
killedBy: MatchBot\Tests\Application\Actions\Donations\CreateTest::testCurrencyMismatch
statusReason: 1) MatchBot\Tests\Application\Actions\Donations\CreateTest::testCurrencyMismatch
UnexpectedValueException: Currency CAD is invalid for campaign

/home/barney/projects/matchbot/tests/Application/Actions/Donations/CreateTest.php:208

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] MethodCallRemoval
Application/Actions/Donations/Create.php:92:13
         try {
             $donation = $this->donationRepository->buildFromApiRequest($donationData);
         } catch (\UnexpectedValueException $exception) {
-            $this->logger->info("Donation Create model load failure payload was: $body");
+            
 
             $message = 'Donation Create data initial model load';
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

..............                                                    14 / 14 (100%)

Time: 00:00.080, Memory: 22.00 MB

OK (14 tests, 205 assertions)

[Killed] ConcatOperandRemoval
Application/Actions/Donations/Create.php:95:13
             $this->logger->info("Donation Create model load failure payload was: $body");
 
             $message = 'Donation Create data initial model load';
-            $this->logger->warning($message . ': ' . $exception->getMessage());
+            $this->logger->warning($message . ': ');
 
             return $this->validationError($response, $message . ': ' . $exception->getMessage(), $exception->getMessage());
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

..............                                                    14 / 14 (100%)

Time: 00:00.088, Memory: 22.00 MB

OK (14 tests, 205 assertions)

[Killed] MethodCallRemoval
Application/Actions/Donations/Create.php:95:13
             $this->logger->info("Donation Create model load failure payload was: $body");
 
             $message = 'Donation Create data initial model load';
-            $this->logger->warning($message . ': ' . $exception->getMessage());
+            
 
             return $this->validationError($response, $message . ': ' . $exception->getMessage(), $exception->getMessage());
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

..............                                                    14 / 14 (100%)

Time: 00:00.088, Memory: 22.00 MB

OK (14 tests, 205 assertions)

[Killed] Concat
Application/Actions/Donations/Create.php:97:13
             $message = 'Donation Create data initial model load';
             $this->logger->warning($message . ': ' . $exception->getMessage());
 
-            return $this->validationError($response, $message . ': ' . $exception->getMessage(), $exception->getMessage());
+            return $this->validationError($response, $message . $exception->getMessage() . ': ', $exception->getMessage());
         } catch (UniqueConstraintViolationException $exception) {
             // If we get this, the most likely explanation is that another donation request
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

..............                                                    14 / 14 (100%)

Time: 00:00.088, Memory: 22.00 MB

OK (14 tests, 205 assertions)

[Killed] ConcatOperandRemoval
Application/Actions/Donations/Create.php:97:13
             $message = 'Donation Create data initial model load';
             $this->logger->warning($message . ': ' . $exception->getMessage());
 
-            return $this->validationError($response, $message . ': ' . $exception->getMessage(), $exception->getMessage());
+            return $this->validationError($response, $message . $exception->getMessage(), $exception->getMessage());
         } catch (UniqueConstraintViolationException $exception) {
             // If we get this, the most likely explanation is that another donation request
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

..............                                                    14 / 14 (100%)

Time: 00:00.088, Memory: 22.00 MB

OK (14 tests, 205 assertions)

[Killed] MethodCallRemoval
Application/Actions/Donations/Create.php:105:13
             // If this happens, the latest campaign data should already have been pulled and
             // persisted in the last second. So give the same call one more try, as
             // buildFromApiRequest() should perform a fresh call to `CampaignRepository::findOneBy()`.
-            $this->logger->info(sprintf(
-                'Got campaign pull UniqueConstraintViolationException for campaign ID %s. Trying once more.',
-                $donationData->projectId,
-            ));
+            
             $donation = $this->donationRepository->buildFromApiRequest($donationData);
         }
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

..............                                                    14 / 14 (100%)

Time: 00:00.094, Memory: 22.00 MB

OK (14 tests, 205 assertions)

[Killed] NotIdentical
Application/Actions/Donations/Create.php:112:9
             $donation = $this->donationRepository->buildFromApiRequest($donationData);
         }
 
-        if ($customerId !== $donation->getPspCustomerId()) {
+        if ($customerId === $donation->getPspCustomerId()) {
             return $this->validationError($response, sprintf(
                 'Route customer ID %s did not match %s in donation body',
killedBy: MatchBot\Tests\Application\Actions\Donations\CreateTest::testCampaignClosed
statusReason: 1) MatchBot\Tests\Application\Actions\Donations\CreateTest::testCampaignClosed
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
 '{\n
     "error": {\n
         "type": "BAD_REQUEST",\n

[Killed] LogicalNot
Application/Actions/Donations/Create.php:120:9
             ));
         }
 
-        if (!$donation->getCampaign()->isOpen()) {
+        if ($donation->getCampaign()->isOpen()) {
             return $this->validationError(
                 $response,
killedBy: MatchBot\Tests\Application\Actions\Donations\CreateTest::testCampaignClosed
statusReason: 1) MatchBot\Tests\Application\Actions\Donations\CreateTest::testCampaignClosed
Doctrine\DBAL\Exception\ConnectionException: An exception occurred in the driver: SQLSTATE[HY000] [2002] php_network_getaddresses: getaddrinfo for dummy-mysql-hostname failed: Temporary failure in name resolution

/home/barney/projects/matchbot/vendor/doctrine/dbal/src/Driver/API/MySQL/ExceptionConverter.php:101
/home/b

[Killed] TrueValue
Application/Actions/Donations/Create.php:125:17
                 $response,
                 "Campaign {$donation->getCampaign()->getSalesforceId()} is not open",
                 null,
-                true, // Reduce to info log as some instances expected on campaign close
+                return $this->validationError($response, "Campaign {$donation->getCampaign()->getSalesforceId()} is not open", null, false);
             );
         }
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

..............                                                    14 / 14 (100%)

Time: 00:00.090, Memory: 22.00 MB

OK (14 tests, 205 assertions)

[Killed] MethodCallRemoval
Application/Actions/Donations/Create.php:130:9
         }
 
         // Must persist before Stripe work to have ID available.
-        $this->entityManager->persist($donation);
+        
         $this->entityManager->flush();
 
killedBy: MatchBot\Tests\Application\Actions\Donations\CreateTest::testValidDataForMatchedCampaignWhenFundLockNotAcquired
statusReason: 1) MatchBot\Tests\Application\Actions\Donations\CreateTest::testValidDataForMatchedCampaignWhenFundLockNotAcquired
Some predictions failed:
Double\EntityManagerInterface\P5:
  Expected exactly 1 calls that match:
      Double\EntityManagerInterface\P5->persist(type(MatchBot\Domain\Donation))
    but none were made.

/home/barney/projects/matchbot/vendor/phpspec/prophecy-phpunit/src/ProphecyTrait.p

[Killed] MethodCallRemoval
Application/Actions/Donations/Create.php:131:9
 
         // Must persist before Stripe work to have ID available.
         $this->entityManager->persist($donation);
-        $this->entityManager->flush();
+        
 
         if ($donation->getCampaign()->isMatched()) {
killedBy: MatchBot\Tests\Application\Actions\Donations\CreateTest::testValidDataForMatchedCampaignWhenFundLockNotAcquired
statusReason: 1) MatchBot\Tests\Application\Actions\Donations\CreateTest::testValidDataForMatchedCampaignWhenFundLockNotAcquired
Some predictions failed:
Double\EntityManagerInterface\P5:
  Expected exactly 1 calls that match:
      Double\EntityManagerInterface\P5->flush()
    but none were made.

/home/barney/projects/matchbot/vendor/phpspec/prophecy-phpunit/src/ProphecyTrait.php:61

[Killed] IfNegation
Application/Actions/Donations/Create.php:133:9
         $this->entityManager->persist($donation);
         $this->entityManager->flush();
 
-        if ($donation->getCampaign()->isMatched()) {
-            try {
-                $this->donationRepository->allocateMatchFunds($donation);
-            } catch (DomainLockContentionException $exception) {
-                $error = new ActionError(ActionError::SERVER_ERROR, 'Fund resource locked');
-
-                return $this->respond($response, new ActionPayload(503, null, $error));
-            } catch (\Throwable $t) {
-                $this->matchingAdapter->releaseNewlyAllocatedFunds();
-                // we have to also remove the FundingWithdrawls from MySQL - otherwise the redis amount would be reduced again when the donation expires.
-                $this->donationRepository->removeAllFundingWithdrawalsForDonation($donation);
-
-                throw $t;
-            }
-        }
+        if (!$donation->getCampaign()->isMatched()) {
 
         if ($donation->getPsp() === 'stripe') {
killedBy: MatchBot\Tests\Application\Actions\Donations\CreateTest::testValidDataForMatchedCampaignWhenFundLockNotAcquired
statusReason: 1) MatchBot\Tests\Application\Actions\Donations\CreateTest::testValidDataForMatchedCampaignWhenFundLockNotAcquired
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
 '{\n
     "error": {\n
         "type": "SERVER_ERROR",\n

[Killed] CatchBlockRemoval
Application/Actions/Donations/Create.php:134:13
         $this->entityManager->flush();
 
         if ($donation->getCampaign()->isMatched()) {
-            try {
-                $this->donationRepository->allocateMatchFunds($donation);
-            } catch (DomainLockContentionException $exception) {
-                $error = new ActionError(ActionError::SERVER_ERROR, 'Fund resource locked');
-
-                return $this->respond($response, new ActionPayload(503, null, $error));
-            } catch (\Throwable $t) {
-                $this->matchingAdapter->releaseNewlyAllocatedFunds();
-                // we have to also remove the FundingWithdrawls from MySQL - otherwise the redis amount would be reduced again when the donation expires.
-                $this->donationRepository->removeAllFundingWithdrawalsForDonation($donation);
-
-                throw $t;
-            }
+            
         }
 
killedBy: MatchBot\Tests\Application\Actions\Donations\CreateTest::testValidDataForMatchedCampaignWhenFundLockNotAcquired
statusReason: 1) MatchBot\Tests\Application\Actions\Donations\CreateTest::testValidDataForMatchedCampaignWhenFundLockNotAcquired
MatchBot\Domain\DomainException\DomainLockContentionException: 

/home/barney/projects/matchbot/vendor/phpspec/prophecy/src/Prophecy/Promise/ThrowPromise.php:70
/home/barney/projects/matchbot/vendor/phpspec/prophecy/src/Prophecy/Call/CallCenter.php:103
/home/barney/projects/matchbot/v

[Killed] MethodCallRemoval
Application/Actions/Donations/Create.php:135:17
 
         if ($donation->getCampaign()->isMatched()) {
             try {
-                $this->donationRepository->allocateMatchFunds($donation);
+                
             } catch (DomainLockContentionException $exception) {
                 $error = new ActionError(ActionError::SERVER_ERROR, 'Fund resource locked');
killedBy: MatchBot\Tests\Application\Actions\Donations\CreateTest::testValidDataForMatchedCampaignWhenFundLockNotAcquired
statusReason: 1) MatchBot\Tests\Application\Actions\Donations\CreateTest::testValidDataForMatchedCampaignWhenFundLockNotAcquired
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
 '{\n
     "error": {\n
         "type": "SERVER_ERROR",\n

[Killed] IncrementInteger
Application/Actions/Donations/Create.php:139:17
             } catch (DomainLockContentionException $exception) {
                 $error = new ActionError(ActionError::SERVER_ERROR, 'Fund resource locked');
 
-                return $this->respond($response, new ActionPayload(503, null, $error));
+                return $this->respond($response, new ActionPayload(504, null, $error));
             } catch (\Throwable $t) {
                 $this->matchingAdapter->releaseNewlyAllocatedFunds();
killedBy: MatchBot\Tests\Application\Actions\Donations\CreateTest::testValidDataForMatchedCampaignWhenFundLockNotAcquired
statusReason: 1) MatchBot\Tests\Application\Actions\Donations\CreateTest::testValidDataForMatchedCampaignWhenFundLockNotAcquired
Failed asserting that 504 matches expected 503.

/home/barney/projects/matchbot/tests/Application/Actions/Donations/CreateTest.php:139

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.

[Killed] DecrementInteger
Application/Actions/Donations/Create.php:139:17
             } catch (DomainLockContentionException $exception) {
                 $error = new ActionError(ActionError::SERVER_ERROR, 'Fund resource locked');
 
-                return $this->respond($response, new ActionPayload(503, null, $error));
+                return $this->respond($response, new ActionPayload(502, null, $error));
             } catch (\Throwable $t) {
                 $this->matchingAdapter->releaseNewlyAllocatedFunds();
killedBy: MatchBot\Tests\Application\Actions\Donations\CreateTest::testValidDataForMatchedCampaignWhenFundLockNotAcquired
statusReason: 1) MatchBot\Tests\Application\Actions\Donations\CreateTest::testValidDataForMatchedCampaignWhenFundLockNotAcquired
Failed asserting that 502 matches expected 503.

/home/barney/projects/matchbot/tests/Application/Actions/Donations/CreateTest.php:139

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.

[NoCoverage] MethodCallRemoval
Application/Actions/Donations/Create.php:141:17
 
                 return $this->respond($response, new ActionPayload(503, null, $error));
             } catch (\Throwable $t) {
-                $this->matchingAdapter->releaseNewlyAllocatedFunds();
+                
                 // we have to also remove the FundingWithdrawls from MySQL - otherwise the redis amount would be reduced again when the donation expires.
                 $this->donationRepository->removeAllFundingWithdrawalsForDonation($donation);

[NoCoverage] MethodCallRemoval
Application/Actions/Donations/Create.php:143:17
             } catch (\Throwable $t) {
                 $this->matchingAdapter->releaseNewlyAllocatedFunds();
                 // we have to also remove the FundingWithdrawls from MySQL - otherwise the redis amount would be reduced again when the donation expires.
-                $this->donationRepository->removeAllFundingWithdrawalsForDonation($donation);
+                
 
                 throw $t;

[NoCoverage] Throw_
Application/Actions/Donations/Create.php:145:17
                 // we have to also remove the FundingWithdrawls from MySQL - otherwise the redis amount would be reduced again when the donation expires.
                 $this->donationRepository->removeAllFundingWithdrawalsForDonation($donation);
 
-                throw $t;
+                $t;
             }
         }

[Killed] Identical
Application/Actions/Donations/Create.php:149:9
             }
         }
 
-        if ($donation->getPsp() === 'stripe') {
+        if ($donation->getPsp() !== 'stripe') {
             if (empty($donation->getCampaign()->getCharity()->getStripeAccountId())) {
                 // Try re-pulling in case charity has very recently onboarded with for Stripe.
killedBy: MatchBot\Tests\Application\Actions\Donations\CreateTest::testStripeWithMissingStripeAccountID
statusReason: 1) MatchBot\Tests\Application\Actions\Donations\CreateTest::testStripeWithMissingStripeAccountID
Failed asserting that 201 matches expected 500.

/home/barney/projects/matchbot/tests/Application/Actions/Donations/CreateTest.php:190

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.

[Killed] MethodCallRemoval
Application/Actions/Donations/Create.php:157:21
 
                 // If still empty, error out
                 if (empty($campaign->getCharity()->getStripeAccountId())) {
-                    $this->logger->error(sprintf(
-                        'Stripe Payment Intent create error: Stripe Account ID not set for Account %s',
-                        $donation->getCampaign()->getCharity()->getSalesforceId(),
-                    ));
+                    
                     $error = new ActionError(ActionError::SERVER_ERROR, 'Could not make Stripe Payment Intent (A)');
                     return $this->respond($response, new ActionPayload(500, null, $error));
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

..............                                                    14 / 14 (100%)

Time: 00:00.086, Memory: 22.00 MB

OK (14 tests, 205 assertions)

[Killed] DecrementInteger
Application/Actions/Donations/Create.php:162:21
                         $donation->getCampaign()->getCharity()->getSalesforceId(),
                     ));
                     $error = new ActionError(ActionError::SERVER_ERROR, 'Could not make Stripe Payment Intent (A)');
-                    return $this->respond($response, new ActionPayload(500, null, $error));
+                    return $this->respond($response, new ActionPayload(499, null, $error));
                 }
 
killedBy: MatchBot\Tests\Application\Actions\Donations\CreateTest::testStripeWithMissingStripeAccountID
statusReason: 1) MatchBot\Tests\Application\Actions\Donations\CreateTest::testStripeWithMissingStripeAccountID
Failed asserting that 499 matches expected 500.

/home/barney/projects/matchbot/tests/Application/Actions/Donations/CreateTest.php:190

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.

[Killed] IncrementInteger
Application/Actions/Donations/Create.php:162:21
                         $donation->getCampaign()->getCharity()->getSalesforceId(),
                     ));
                     $error = new ActionError(ActionError::SERVER_ERROR, 'Could not make Stripe Payment Intent (A)');
-                    return $this->respond($response, new ActionPayload(500, null, $error));
+                    return $this->respond($response, new ActionPayload(501, null, $error));
                 }
 
killedBy: MatchBot\Tests\Application\Actions\Donations\CreateTest::testStripeWithMissingStripeAccountID
statusReason: 1) MatchBot\Tests\Application\Actions\Donations\CreateTest::testStripeWithMissingStripeAccountID
Failed asserting that 501 matches expected 500.

/home/barney/projects/matchbot/tests/Application/Actions/Donations/CreateTest.php:190

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.

[Killed] MethodCallRemoval
Application/Actions/Donations/Create.php:166:17
                 }
 
                 // Else we found new Stripe info and can proceed
-                $donation->setCampaign($campaign);
+                
             }
 
killedBy: MatchBot\Tests\Application\Actions\Donations\CreateTest::testSuccessWithStripeAccountIDMissingInitiallyButFoundOnRefetch
statusReason: 1) MatchBot\Tests\Application\Actions\Donations\CreateTest::testSuccessWithStripeAccountIDMissingInitiallyButFoundOnRefetch
Attempt to read property "id" on null

/home/barney/projects/matchbot/src/Application/Actions/Donations/Create.php:172
/home/barney/projects/matchbot/src/Application/Actions/Action.php:34
/home/barney/projects/matchbot/vendor/slim/slim/Slim/Handlers/Strategies/RequestResponse

[Killed] SpreadRemoval
Application/Actions/Donations/Create.php:170:17
             }
 
             $createPayload = [
-                ...$donation->getStripeMethodProperties(),
+                $donation->getStripeMethodProperties(),
                 ...$donation->getStripeOnBehalfOfProperties(),
                 // Stripe Payment Intent `amount` is in the smallest currency unit, e.g. pence.
killedBy: MatchBot\Tests\Application\Actions\Donations\CreateTest::testSuccessWithStripeAccountIDMissingInitiallyButFoundOnRefetch
statusReason: 1) MatchBot\Tests\Application\Actions\Donations\CreateTest::testSuccessWithStripeAccountIDMissingInitiallyButFoundOnRefetch
Attempt to read property "id" on null

/home/barney/projects/matchbot/src/Application/Actions/Donations/Create.php:173
/home/barney/projects/matchbot/src/Application/Actions/Action.php:34
/home/barney/projects/matchbot/vendor/slim/slim/Slim/Handlers/Strategies/RequestResponse

[Killed] SpreadOneItem
Application/Actions/Donations/Create.php:170:17
             }
 
             $createPayload = [
-                ...$donation->getStripeMethodProperties(),
+                [...$donation->getStripeMethodProperties()][0],
                 ...$donation->getStripeOnBehalfOfProperties(),
                 // Stripe Payment Intent `amount` is in the smallest currency unit, e.g. pence.
killedBy: MatchBot\Tests\Application\Actions\Donations\CreateTest::testSuccessWithStripeAccountIDMissingInitiallyButFoundOnRefetch
statusReason: 1) MatchBot\Tests\Application\Actions\Donations\CreateTest::testSuccessWithStripeAccountIDMissingInitiallyButFoundOnRefetch
Undefined array key 0

/home/barney/projects/matchbot/src/Application/Actions/Donations/Create.php:121
/home/barney/projects/matchbot/src/Application/Actions/Action.php:34
/home/barney/projects/matchbot/vendor/slim/slim/Slim/Handlers/Strategies/RequestResponse.php:38
/home/ba

[Killed] SpreadRemoval
Application/Actions/Donations/Create.php:171:17
 
             $createPayload = [
                 ...$donation->getStripeMethodProperties(),
-                ...$donation->getStripeOnBehalfOfProperties(),
+                $donation->getStripeOnBehalfOfProperties(),
                 // Stripe Payment Intent `amount` is in the smallest currency unit, e.g. pence.
                 // See https://stripe.com/docs/api/payment_intents/object
killedBy: MatchBot\Tests\Application\Actions\Donations\CreateTest::testSuccessWithStripeAccountIDMissingInitiallyButFoundOnRefetch
statusReason: 1) MatchBot\Tests\Application\Actions\Donations\CreateTest::testSuccessWithStripeAccountIDMissingInitiallyButFoundOnRefetch
Attempt to read property "id" on null

/home/barney/projects/matchbot/src/Application/Actions/Donations/Create.php:173
/home/barney/projects/matchbot/src/Application/Actions/Action.php:34
/home/barney/projects/matchbot/vendor/slim/slim/Slim/Handlers/Strategies/RequestResponse
