22) /home/barney/projects/matchbot/src/Application/Auth/ErrorTrait.php:18    [M] IfNegation

--- Original
+++ New
@@ @@
 {
     protected function unauthorised(LoggerInterface $logger, bool $likelyBot, ServerRequestInterface $request) : void
     {
-        if ($likelyBot) {
+        if (!$likelyBot) {
             // We've seen traffic with no JWTs from crawlers etc. before so don't
             // want to log this as a warning.
             $logger->info('Unauthorised – following bot-like patterns');

23) /home/barney/projects/matchbot/src/Application/Auth/ErrorTrait.php:21    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     protected function unauthorised(LoggerInterface $logger, bool $likelyBot, ServerRequestInterface $request) : void
     {
         if ($likelyBot) {
-            // We've seen traffic with no JWTs from crawlers etc. before so don't
-            // want to log this as a warning.
-            $logger->info('Unauthorised – following bot-like patterns');
+            
         } else {
             $logger->warning('Unauthorised');
         }

162) /home/barney/projects/matchbot/src/Application/Auth/DonationRecaptchaMiddleware.php:81    [M] DecrementInteger

--- Original
+++ New
@@ @@
             if (!$isConnectionError) {
                 $this->unauthorised($this->logger, true, $request);
             }
-            if ($counter >= $timesToAttemptCaptchaVerification - 1) {
+            if ($counter >= $timesToAttemptCaptchaVerification - 0) {
                 $this->logger->warning('Warning: captcha verification has now failed after ' . $timesToAttemptCaptchaVerification . ' attempts!');
                 $this->unauthorised($this->logger, true, $request);
             }

163) /home/barney/projects/matchbot/src/Application/Auth/DonationRecaptchaMiddleware.php:81    [M] IncrementInteger

--- Original
+++ New
@@ @@
             if (!$isConnectionError) {
                 $this->unauthorised($this->logger, true, $request);
             }
-            if ($counter >= $timesToAttemptCaptchaVerification - 1) {
+            if ($counter >= $timesToAttemptCaptchaVerification - 2) {
                 $this->logger->warning('Warning: captcha verification has now failed after ' . $timesToAttemptCaptchaVerification . ' attempts!');
                 $this->unauthorised($this->logger, true, $request);
             }

164) /home/barney/projects/matchbot/src/Application/Auth/DonationRecaptchaMiddleware.php:81    [M] Minus

--- Original
+++ New
@@ @@
             if (!$isConnectionError) {
                 $this->unauthorised($this->logger, true, $request);
             }
-            if ($counter >= $timesToAttemptCaptchaVerification - 1) {
+            if ($counter >= $timesToAttemptCaptchaVerification + 1) {
                 $this->logger->warning('Warning: captcha verification has now failed after ' . $timesToAttemptCaptchaVerification . ' attempts!');
                 $this->unauthorised($this->logger, true, $request);
             }

165) /home/barney/projects/matchbot/src/Application/Auth/DonationRecaptchaMiddleware.php:81    [M] GreaterThanOrEqualTo

--- Original
+++ New
@@ @@
             if (!$isConnectionError) {
                 $this->unauthorised($this->logger, true, $request);
             }
-            if ($counter >= $timesToAttemptCaptchaVerification - 1) {
+            if ($counter > $timesToAttemptCaptchaVerification - 1) {
                 $this->logger->warning('Warning: captcha verification has now failed after ' . $timesToAttemptCaptchaVerification . ' attempts!');
                 $this->unauthorised($this->logger, true, $request);
             }

166) /home/barney/projects/matchbot/src/Application/Auth/DonationRecaptchaMiddleware.php:81    [M] GreaterThanOrEqualToNegotiation

--- Original
+++ New
@@ @@
             if (!$isConnectionError) {
                 $this->unauthorised($this->logger, true, $request);
             }
-            if ($counter >= $timesToAttemptCaptchaVerification - 1) {
+            if ($counter < $timesToAttemptCaptchaVerification - 1) {
                 $this->logger->warning('Warning: captcha verification has now failed after ' . $timesToAttemptCaptchaVerification . ' attempts!');
                 $this->unauthorised($this->logger, true, $request);
             }

167) /home/barney/projects/matchbot/src/Application/Auth/DonationRecaptchaMiddleware.php:82    [M] Concat

--- Original
+++ New
@@ @@
                 $this->unauthorised($this->logger, true, $request);
             }
             if ($counter >= $timesToAttemptCaptchaVerification - 1) {
-                $this->logger->warning('Warning: captcha verification has now failed after ' . $timesToAttemptCaptchaVerification . ' attempts!');
+                $this->logger->warning($timesToAttemptCaptchaVerification . 'Warning: captcha verification has now failed after ' . ' attempts!');
                 $this->unauthorised($this->logger, true, $request);
             }
         }

168) /home/barney/projects/matchbot/src/Application/Auth/DonationRecaptchaMiddleware.php:82    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
                 $this->unauthorised($this->logger, true, $request);
             }
             if ($counter >= $timesToAttemptCaptchaVerification - 1) {
-                $this->logger->warning('Warning: captcha verification has now failed after ' . $timesToAttemptCaptchaVerification . ' attempts!');
+                $this->logger->warning($timesToAttemptCaptchaVerification . ' attempts!');
                 $this->unauthorised($this->logger, true, $request);
             }
         }

169) /home/barney/projects/matchbot/src/Application/Auth/DonationRecaptchaMiddleware.php:82    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
                 $this->unauthorised($this->logger, true, $request);
             }
             if ($counter >= $timesToAttemptCaptchaVerification - 1) {
-                $this->logger->warning('Warning: captcha verification has now failed after ' . $timesToAttemptCaptchaVerification . ' attempts!');
+                $this->logger->warning('Warning: captcha verification has now failed after ' . ' attempts!');
                 $this->unauthorised($this->logger, true, $request);
             }
         }

170) /home/barney/projects/matchbot/src/Application/Auth/DonationRecaptchaMiddleware.php:82    [M] Concat

--- Original
+++ New
@@ @@
                 $this->unauthorised($this->logger, true, $request);
             }
             if ($counter >= $timesToAttemptCaptchaVerification - 1) {
-                $this->logger->warning('Warning: captcha verification has now failed after ' . $timesToAttemptCaptchaVerification . ' attempts!');
+                $this->logger->warning('Warning: captcha verification has now failed after ' . ' attempts!' . $timesToAttemptCaptchaVerification);
                 $this->unauthorised($this->logger, true, $request);
             }
         }

171) /home/barney/projects/matchbot/src/Application/Auth/DonationRecaptchaMiddleware.php:82    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
                 $this->unauthorised($this->logger, true, $request);
             }
             if ($counter >= $timesToAttemptCaptchaVerification - 1) {
-                $this->logger->warning('Warning: captcha verification has now failed after ' . $timesToAttemptCaptchaVerification . ' attempts!');
+                $this->logger->warning('Warning: captcha verification has now failed after ' . $timesToAttemptCaptchaVerification);
                 $this->unauthorised($this->logger, true, $request);
             }
         }

172) /home/barney/projects/matchbot/src/Application/Auth/DonationRecaptchaMiddleware.php:82    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
                 $this->unauthorised($this->logger, true, $request);
             }
             if ($counter >= $timesToAttemptCaptchaVerification - 1) {
-                $this->logger->warning('Warning: captcha verification has now failed after ' . $timesToAttemptCaptchaVerification . ' attempts!');
+                
                 $this->unauthorised($this->logger, true, $request);
             }
         }

173) /home/barney/projects/matchbot/src/Application/Auth/DonationRecaptchaMiddleware.php:84    [M] TrueValue

--- Original
+++ New
@@ @@
             }
             if ($counter >= $timesToAttemptCaptchaVerification - 1) {
                 $this->logger->warning('Warning: captcha verification has now failed after ' . $timesToAttemptCaptchaVerification . ' attempts!');
-                $this->unauthorised($this->logger, true, $request);
+                $this->unauthorised($this->logger, false, $request);
             }
         }
         return $handler->handle($request);
     }
 }

174) /home/barney/projects/matchbot/src/Application/Auth/DonationRecaptchaMiddleware.php:84    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             }
             if ($counter >= $timesToAttemptCaptchaVerification - 1) {
                 $this->logger->warning('Warning: captcha verification has now failed after ' . $timesToAttemptCaptchaVerification . ' attempts!');
-                $this->unauthorised($this->logger, true, $request);
+                
             }
         }
         return $handler->handle($request);
     }
 }

176) /home/barney/projects/matchbot/src/Application/Auth/DonationToken.php:68    [M] FalseValue

--- Original
+++ New
@@ @@
         }
         if ($decodedJwtBody->iss !== getenv('BASE_URI')) {
             $logger->error("JWT error: issued by wrong site {$decodedJwtBody->iss}");
-            return false;
+            return true;
         }
         if ($donationId !== $decodedJwtBody->sub->donationId) {
             // We've seen this rarely from things like sharing thank you URLs across browsers / devices.
