[NoCoverage] Throw_
Application/Actions/Donations/Get.php:33:13
     protected function action(Request $request, Response $response, array $args): Response
     {
         if (empty($args['donationId'])) { // When MatchBot made a donation, this is now a UUID
-            throw new DomainRecordNotFoundException('Missing donation ID');
+            new DomainRecordNotFoundException('Missing donation ID');
         }
 

[Killed] ArrayItemRemoval
Application/Actions/Donations/Get.php:37:9
         }
 
         /** @var Donation $donation */
-        $donation = $this->donationRepository->findOneBy(['uuid' => $args['donationId']]);
+        $donation = $this->donationRepository->findOneBy([]);
 
         if (!$donation) {
killedBy: MatchBot\Tests\Application\Actions\Donations\GetTest::testIdNotFound
statusReason: 1) MatchBot\Tests\Application\Actions\Donations\GetTest::testIdNotFound
Prophecy\Exception\Call\UnexpectedCallException: Unexpected method call on Double\MatchBot\Domain\DonationRepository\P3:
  - findOneBy(
        []
    )
expected calls were:
  - findOneBy(
        exact(["uuid" => "87654321-1234-1234-1234-ba0987654321"])

[Killed] LogicalNot
Application/Actions/Donations/Get.php:39:9
         /** @var Donation $donation */
         $donation = $this->donationRepository->findOneBy(['uuid' => $args['donationId']]);
 
-        if (!$donation) {
+        if ($donation) {
             throw new DomainRecordNotFoundException('Donation not found');
         }
killedBy: MatchBot\Tests\Application\Actions\Donations\GetTest::testIdNotFound
statusReason: 1) MatchBot\Tests\Application\Actions\Donations\GetTest::testIdNotFound
Failed asserting that exception of type "Error" matches expected exception "Slim\Exception\HttpNotFoundException". Message was: "Call to a member function toApiModel() on null" at
/home/barney/projects/matchbot/src/Application/Actions/Donations/Get.php:36
/home/barney/projects/matchbot/src/Application/Actions/Action.php:34
/ho

[Killed] Throw_
Application/Actions/Donations/Get.php:40:13
         $donation = $this->donationRepository->findOneBy(['uuid' => $args['donationId']]);
 
         if (!$donation) {
-            throw new DomainRecordNotFoundException('Donation not found');
+            new DomainRecordNotFoundException('Donation not found');
         }
 
killedBy: MatchBot\Tests\Application\Actions\Donations\GetTest::testIdNotFound
statusReason: 1) MatchBot\Tests\Application\Actions\Donations\GetTest::testIdNotFound
Failed asserting that exception of type "Error" matches expected exception "Slim\Exception\HttpNotFoundException". Message was: "Call to a member function toApiModel() on null" at
/home/barney/projects/matchbot/src/Application/Actions/Donations/Get.php:36
/home/barney/projects/matchbot/src/Application/Actions/Action.php:34
/ho
