[Killed] LogicalOrNegation
Application/Actions/Donations/Update.php:61:9
      */
     protected function action(Request $request, Response $response, array $args): Response
     {
-        if (empty($args['donationId']) || ! is_string($args['donationId'])) {
+        if (!(empty($args['donationId']) || !is_string($args['donationId']))) {
             // When MatchBot made a donation, this is now a UUID
             throw new DomainRecordNotFoundException('Missing donation ID');
killedBy: MatchBot\Tests\Application\Actions\Donations\UpdateHandlesLockExceptionTest::testRetriesOnUpdateStillPendingLockException
statusReason: 1) MatchBot\Tests\Application\Actions\Donations\UpdateHandlesLockExceptionTest::testRetriesOnUpdateStillPendingLockException
Slim\Exception\HttpNotFoundException: Missing donation ID

/home/barney/projects/matchbot/src/Application/Actions/Action.php:36
/home/barney/projects/matchbot/tests/Application/Actions/Donations/UpdateHandlesLockExceptionTest.php:76

ERRORS!
Tests: 1, Assertions: 0, Errors:

[Killed] LogicalOr
Application/Actions/Donations/Update.php:61:9
      */
     protected function action(Request $request, Response $response, array $args): Response
     {
-        if (empty($args['donationId']) || ! is_string($args['donationId'])) {
+        if (empty($args['donationId']) && !is_string($args['donationId'])) {
             // When MatchBot made a donation, this is now a UUID
             throw new DomainRecordNotFoundException('Missing donation ID');
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

................................                                  32 / 32 (100%)

Time: 00:03.326, Memory: 26.00 MB

OK (32 tests, 320 assertions)

[NoCoverage] Throw_
Application/Actions/Donations/Update.php:63:13
     {
         if (empty($args['donationId']) || ! is_string($args['donationId'])) {
             // When MatchBot made a donation, this is now a UUID
-            throw new DomainRecordNotFoundException('Missing donation ID');
+            new DomainRecordNotFoundException('Missing donation ID');
         }
 

[Killed] Catch_
Application/Actions/Donations/Update.php:75:9
                 HttpModels\Donation::class,
                 'json'
             );
-        } catch (UnexpectedValueException | TypeError $exception) {
-            // UnexpectedValueException is the Serializer one, not the global one
-            $this->logger->info("Donation Update non-serialisable payload was: $body");
-
-            $message = 'Donation Update data deserialise error';
-            $exceptionType = get_class($exception);
-
-            return $this->validationError(
-                $response,
-                "$message: $exceptionType - {$exception->getMessage()}",
-                $message,
-                empty($body), // Suspected bot / junk traffic sometimes sends blank payload.
-            );
-        }
+        } catch (UnexpectedValueException $exception) {
 
         if (getenv('APP_ENV') !== 'production' && str_starts_with($donationData->firstName ?? '', 'Please throw')) {
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

..............................                                    30 / 30 (100%)

Time: 00:03.100, Memory: 24.00 MB

OK (30 tests, 305 assertions)

[Killed] Catch_
Application/Actions/Donations/Update.php:75:9
                 HttpModels\Donation::class,
                 'json'
             );
-        } catch (UnexpectedValueException | TypeError $exception) {
-            // UnexpectedValueException is the Serializer one, not the global one
-            $this->logger->info("Donation Update non-serialisable payload was: $body");
-
-            $message = 'Donation Update data deserialise error';
-            $exceptionType = get_class($exception);
-
-            return $this->validationError(
-                $response,
-                "$message: $exceptionType - {$exception->getMessage()}",
-                $message,
-                empty($body), // Suspected bot / junk traffic sometimes sends blank payload.
-            );
-        }
+        } catch (TypeError $exception) {
 
         if (getenv('APP_ENV') !== 'production' && str_starts_with($donationData->firstName ?? '', 'Please throw')) {
killedBy: MatchBot\Tests\Application\Actions\Donations\UpdateTest::testAddDataAttemptWithInvalidPropertyType
statusReason: 1) MatchBot\Tests\Application\Actions\Donations\UpdateTest::testAddDataAttemptWithInvalidPropertyType
Symfony\Component\Serializer\Exception\NotNormalizableValueException: Failed to denormalize attribute "homeAddress" value for class "MatchBot\Application\HttpModels\Donation": Expected argument of type "?string", "array" given at property path "homeAddress".

/home/barney/projects/matchbot/vendor/

[Killed] MethodCallRemoval
Application/Actions/Donations/Update.php:77:13
             );
         } catch (UnexpectedValueException | TypeError $exception) {
             // UnexpectedValueException is the Serializer one, not the global one
-            $this->logger->info("Donation Update non-serialisable payload was: $body");
+            
 
             $message = 'Donation Update data deserialise error';
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

..............................                                    30 / 30 (100%)

Time: 00:03.098, Memory: 24.00 MB

OK (30 tests, 305 assertions)

[Killed] LogicalAndAllSubExprNegation
Application/Actions/Donations/Update.php:90:9
             );
         }
 
-        if (getenv('APP_ENV') !== 'production' && str_starts_with($donationData->firstName ?? '', 'Please throw')) {
+        if (!(getenv('APP_ENV') !== 'production') && !str_starts_with($donationData->firstName ?? '', 'Please throw')) {
             $this->logger->critical("Testing a critical log message for BG2-2297");
             throw new \Exception("$donationData->firstName requested an exception for test purposes");
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

................................                                  32 / 32 (100%)

Time: 00:03.315, Memory: 26.00 MB

OK (32 tests, 320 assertions)

[Killed] LogicalAnd
Application/Actions/Donations/Update.php:90:9
             );
         }
 
-        if (getenv('APP_ENV') !== 'production' && str_starts_with($donationData->firstName ?? '', 'Please throw')) {
+        if (getenv('APP_ENV') !== 'production' || str_starts_with($donationData->firstName ?? '', 'Please throw')) {
             $this->logger->critical("Testing a critical log message for BG2-2297");
             throw new \Exception("$donationData->firstName requested an exception for test purposes");
killedBy: MatchBot\Tests\Application\Actions\Donations\UpdateHandlesLockExceptionTest::testRetriesOnUpdateStillPendingLockException
statusReason: 1) MatchBot\Tests\Application\Actions\Donations\UpdateHandlesLockExceptionTest::testRetriesOnUpdateStillPendingLockException
Exception:  requested an exception for test purposes

/home/barney/projects/matchbot/src/Application/Actions/Donations/Update.php:69
/home/barney/projects/matchbot/src/Application/Actions/Action.php:34
/home/barney/projects/matchbot/tests/Application/Actions/Donations/Update

[NoCoverage] MethodCallRemoval
Application/Actions/Donations/Update.php:91:13
         }
 
         if (getenv('APP_ENV') !== 'production' && str_starts_with($donationData->firstName ?? '', 'Please throw')) {
-            $this->logger->critical("Testing a critical log message for BG2-2297");
+            
             throw new \Exception("$donationData->firstName requested an exception for test purposes");
         }

[NoCoverage] Throw_
Application/Actions/Donations/Update.php:92:13
 
         if (getenv('APP_ENV') !== 'production' && str_starts_with($donationData->firstName ?? '', 'Please throw')) {
             $this->logger->critical("Testing a critical log message for BG2-2297");
-            throw new \Exception("$donationData->firstName requested an exception for test purposes");
+            new \Exception("{$donationData->firstName} requested an exception for test purposes");
         }
 

[Killed] LogicalNot
Application/Actions/Donations/Update.php:95:9
             throw new \Exception("$donationData->firstName requested an exception for test purposes");
         }
 
-        if (!isset($donationData->status)) {
+        if (isset($donationData->status)) {
             return $this->validationError(
                 $response,
killedBy: MatchBot\Tests\Application\Actions\Donations\UpdateHandlesLockExceptionTest::testRetriesOnUpdateStillPendingLockException
statusReason: 1) MatchBot\Tests\Application\Actions\Donations\UpdateHandlesLockExceptionTest::testRetriesOnUpdateStillPendingLockException
Failed asserting that 400 is identical to 200.

/home/barney/projects/matchbot/tests/Application/Actions/Donations/UpdateHandlesLockExceptionTest.php:79

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] DecrementInteger
Application/Actions/Donations/Update.php:105:9
 
         // Lock wait errors on the select OR update mean we should try the transaction again
         // after a short pause, up to self::MAX_UPDATE_RETRY_COUNT times.
-        $retryCount = 0;
+        $retryCount = -1;
         while ($retryCount < self::MAX_UPDATE_RETRY_COUNT) {
             $this->entityManager->beginTransaction();
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

................................                                  32 / 32 (100%)

Time: 00:03.210, Memory: 26.00 MB

OK (32 tests, 320 assertions)

[Killed] LessThan
Application/Actions/Donations/Update.php:106:9
         // Lock wait errors on the select OR update mean we should try the transaction again
         // after a short pause, up to self::MAX_UPDATE_RETRY_COUNT times.
         $retryCount = 0;
-        while ($retryCount < self::MAX_UPDATE_RETRY_COUNT) {
+        while ($retryCount <= self::MAX_UPDATE_RETRY_COUNT) {
             $this->entityManager->beginTransaction();
 
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

................................                                  32 / 32 (100%)

Time: 00:03.306, Memory: 26.00 MB

OK (32 tests, 320 assertions)

[Killed] LessThanNegotiation
Application/Actions/Donations/Update.php:106:9
         // Lock wait errors on the select OR update mean we should try the transaction again
         // after a short pause, up to self::MAX_UPDATE_RETRY_COUNT times.
         $retryCount = 0;
-        while ($retryCount < self::MAX_UPDATE_RETRY_COUNT) {
+        while ($retryCount >= self::MAX_UPDATE_RETRY_COUNT) {
             $this->entityManager->beginTransaction();
 
killedBy: MatchBot\Tests\Application\Actions\Donations\UpdateHandlesLockExceptionTest::testRetriesOnUpdateStillPendingLockException
statusReason: 1) MatchBot\Tests\Application\Actions\Donations\UpdateHandlesLockExceptionTest::testRetriesOnUpdateStillPendingLockException
Exception: Retry count exceeded trying to update donation donation_id , retried 0 times

/home/barney/projects/matchbot/src/Application/Actions/Donations/Update.php:118
/home/barney/projects/matchbot/src/Application/Actions/Action.php:34
/home/barney/projects/matchbot/tests/

[Killed] MethodCallRemoval
Application/Actions/Donations/Update.php:107:13
         // after a short pause, up to self::MAX_UPDATE_RETRY_COUNT times.
         $retryCount = 0;
         while ($retryCount < self::MAX_UPDATE_RETRY_COUNT) {
-            $this->entityManager->beginTransaction();
+            
 
             try {
killedBy: MatchBot\Tests\Application\Actions\Donations\UpdateHandlesLockExceptionTest::testRetriesOnUpdateStillPendingLockException
statusReason: 1) MatchBot\Tests\Application\Actions\Donations\UpdateHandlesLockExceptionTest::testRetriesOnUpdateStillPendingLockException
Some predictions failed:
Double\EntityManagerInterface\P4:
  Expected exactly 2 calls that match:
      Double\EntityManagerInterface\P4->beginTransaction()
    but none were made.

/home/barney/projects/matchbot/vendor/phpspec/prophecy-phpunit/src/ProphecyTrait.php:61

[Killed] ArrayItemRemoval
Application/Actions/Donations/Update.php:110:17
             $this->entityManager->beginTransaction();
 
             try {
-                $donation = $this->donationRepository->findAndLockOneBy(['uuid' => $args['donationId']]);
+                $donation = $this->donationRepository->findAndLockOneBy([]);
 
                 if (!$donation) {
killedBy: MatchBot\Tests\Application\Actions\Donations\UpdateHandlesLockExceptionTest::testRetriesOnUpdateStillPendingLockException
statusReason: 1) MatchBot\Tests\Application\Actions\Donations\UpdateHandlesLockExceptionTest::testRetriesOnUpdateStillPendingLockException
Slim\Exception\HttpNotFoundException: Donation not found

/home/barney/projects/matchbot/src/Application/Actions/Action.php:36
/home/barney/projects/matchbot/tests/Application/Actions/Donations/UpdateHandlesLockExceptionTest.php:76

ERRORS!
Tests: 1, Assertions: 0, Errors: 1

[Killed] MethodCallRemoval
Application/Actions/Donations/Update.php:113:21
                 $donation = $this->donationRepository->findAndLockOneBy(['uuid' => $args['donationId']]);
 
                 if (!$donation) {
-                    $this->entityManager->rollback();
+                    
 
                     throw new DomainRecordNotFoundException('Donation not found');
killedBy: MatchBot\Tests\Application\Actions\Donations\UpdateTest::testIdNotFound
statusReason: 1) MatchBot\Tests\Application\Actions\Donations\UpdateTest::testIdNotFound
Some predictions failed:
Double\EntityManagerInterface\P4:
  Expected exactly 1 calls that match:
      Double\EntityManagerInterface\P4->rollback()
    but none were made.

/home/barney/projects/matchbot/vendor/phpspec/prophecy-phpunit/src/ProphecyTrait.php:61

[Killed] Throw_
Application/Actions/Donations/Update.php:115:21
                 if (!$donation) {
                     $this->entityManager->rollback();
 
-                    throw new DomainRecordNotFoundException('Donation not found');
+                    new DomainRecordNotFoundException('Donation not found');
                 }
 
killedBy: MatchBot\Tests\Application\Actions\Donations\UpdateTest::testIdNotFound
statusReason: 1) MatchBot\Tests\Application\Actions\Donations\UpdateTest::testIdNotFound
Failed asserting that exception of type "Error" matches expected exception "Slim\Exception\HttpNotFoundException". Message was: "Call to a member function getDonationStatus() on null" at
/home/barney/projects/matchbot/src/Application/Actions/Donations/Update.php:85
/home/barney/projects/matchbot/src/Application/Actions/Acti

[Killed] LogicalAnd
Application/Actions/Donations/Update.php:118:17
                     throw new DomainRecordNotFoundException('Donation not found');
                 }
 
-                if ($donationData->status !== DonationStatus::Cancelled->value && $donationData->status !== $donation->getDonationStatus()->value) {
+                if ($donationData->status !== DonationStatus::Cancelled->value || $donationData->status !== $donation->getDonationStatus()->value) {
                     $this->entityManager->rollback();
 
killedBy: MatchBot\Tests\Application\Actions\Donations\UpdateHandlesLockExceptionTest::testRetriesOnUpdateStillPendingLockException
statusReason: 1) MatchBot\Tests\Application\Actions\Donations\UpdateHandlesLockExceptionTest::testRetriesOnUpdateStillPendingLockException
Failed asserting that 400 is identical to 200.

/home/barney/projects/matchbot/tests/Application/Actions/Donations/UpdateHandlesLockExceptionTest.php:79

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] NotIdentical
Application/Actions/Donations/Update.php:118:17
                     throw new DomainRecordNotFoundException('Donation not found');
                 }
 
-                if ($donationData->status !== DonationStatus::Cancelled->value && $donationData->status !== $donation->getDonationStatus()->value) {
+                if ($donationData->status === DonationStatus::Cancelled->value && $donationData->status !== $donation->getDonationStatus()->value) {
                     $this->entityManager->rollback();
 
killedBy: MatchBot\Tests\Application\Actions\Donations\UpdateHandlesLockExceptionTest::testRetriesOnUpdateToCancelledLockException
statusReason: 1) MatchBot\Tests\Application\Actions\Donations\UpdateHandlesLockExceptionTest::testRetriesOnUpdateToCancelledLockException
Failed asserting that 400 is identical to 200.

/home/barney/projects/matchbot/tests/Application/Actions/Donations/UpdateHandlesLockExceptionTest.php:108

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] MethodCallRemoval
Application/Actions/Donations/Update.php:119:21
                 }
 
                 if ($donationData->status !== DonationStatus::Cancelled->value && $donationData->status !== $donation->getDonationStatus()->value) {
-                    $this->entityManager->rollback();
+                    
 
                     return $this->validationError(
killedBy: MatchBot\Tests\Application\Actions\Donations\UpdateTest::testInvalidStatusChange
statusReason: 1) MatchBot\Tests\Application\Actions\Donations\UpdateTest::testInvalidStatusChange
Some predictions failed:
Double\EntityManagerInterface\P4:
  Expected exactly 1 calls that match:
      Double\EntityManagerInterface\P4->rollback()
    but none were made.

/home/barney/projects/matchbot/vendor/phpspec/prophecy-phpunit/src/ProphecyTrait.php:61

[Killed] NotIdentical
Application/Actions/Donations/Update.php:128:17
                     );
                 }
 
-                if ($donationData->autoConfirmFromCashBalance && $donation->getPaymentMethodType() !== \MatchBot\Domain\PaymentMethodType::CustomerBalance) {
+                if ($donationData->autoConfirmFromCashBalance && $donation->getPaymentMethodType() === \MatchBot\Domain\PaymentMethodType::CustomerBalance) {
                     $this->entityManager->rollback();
 
killedBy: MatchBot\Tests\Application\Actions\Donations\UpdateTest::testAddDataSuccessWithCashBalanceAutoconfirm
statusReason: 1) MatchBot\Tests\Application\Actions\Donations\UpdateTest::testAddDataSuccessWithCashBalanceAutoconfirm
Failed asserting that 400 matches expected 200.

/home/barney/projects/matchbot/tests/Application/Actions/Donations/UpdateTest.php:1651

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.

[Killed] LogicalAnd
Application/Actions/Donations/Update.php:128:17
                     );
                 }
 
-                if ($donationData->autoConfirmFromCashBalance && $donation->getPaymentMethodType() !== \MatchBot\Domain\PaymentMethodType::CustomerBalance) {
+                if ($donationData->autoConfirmFromCashBalance || $donation->getPaymentMethodType() !== \MatchBot\Domain\PaymentMethodType::CustomerBalance) {
                     $this->entityManager->rollback();
 
killedBy: MatchBot\Tests\Application\Actions\Donations\UpdateHandlesLockExceptionTest::testRetriesOnUpdateStillPendingLockException
statusReason: 1) MatchBot\Tests\Application\Actions\Donations\UpdateHandlesLockExceptionTest::testRetriesOnUpdateStillPendingLockException
Failed asserting that 400 is identical to 200.

/home/barney/projects/matchbot/tests/Application/Actions/Donations/UpdateHandlesLockExceptionTest.php:79

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] MethodCallRemoval
Application/Actions/Donations/Update.php:129:21
                 }
 
                 if ($donationData->autoConfirmFromCashBalance && $donation->getPaymentMethodType() !== \MatchBot\Domain\PaymentMethodType::CustomerBalance) {
-                    $this->entityManager->rollback();
+                    
 
                     // Log a warning to more easily spot occurrences in dashboards.
killedBy: MatchBot\Tests\Application\Actions\Donations\UpdateTest::testAddDataRejectsAutoconfirmWithCardMethod
statusReason: 1) MatchBot\Tests\Application\Actions\Donations\UpdateTest::testAddDataRejectsAutoconfirmWithCardMethod
Some predictions failed:
Double\EntityManagerInterface\P4:
  Expected exactly 1 calls that match:
      Double\EntityManagerInterface\P4->rollback()
    but none were made.

/home/barney/projects/matchbot/vendor/phpspec/prophecy-phpunit/src/ProphecyTrait.php:61

[Killed] NullSafePropertyCall
Application/Actions/Donations/Update.php:132:21
                     $this->entityManager->rollback();
 
                     // Log a warning to more easily spot occurrences in dashboards.
-                    $methodSummary = $donation->getPaymentMethodType()?->value ?? '[null]';
+                    $methodSummary = $donation->getPaymentMethodType()->value ?? '[null]';
                     $this->logger->warning(
                         "Donation ID {$args['donationId']} auto-confirm attempted with '$methodSummary' payment method",
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

..............................                                    30 / 30 (100%)

Time: 00:03.087, Memory: 24.00 MB

OK (30 tests, 305 assertions)

[Killed] Coalesce
Application/Actions/Donations/Update.php:132:21
                     $this->entityManager->rollback();
 
                     // Log a warning to more easily spot occurrences in dashboards.
-                    $methodSummary = $donation->getPaymentMethodType()?->value ?? '[null]';
+                    $methodSummary = '[null]' ?? $donation->getPaymentMethodType()?->value;
                     $this->logger->warning(
                         "Donation ID {$args['donationId']} auto-confirm attempted with '$methodSummary' payment method",
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

..............................                                    30 / 30 (100%)

Time: 00:03.097, Memory: 24.00 MB

OK (30 tests, 305 assertions)

[Killed] MethodCallRemoval
Application/Actions/Donations/Update.php:133:21
 
                     // Log a warning to more easily spot occurrences in dashboards.
                     $methodSummary = $donation->getPaymentMethodType()?->value ?? '[null]';
-                    $this->logger->warning(
-                        "Donation ID {$args['donationId']} auto-confirm attempted with '$methodSummary' payment method",
-                    );
+                    
 
                     return $this->validationError(
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

..............................                                    30 / 30 (100%)

Time: 00:03.095, Memory: 24.00 MB

OK (30 tests, 305 assertions)

[Killed] Identical
Application/Actions/Donations/Update.php:144:17
                     );
                 }
 
-                if ($donationData->status === DonationStatus::Cancelled->value) {
+                if ($donationData->status !== DonationStatus::Cancelled->value) {
                     return $this->cancel($donation, $response, $args);
                 }
killedBy: MatchBot\Tests\Application\Actions\Donations\UpdateHandlesLockExceptionTest::testRetriesOnUpdateStillPendingLockException
statusReason: 1) MatchBot\Tests\Application\Actions\Donations\UpdateHandlesLockExceptionTest::testRetriesOnUpdateStillPendingLockException
Failed asserting that two objects are equal.
--- Expected
+++ Actual
@@ @@
 MatchBot\Domain\DonationStatus Object (
-    'name' => 'Pending'
-    'value' => 'Pending'

[Killed] MethodCallRemoval
Application/Actions/Donations/Update.php:150:17
 
                 return $this->addData($donation, $donationData, $args, $response, $request);
             } catch (LockWaitTimeoutException $lockWaitTimeoutException) {
-                $this->logger->warning(sprintf(
-                    'Caught LockWaitTimeoutException in Update for donation %s, retry count %d',
-                    $args['donationId'],
-                    $retryCount,
-                ));
+                
 
                 $microseconds = (int)(100_000 * (2 ** $retryCount)); // pause for 0.1, 0.2, 0.4 and then 0.8s before giving up.
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

..                                                                  2 / 2 (100%)

Time: 00:00.233, Memory: 16.00 MB

OK (2 tests, 15 assertions)

[Killed] CastInt
Application/Actions/Donations/Update.php:156:17
                     $retryCount,
                 ));
 
-                $microseconds = (int)(100_000 * (2 ** $retryCount)); // pause for 0.1, 0.2, 0.4 and then 0.8s before giving up.
+                $microseconds = 100000 * 2 ** $retryCount;
                 \assert($microseconds >= 0);
                 \usleep($microseconds);
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

..                                                                  2 / 2 (100%)

Time: 00:00.232, Memory: 16.00 MB

OK (2 tests, 15 assertions)

[Killed] DecrementInteger
Application/Actions/Donations/Update.php:156:17
                     $retryCount,
                 ));
 
-                $microseconds = (int)(100_000 * (2 ** $retryCount)); // pause for 0.1, 0.2, 0.4 and then 0.8s before giving up.
+                $microseconds = (int) (99999 * 2 ** $retryCount);
                 \assert($microseconds >= 0);
                 \usleep($microseconds);
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

..                                                                  2 / 2 (100%)

Time: 00:00.232, Memory: 16.00 MB

OK (2 tests, 15 assertions)

[NoCoverage] GreaterThanOrEqualToNegotiation
Application/Actions/Donations/Update.php:157:17
                 ));
 
                 $microseconds = (int)(100_000 * (2 ** $retryCount)); // pause for 0.1, 0.2, 0.4 and then 0.8s before giving up.
-                \assert($microseconds >= 0);
+                \assert($microseconds < 0);
                 \usleep($microseconds);
                 $retryCount++;

[NoCoverage] GreaterThanOrEqualTo
Application/Actions/Donations/Update.php:157:17
                 ));
 
                 $microseconds = (int)(100_000 * (2 ** $retryCount)); // pause for 0.1, 0.2, 0.4 and then 0.8s before giving up.
-                \assert($microseconds >= 0);
+                \assert($microseconds > 0);
                 \usleep($microseconds);
                 $retryCount++;

[Killed] FunctionCallRemoval
Application/Actions/Donations/Update.php:158:17
 
                 $microseconds = (int)(100_000 * (2 ** $retryCount)); // pause for 0.1, 0.2, 0.4 and then 0.8s before giving up.
                 \assert($microseconds >= 0);
-                \usleep($microseconds);
+                
                 $retryCount++;
 
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

..                                                                  2 / 2 (100%)

Time: 00:00.025, Memory: 16.00 MB

OK (2 tests, 15 assertions)

[Killed] Increment
Application/Actions/Donations/Update.php:159:17
                 $microseconds = (int)(100_000 * (2 ** $retryCount)); // pause for 0.1, 0.2, 0.4 and then 0.8s before giving up.
                 \assert($microseconds >= 0);
                 \usleep($microseconds);
-                $retryCount++;
+                $retryCount--;
 
                 $this->entityManager->rollback();
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

..                                                                  2 / 2 (100%)

Time: 00:00.233, Memory: 16.00 MB

OK (2 tests, 15 assertions)

[Killed] IfNegation
Application/Actions/Donations/Update.php:163:17
 
                 $this->entityManager->rollback();
             } catch (InvalidRequestException $invalidRequestException) {
-                if (
-                    str_starts_with(
-                        haystack: $invalidRequestException->getMessage(),
-                        needle: "This PaymentIntent's amount could not be updated because it has a status of canceled",
-                    )
-                ) {
-                    \assert(
-                        isset($donation),
-                        "If we've got as far as Stripe throwing an exception we must have a Donation"
-                    );
-
-                    $this->logger->warning(sprintf(
-                        'Stripe rejected payment intent update as PI was cancelled, presumably by stripe' .
-                        ' itself very recently. Donation UUID %s',
-                        $donation->getUuid(),
-                    ));
-                    $this->entityManager->rollback();
-
-                    return $this->validationError(
-                        $response,
-                        "Donation ID {$args['donationId']} could not be updated",
-                        'This donation payment intent has been cancelled. You may wish to start a fresh donation.'
-                    );
-                }
+                if (!str_starts_with(haystack: $invalidRequestException->getMessage(), needle: "This PaymentIntent's amount could not be updated because it has a status of canceled")) {
 
                 throw $invalidRequestException;
killedBy: MatchBot\Tests\Application\Actions\Donations\UpdateTest::testAddDataAutoconfirmHitsUnknownInvalidRequestException
statusReason: 1) MatchBot\Tests\Application\Actions\Donations\UpdateTest::testAddDataAutoconfirmHitsUnknownInvalidRequestException
Failed asserting that exception of type "Stripe\Exception\InvalidRequestException" is thrown.

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.
