[Killed] MethodCallRemoval
Application/Actions/Donations/Update.php:294:17
 
         if ($donation->getPsp() === 'stripe') {
             try {
-                $this->updatePaymentIntent($donation);
+                
             } catch (RateLimitException $exception) {
                 if ($exception->getStripeCode() !== 'lock_timeout') {
killedBy: MatchBot\Tests\Application\Actions\Donations\UpdateTest::testAddDataHitsUnexpectedStripeException
statusReason: 1) MatchBot\Tests\Application\Actions\Donations\UpdateTest::testAddDataHitsUnexpectedStripeException
Failed asserting that 200 matches expected 500.

/home/barney/projects/matchbot/tests/Application/Actions/Donations/UpdateTest.php:1013

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.

[Killed] NotIdentical
Application/Actions/Donations/Update.php:296:17
             try {
                 $this->updatePaymentIntent($donation);
             } catch (RateLimitException $exception) {
-                if ($exception->getStripeCode() !== 'lock_timeout') {
+                if ($exception->getStripeCode() === 'lock_timeout') {
                     throw $exception; // Only re-try when object level lock failed.
                 }
killedBy: MatchBot\Tests\Application\Actions\Donations\UpdateTest::testAddDataHitsStripeLockExceptionOnce
statusReason: 1) MatchBot\Tests\Application\Actions\Donations\UpdateTest::testAddDataHitsStripeLockExceptionOnce

/home/barney/projects/matchbot/tests/Application/Actions/Donations/PaymentIntentUpdateAttemptTwicePromise.php:58
/home/barney/projects/matchbot/tests/Application/Actions/Donations/PaymentIntentUpdateAttemptTwicePromise.php:37
/home/barney/projects/matchbot/vendor/phpspec/prophecy/src/Prophecy/Call/C

[NoCoverage] Throw_
Application/Actions/Donations/Update.php:297:21
                 $this->updatePaymentIntent($donation);
             } catch (RateLimitException $exception) {
                 if ($exception->getStripeCode() !== 'lock_timeout') {
-                    throw $exception; // Only re-try when object level lock failed.
+                    $exception;
                 }
 

[Killed] MethodCallRemoval
Application/Actions/Donations/Update.php:300:17
                     throw $exception; // Only re-try when object level lock failed.
                 }
 
-                $this->logger->info(sprintf(
-                    'Stripe lock "rate limit" hit while updating payment intent for donation %s – retrying in 1s...',
-                    $donation->getUuid(),
-                ));
+                
                 sleep(1);
 
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

..............................                                    30 / 30 (100%)

Time: 00:03.097, Memory: 24.00 MB

OK (30 tests, 305 assertions)

[Killed] IncrementInteger
Application/Actions/Donations/Update.php:304:17
                     'Stripe lock "rate limit" hit while updating payment intent for donation %s – retrying in 1s...',
                     $donation->getUuid(),
                 ));
-                sleep(1);
+                sleep(2);
 
                 try {
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

..............................                                    30 / 30 (100%)

Time: 00:06.095, Memory: 24.00 MB

OK (30 tests, 305 assertions)

[Killed] FunctionCallRemoval
Application/Actions/Donations/Update.php:304:17
                     'Stripe lock "rate limit" hit while updating payment intent for donation %s – retrying in 1s...',
                     $donation->getUuid(),
                 ));
-                sleep(1);
+                
 
                 try {
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

..............................                                    30 / 30 (100%)

Time: 00:00.074, Memory: 24.00 MB

OK (30 tests, 305 assertions)

[Killed] CatchBlockRemoval
Application/Actions/Donations/Update.php:306:17
                 ));
                 sleep(1);
 
-                try {
-                    $this->updatePaymentIntent($donation);
-                } catch (RateLimitException $retryException) {
-                    $this->logger->error(sprintf(
-                        'Stripe Payment Intent update error from lock "rate limit" on %s, %s [%s]: %s',
-                        $donation->getUuid(),
-                        get_class($retryException),
-                        $retryException->getStripeCode(),
-                        $retryException->getMessage(),
-                    ));
-                    $error = new ActionError(ActionError::SERVER_ERROR, 'Could not update Stripe Payment Intent [C]');
-                    $this->entityManager->rollback();
-
-                    return $this->respond($response, new ActionPayload(500, null, $error));
-                } catch (ApiErrorException $retryException) {
-                    $responseIfFinal = $this->handleGeneralStripeError($retryException, $donation, $response);
-
-                    if ($responseIfFinal) {
-                        return $responseIfFinal;
-                    }
-                }
+                
             } catch (ApiErrorException $exception) {
                 $responseIfFinal = $this->handleGeneralStripeError($exception, $donation, $response);
killedBy: MatchBot\Tests\Application\Actions\Donations\UpdateTest::testAddDataHitsStripeLockExceptionTwice
statusReason: 1) MatchBot\Tests\Application\Actions\Donations\UpdateTest::testAddDataHitsStripeLockExceptionTwice
Failed asserting that two arrays are equal.
--- Expected
+++ Actual
@@ @@
 Array (
     'error' => Array (
         'type' => 'SERVER_ERROR'

[Killed] MethodCallRemoval
Application/Actions/Donations/Update.php:309:21
                 try {
                     $this->updatePaymentIntent($donation);
                 } catch (RateLimitException $retryException) {
-                    $this->logger->error(sprintf(
-                        'Stripe Payment Intent update error from lock "rate limit" on %s, %s [%s]: %s',
-                        $donation->getUuid(),
-                        get_class($retryException),
-                        $retryException->getStripeCode(),
-                        $retryException->getMessage(),
-                    ));
+                    
                     $error = new ActionError(ActionError::SERVER_ERROR, 'Could not update Stripe Payment Intent [C]');
                     $this->entityManager->rollback();
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

..............................                                    30 / 30 (100%)

Time: 00:03.092, Memory: 24.00 MB

OK (30 tests, 305 assertions)

[Killed] MethodCallRemoval
Application/Actions/Donations/Update.php:317:21
                         $retryException->getMessage(),
                     ));
                     $error = new ActionError(ActionError::SERVER_ERROR, 'Could not update Stripe Payment Intent [C]');
-                    $this->entityManager->rollback();
+                    
 
                     return $this->respond($response, new ActionPayload(500, null, $error));
killedBy: MatchBot\Tests\Application\Actions\Donations\UpdateTest::testAddDataHitsStripeLockExceptionTwice
statusReason: 1) MatchBot\Tests\Application\Actions\Donations\UpdateTest::testAddDataHitsStripeLockExceptionTwice
Some predictions failed:
Double\EntityManagerInterface\P4:
  Expected exactly 1 calls that match:
      Double\EntityManagerInterface\P4->rollback()
    but none were made.

/home/barney/projects/matchbot/vendor/phpspec/prophecy-phpunit/src/ProphecyTrait.php:61

[Killed] IncrementInteger
Application/Actions/Donations/Update.php:319:21
                     $error = new ActionError(ActionError::SERVER_ERROR, 'Could not update Stripe Payment Intent [C]');
                     $this->entityManager->rollback();
 
-                    return $this->respond($response, new ActionPayload(500, null, $error));
+                    return $this->respond($response, new ActionPayload(501, null, $error));
                 } catch (ApiErrorException $retryException) {
                     $responseIfFinal = $this->handleGeneralStripeError($retryException, $donation, $response);
killedBy: MatchBot\Tests\Application\Actions\Donations\UpdateTest::testAddDataHitsStripeLockExceptionTwice
statusReason: 1) MatchBot\Tests\Application\Actions\Donations\UpdateTest::testAddDataHitsStripeLockExceptionTwice
Failed asserting that 501 matches expected 500.

/home/barney/projects/matchbot/tests/Application/Actions/Donations/UpdateTest.php:1413

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.

[Killed] DecrementInteger
Application/Actions/Donations/Update.php:319:21
                     $error = new ActionError(ActionError::SERVER_ERROR, 'Could not update Stripe Payment Intent [C]');
                     $this->entityManager->rollback();
 
-                    return $this->respond($response, new ActionPayload(500, null, $error));
+                    return $this->respond($response, new ActionPayload(499, null, $error));
                 } catch (ApiErrorException $retryException) {
                     $responseIfFinal = $this->handleGeneralStripeError($retryException, $donation, $response);
killedBy: MatchBot\Tests\Application\Actions\Donations\UpdateTest::testAddDataHitsStripeLockExceptionTwice
statusReason: 1) MatchBot\Tests\Application\Actions\Donations\UpdateTest::testAddDataHitsStripeLockExceptionTwice
Failed asserting that 499 matches expected 500.

/home/barney/projects/matchbot/tests/Application/Actions/Donations/UpdateTest.php:1413

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.

[Killed] IfNegation
Application/Actions/Donations/Update.php:323:21
                 } catch (ApiErrorException $retryException) {
                     $responseIfFinal = $this->handleGeneralStripeError($retryException, $donation, $response);
 
-                    if ($responseIfFinal) {
-                        return $responseIfFinal;
-                    }
+                    if (!$responseIfFinal) {
                 }
             } catch (ApiErrorException $exception) {
killedBy: MatchBot\Tests\Application\Actions\Donations\UpdateTest::testAddDataHitsStripeLockExceptionThenAlreadyCapturedWithNoFeeChange
statusReason: 1) MatchBot\Tests\Application\Actions\Donations\UpdateTest::testAddDataHitsStripeLockExceptionThenAlreadyCapturedWithNoFeeChange
TypeError: MatchBot\Application\Actions\Donations\Update::addData(): Return value must be of type Psr\Http\Message\ResponseInterface, null returned

/home/barney/projects/matchbot/src/Application/Actions/Donations/Update.php:210
/home/barney/projects/matchbot/src/Applica

[Killed] NotIdentical
Application/Actions/Donations/Update.php:338:21
             if ($donationData->autoConfirmFromCashBalance) {
                 try {
                     $confirmedIntent = $this->stripeClient->paymentIntents->confirm($donation->getTransactionId());
-                    if ($confirmedIntent->status !== PaymentIntent::STATUS_SUCCEEDED) {
+                    if ($confirmedIntent->status === PaymentIntent::STATUS_SUCCEEDED) {
                         // As this is autoConfirmFromCashBalance and we only expect people to make such donations if they
                         // have a sufficient balance we expect PI to succeed synchronosly. If it didn't we don't want to
killedBy: MatchBot\Tests\Application\Actions\Donations\UpdateTest::testAddDataSuccessWithCashBalanceAutoconfirm
statusReason: 1) MatchBot\Tests\Application\Actions\Donations\UpdateTest::testAddDataSuccessWithCashBalanceAutoconfirm
Slim\Exception\HttpBadRequestException: Status was succeeded, expected succeeded

/home/barney/projects/matchbot/src/Application/Actions/Donations/Update.php:227
/home/barney/projects/matchbot/src/Application/Actions/Donations/Update.php:99
/home/barney/projects/matchbot/src/Application/Actions

[Killed] MethodCallRemoval
Application/Actions/Donations/Update.php:342:25
                         // As this is autoConfirmFromCashBalance and we only expect people to make such donations if they
                         // have a sufficient balance we expect PI to succeed synchronosly. If it didn't we don't want to
                         // leave the PI around to succeed later when the donor might not be expecting it.
-                        $this->cancelDonationAndPaymentIntent($donation, $confirmedIntent);
+                        
                         throw new HttpBadRequestException(
                             $request,
killedBy: MatchBot\Tests\Application\Actions\Donations\UpdateTest::testAddDataFailsWithCashBalanceAutoconfirmForDonorWithInsufficentFunds
statusReason: 1) MatchBot\Tests\Application\Actions\Donations\UpdateTest::testAddDataFailsWithCashBalanceAutoconfirmForDonorWithInsufficentFunds
Some predictions failed:
Double\EntityManagerInterface\P4:
  No calls have been made that match:
      Double\EntityManagerInterface\P4->flush()
    but expected at least one.
Double\Stripe\Service\PaymentIntentService\P5:
  No calls have been made that match:

[Killed] Throw_
Application/Actions/Donations/Update.php:343:25
                         // have a sufficient balance we expect PI to succeed synchronosly. If it didn't we don't want to
                         // leave the PI around to succeed later when the donor might not be expecting it.
                         $this->cancelDonationAndPaymentIntent($donation, $confirmedIntent);
-                        throw new HttpBadRequestException(
-                            $request,
-                            "Status was {$confirmedIntent->status}, expected " . PaymentIntent::STATUS_SUCCEEDED
-                        );
+                        new HttpBadRequestException($request, "Status was {$confirmedIntent->status}, expected " . PaymentIntent::STATUS_SUCCEEDED);
                     }
                 } catch (InvalidRequestException $exception) {
killedBy: MatchBot\Tests\Application\Actions\Donations\UpdateTest::testAddDataFailsWithCashBalanceAutoconfirmForDonorWithInsufficentFunds
statusReason: 1) MatchBot\Tests\Application\Actions\Donations\UpdateTest::testAddDataFailsWithCashBalanceAutoconfirmForDonorWithInsufficentFunds
TypeError: Double\MatchBot\Domain\DonationRepository\P3::push(): Return value must be of type bool, null returned

/home/barney/projects/matchbot/src/Application/Actions/Donations/Update.php:319
/home/barney/projects/matchbot/src/Application/Actions/Donations/Update.ph

[Killed] ConcatOperandRemoval
Application/Actions/Donations/Update.php:345:29
                         $this->cancelDonationAndPaymentIntent($donation, $confirmedIntent);
                         throw new HttpBadRequestException(
                             $request,
-                            "Status was {$confirmedIntent->status}, expected " . PaymentIntent::STATUS_SUCCEEDED
+                            throw new HttpBadRequestException($request, PaymentIntent::STATUS_SUCCEEDED);
                         );
                     }
killedBy: MatchBot\Tests\Application\Actions\Donations\UpdateTest::testAddDataFailsWithCashBalanceAutoconfirmForDonorWithInsufficentFunds
statusReason: 1) MatchBot\Tests\Application\Actions\Donations\UpdateTest::testAddDataFailsWithCashBalanceAutoconfirmForDonorWithInsufficentFunds
Failed asserting that 'succeeded' contains "Status was processing, expected succeeded".

/home/barney/projects/matchbot/tests/Application/Actions/Donations/UpdateTest.php:1669

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] Concat
Application/Actions/Donations/Update.php:345:29
                         $this->cancelDonationAndPaymentIntent($donation, $confirmedIntent);
                         throw new HttpBadRequestException(
                             $request,
-                            "Status was {$confirmedIntent->status}, expected " . PaymentIntent::STATUS_SUCCEEDED
+                            throw new HttpBadRequestException($request, PaymentIntent::STATUS_SUCCEEDED . "Status was {$confirmedIntent->status}, expected ");
                         );
                     }
killedBy: MatchBot\Tests\Application\Actions\Donations\UpdateTest::testAddDataFailsWithCashBalanceAutoconfirmForDonorWithInsufficentFunds
statusReason: 1) MatchBot\Tests\Application\Actions\Donations\UpdateTest::testAddDataFailsWithCashBalanceAutoconfirmForDonorWithInsufficentFunds
Failed asserting that 'succeededStatus was processing, expected ' contains "Status was processing, expected succeeded".

/home/barney/projects/matchbot/tests/Application/Actions/Donations/UpdateTest.php:1669

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] MethodCallRemoval
Application/Actions/Donations/Update.php:352:21
                     // Currently a typical Update call which auto-confirms is being made for just
                     // that purpose. So our safest options are to return a 500 and roll back any
                     // database changes.
-                    $this->entityManager->rollback();
+                    
 
                     // To help analyse it quicker we handle the specific auto-confirm API failure we've
killedBy: MatchBot\Tests\Application\Actions\Donations\UpdateTest::testAddDataAutoconfirmHitsUnknownInvalidRequestException
statusReason: 1) MatchBot\Tests\Application\Actions\Donations\UpdateTest::testAddDataAutoconfirmHitsUnknownInvalidRequestException
Some predictions failed:
Double\EntityManagerInterface\P4:
  Expected exactly 1 calls that match:
      Double\EntityManagerInterface\P4->rollback()
    but none were made.

/home/barney/projects/matchbot/vendor/phpspec/prophecy-phpunit/src/ProphecyTrait.php:61

[Killed] IfNegation
Application/Actions/Donations/Update.php:357:21
                     // To help analyse it quicker we handle the specific auto-confirm API failure we've
                     // seen before with a distinct message, but both options give the client an HTTP 500,
                     // as we expect neither with our updated guard conditions.
-                    if (str_starts_with($exception->getMessage(), "You cannot confirm this PaymentIntent because it's missing a payment method")) {
-                        $this->logger->error(sprintf(
-                            'Stripe Payment Intent for donation ID %s was missing a payment method, so we could not confirm it',
-                            $donation->getUuid(),
-                        ));
-                        $error = new ActionError(ActionError::SERVER_ERROR, 'Could not confirm Stripe Payment Intent');
-
-                        return $this->respond($response, new ActionPayload(500, null, $error));
-                    }
+                    if (!str_starts_with($exception->getMessage(), "You cannot confirm this PaymentIntent because it's missing a payment method")) {
 
                     throw $exception;
killedBy: MatchBot\Tests\Application\Actions\Donations\UpdateTest::testAddDataAutoconfirmHitsUnknownInvalidRequestException
statusReason: 1) MatchBot\Tests\Application\Actions\Donations\UpdateTest::testAddDataAutoconfirmHitsUnknownInvalidRequestException
Failed asserting that exception of type "Stripe\Exception\InvalidRequestException" is thrown.

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[NoCoverage] MethodCallRemoval
Application/Actions/Donations/Update.php:358:25
                     // seen before with a distinct message, but both options give the client an HTTP 500,
                     // as we expect neither with our updated guard conditions.
                     if (str_starts_with($exception->getMessage(), "You cannot confirm this PaymentIntent because it's missing a payment method")) {
-                        $this->logger->error(sprintf(
-                            'Stripe Payment Intent for donation ID %s was missing a payment method, so we could not confirm it',
-                            $donation->getUuid(),
-                        ));
+                        
                         $error = new ActionError(ActionError::SERVER_ERROR, 'Could not confirm Stripe Payment Intent');
 

[Killed] Throw_
Application/Actions/Donations/Update.php:367:21
                         return $this->respond($response, new ActionPayload(500, null, $error));
                     }
 
-                    throw $exception;
+                    $exception;
                 }
             }
killedBy: MatchBot\Tests\Application\Actions\Donations\UpdateTest::testAddDataAutoconfirmHitsUnknownInvalidRequestException
statusReason: 1) MatchBot\Tests\Application\Actions\Donations\UpdateTest::testAddDataAutoconfirmHitsUnknownInvalidRequestException
Failed asserting that exception of type "Stripe\Exception\InvalidRequestException" is thrown.

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] MethodCallRemoval
Application/Actions/Donations/Update.php:372:9
             }
         }
 
-        $this->save($donation);
+        
 
         return $this->respondWithData($response, $donation->toApiModel());
killedBy: MatchBot\Tests\Application\Actions\Donations\UpdateHandlesLockExceptionTest::testRetriesOnUpdateStillPendingLockException
statusReason: 1) MatchBot\Tests\Application\Actions\Donations\UpdateHandlesLockExceptionTest::testRetriesOnUpdateStillPendingLockException
Some predictions failed:
Double\EntityManagerInterface\P4:
  Expected exactly 1 calls that match:
      Double\EntityManagerInterface\P4->rollback()
    but none were made.
  Expected exactly 2 calls that match:
      Double\EntityManagerInterface\P4->beginTransaction()

[Killed] Identical
Application/Actions/Donations/Update.php:379:9
 
     private function cancel(Donation $donation, Response $response, array $args): Response
     {
-        if ($donation->getDonationStatus() === DonationStatus::Cancelled) {
+        if ($donation->getDonationStatus() !== DonationStatus::Cancelled) {
             $this->logger->info("Donation ID {$args['donationId']} was already Cancelled");
             $this->entityManager->rollback();
killedBy: MatchBot\Tests\Application\Actions\Donations\UpdateHandlesLockExceptionTest::testRetriesOnUpdateToCancelledLockException
statusReason: 1) MatchBot\Tests\Application\Actions\Donations\UpdateHandlesLockExceptionTest::testRetriesOnUpdateToCancelledLockException
Some predictions failed:
Double\MatchBot\Domain\DonationRepository\P3:
  No calls have been made that match:
      Double\MatchBot\Domain\DonationRepository\P3->push(exact(MatchBot\Domain\Donation#571 Object (
        'id' => null
        'salesforceId' => null
        'sales

[Killed] MethodCallRemoval
Application/Actions/Donations/Update.php:380:13
     private function cancel(Donation $donation, Response $response, array $args): Response
     {
         if ($donation->getDonationStatus() === DonationStatus::Cancelled) {
-            $this->logger->info("Donation ID {$args['donationId']} was already Cancelled");
+            
             $this->entityManager->rollback();
 
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

..............................                                    30 / 30 (100%)

Time: 00:03.086, Memory: 24.00 MB

OK (30 tests, 305 assertions)

[Killed] MethodCallRemoval
Application/Actions/Donations/Update.php:381:13
     {
         if ($donation->getDonationStatus() === DonationStatus::Cancelled) {
             $this->logger->info("Donation ID {$args['donationId']} was already Cancelled");
-            $this->entityManager->rollback();
+            
 
             return $this->respondWithData($response, $donation->toApiModel());
killedBy: MatchBot\Tests\Application\Actions\Donations\UpdateTest::testCancelSuccessWithNoStatusChangesIgnored
statusReason: 1) MatchBot\Tests\Application\Actions\Donations\UpdateTest::testCancelSuccessWithNoStatusChangesIgnored
Some predictions failed:
Double\EntityManagerInterface\P4:
  Expected exactly 1 calls that match:
      Double\EntityManagerInterface\P4->rollback()
    but none were made.

/home/barney/projects/matchbot/vendor/phpspec/prophecy-phpunit/src/ProphecyTrait.php:61

[Killed] IfNegation
Application/Actions/Donations/Update.php:386:9
             return $this->respondWithData($response, $donation->toApiModel());
         }
 
-        if ($donation->getDonationStatus()->isSuccessful()) {
-            // If a donor uses browser back before loading the thank you page, it is possible for them to get
-            // a Cancel dialog and send a cancellation attempt to this endpoint after finishing the donation.
-            $this->entityManager->rollback();
-
-            return $this->validationError(
-                $response,
-                "Donation ID {$args['donationId']} could not be cancelled as {$donation->getDonationStatus()->value}",
-                'Donation already finalised'
-            );
-        }
+        if (!$donation->getDonationStatus()->isSuccessful()) {
 
         $this->logger->info("Donor cancelled ID {$args['donationId']}");
killedBy: MatchBot\Tests\Application\Actions\Donations\UpdateHandlesLockExceptionTest::testRetriesOnUpdateToCancelledLockException
statusReason: 1) MatchBot\Tests\Application\Actions\Donations\UpdateHandlesLockExceptionTest::testRetriesOnUpdateToCancelledLockException
Failed asserting that 400 is identical to 200.

/home/barney/projects/matchbot/tests/Application/Actions/Donations/UpdateHandlesLockExceptionTest.php:108

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] MethodCallRemoval
Application/Actions/Donations/Update.php:389:13
         if ($donation->getDonationStatus()->isSuccessful()) {
             // If a donor uses browser back before loading the thank you page, it is possible for them to get
             // a Cancel dialog and send a cancellation attempt to this endpoint after finishing the donation.
-            $this->entityManager->rollback();
+            
 
             return $this->validationError(
killedBy: MatchBot\Tests\Application\Actions\Donations\UpdateTest::testCancelRequestAfterDonationFinalised
statusReason: 1) MatchBot\Tests\Application\Actions\Donations\UpdateTest::testCancelRequestAfterDonationFinalised
Some predictions failed:
Double\EntityManagerInterface\P4:
  Expected exactly 1 calls that match:
      Double\EntityManagerInterface\P4->rollback()
    but none were made.

/home/barney/projects/matchbot/vendor/phpspec/prophecy-phpunit/src/ProphecyTrait.php:61

[Killed] MethodCallRemoval
Application/Actions/Donations/Update.php:398:9
             );
         }
 
-        $this->logger->info("Donor cancelled ID {$args['donationId']}");
+        
 
         $donation->cancel();
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

................................                                  32 / 32 (100%)

Time: 00:03.314, Memory: 26.00 MB

OK (32 tests, 320 assertions)

[Killed] MethodCallRemoval
Application/Actions/Donations/Update.php:400:9
 
         $this->logger->info("Donor cancelled ID {$args['donationId']}");
 
-        $donation->cancel();
+        
 
         // Save & flush early to reduce chance of lock conflicts.
killedBy: MatchBot\Tests\Application\Actions\Donations\UpdateHandlesLockExceptionTest::testRetriesOnUpdateToCancelledLockException
statusReason: 1) MatchBot\Tests\Application\Actions\Donations\UpdateHandlesLockExceptionTest::testRetriesOnUpdateToCancelledLockException
Failed asserting that two objects are equal.
--- Expected
+++ Actual
@@ @@
 MatchBot\Domain\DonationStatus Object (
-    'name' => 'Cancelled'
-    'value' => 'Cancelled'

[Killed] MethodCallRemoval
Application/Actions/Donations/Update.php:403:9
         $donation->cancel();
 
         // Save & flush early to reduce chance of lock conflicts.
-        $this->save($donation);
+        
 
         if ($donation->getCampaign()->isMatched()) {
killedBy: MatchBot\Tests\Application\Actions\Donations\UpdateHandlesLockExceptionTest::testRetriesOnUpdateToCancelledLockException
statusReason: 1) MatchBot\Tests\Application\Actions\Donations\UpdateHandlesLockExceptionTest::testRetriesOnUpdateToCancelledLockException
Some predictions failed:
Double\MatchBot\Domain\DonationRepository\P3:
  No calls have been made that match:
      Double\MatchBot\Domain\DonationRepository\P3->push(exact(MatchBot\Domain\Donation#571 Object (
        'id' => null
        'salesforceId' => null
        'sales

[Killed] IfNegation
Application/Actions/Donations/Update.php:405:9
         // Save & flush early to reduce chance of lock conflicts.
         $this->save($donation);
 
-        if ($donation->getCampaign()->isMatched()) {
-            $this->donationRepository->releaseMatchFunds($donation);
-        }
+        if (!$donation->getCampaign()->isMatched()) {
 
         if ($donation->getPsp() === 'stripe') {
killedBy: MatchBot\Tests\Application\Actions\Donations\UpdateHandlesLockExceptionTest::testRetriesOnUpdateToCancelledLockException
statusReason: 1) MatchBot\Tests\Application\Actions\Donations\UpdateHandlesLockExceptionTest::testRetriesOnUpdateToCancelledLockException
Some predictions failed:
Double\MatchBot\Domain\DonationRepository\P3:
  No calls have been made that match:
      Double\MatchBot\Domain\DonationRepository\P3->releaseMatchFunds(exact(MatchBot\Domain\Donation#571 Object (
        'id' => null
        'salesforceId' => null
