[Killed] MethodCallRemoval
Application/Actions/Hooks/Stripe.php:27:9
     {
         $this->stripeSettings = $container->get('settings')['stripe'];
 
-        parent::__construct($logger);
+        
     }
 
killedBy: MatchBot\Tests\Application\Actions\Hooks\StripePayoutUpdateTest::testUnsupportedAction
statusReason: 1) MatchBot\Tests\Application\Actions\Hooks\StripePayoutUpdateTest::testUnsupportedAction
Error: Typed property MatchBot\Application\Actions\Action::$logger must not be accessed before initialization

/home/barney/projects/matchbot/src/Application/Actions/Hooks/StripePayoutUpdate.php:66
/home/barney/projects/matchbot/src/Application/Actions/Action.php:34
/home/barney/projects/matchbot/vendor/slim/

[Killed] ProtectedVisibility
Application/Actions/Hooks/Stripe.php:37:5
      * @return Response|null            Validation error or no-op 204 response if event should
      *                                  not be processed, or null if $this->event was set up.
      */
-    protected function prepareEvent(
+    private function prepareEvent(ServerRequestInterface $request, string $webhookSecret, bool $connect, Response $response) : ?ResponseInterface
         ServerRequestInterface $request,
         string $webhookSecret,
killedBy: MatchBot\Tests\Application\Actions\Hooks\StripePayoutUpdateTest::testUnsupportedAction
statusReason: 1) MatchBot\Tests\Application\Actions\Hooks\StripePayoutUpdateTest::testUnsupportedAction
Error: Call to private method MatchBot\Application\Actions\Hooks\Stripe::prepareEvent() from scope MatchBot\Application\Actions\Hooks\StripePayoutUpdate

/home/barney/projects/matchbot/src/Application/Actions/Hooks/StripePayoutUpdate.php:53
/home/barney/projects/matchbot/src/Application/Actions/Action.php:34

[Killed] CatchBlockRemoval
Application/Actions/Hooks/Stripe.php:43:9
         bool $connect,
         Response $response,
     ): ?ResponseInterface {
-        try {
-            $headerLine = $request->getHeaderLine('stripe-signature');
-            $this->event = \Stripe\Webhook::constructEvent(
-                $request->getBody(),
-                $headerLine,
-                $webhookSecret
-            );
-        } catch (\UnexpectedValueException $e) {
-            return $this->validationError($response, "Invalid Payload: {$e->getMessage()}", 'Invalid Payload');
-        } catch (\Stripe\Exception\SignatureVerificationException $e) {
-            return $this->validationError($response, 'Invalid Signature');
-        }
+        
 
         if (!($this->event instanceof Event)) {
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

....................                                              20 / 20 (100%)

Time: 00:00.072, Memory: 24.00 MB

OK (20 tests, 97 assertions)

[Killed] InstanceOf_
Application/Actions/Hooks/Stripe.php:56:9
             return $this->validationError($response, 'Invalid Signature');
         }
 
-        if (!($this->event instanceof Event)) {
+        if (!true) {
             return $this->validationError($response, 'Invalid event');
         }
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

....................                                              20 / 20 (100%)

Time: 00:00.090, Memory: 24.00 MB

OK (20 tests, 97 assertions)

[Killed] InstanceOf_
Application/Actions/Hooks/Stripe.php:56:9
             return $this->validationError($response, 'Invalid Signature');
         }
 
-        if (!($this->event instanceof Event)) {
+        if (!false) {
             return $this->validationError($response, 'Invalid event');
         }
killedBy: MatchBot\Tests\Application\Actions\Hooks\StripePayoutUpdateTest::testUnsupportedAction
statusReason: 1) MatchBot\Tests\Application\Actions\Hooks\StripePayoutUpdateTest::testUnsupportedAction
Failed asserting that 400 matches expected 204.

/home/barney/projects/matchbot/tests/Application/Actions/Hooks/StripePayoutUpdateTest.php:44

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] LogicalAnd
Application/Actions/Hooks/Stripe.php:60:9
             return $this->validationError($response, 'Invalid event');
         }
 
-        if (!$this->event->livemode && getenv('APP_ENV') === 'production') {
+        if (!$this->event->livemode || getenv('APP_ENV') === 'production') {
             /**
              * This is normal for Connect events so just `info()` log it in that case.
killedBy: MatchBot\Tests\Application\Actions\Hooks\StripePayoutUpdateTest::testPayoutPaidQueueDispatchError
statusReason: 1) MatchBot\Tests\Application\Actions\Hooks\StripePayoutUpdateTest::testPayoutPaidQueueDispatchError
Failed asserting that 204 matches expected 500.

/home/barney/projects/matchbot/tests/Application/Actions/Hooks/StripePayoutUpdateTest.php:104

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] LogicalNot
Application/Actions/Hooks/Stripe.php:60:9
             return $this->validationError($response, 'Invalid event');
         }
 
-        if (!$this->event->livemode && getenv('APP_ENV') === 'production') {
+        if ($this->event->livemode && getenv('APP_ENV') === 'production') {
             /**
              * This is normal for Connect events so just `info()` log it in that case.
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

....................                                              20 / 20 (100%)

Time: 00:00.073, Memory: 24.00 MB

OK (20 tests, 97 assertions)

[NoCoverage] Ternary
Application/Actions/Hooks/Stripe.php:66:13
              * "...both live and test webhooks will be sent to your production webhook URLs."
              * @link https://stripe.com/docs/connect/webhooks
              */
-            $method = $connect ? 'info' : 'warning';
+            $method = $connect ? 'warning' : 'info';
             $this->logger->$method(sprintf('Skipping non-live %s webhook in Production', $this->event->type));
 

[NoCoverage] MethodCallRemoval
Application/Actions/Hooks/Stripe.php:67:13
              * @link https://stripe.com/docs/connect/webhooks
              */
             $method = $connect ? 'info' : 'warning';
-            $this->logger->$method(sprintf('Skipping non-live %s webhook in Production', $this->event->type));
+            
 
             return $this->respond($response, new ActionPayload(204));

[NoCoverage] DecrementInteger
Application/Actions/Hooks/Stripe.php:69:13
             $method = $connect ? 'info' : 'warning';
             $this->logger->$method(sprintf('Skipping non-live %s webhook in Production', $this->event->type));
 
-            return $this->respond($response, new ActionPayload(204));
+            return $this->respond($response, new ActionPayload(203));
         }
 

[NoCoverage] IncrementInteger
Application/Actions/Hooks/Stripe.php:69:13
             $method = $connect ? 'info' : 'warning';
             $this->logger->$method(sprintf('Skipping non-live %s webhook in Production', $this->event->type));
 
-            return $this->respond($response, new ActionPayload(204));
+            return $this->respond($response, new ActionPayload(205));
         }
 
