[NoCoverage] DecrementInteger
Application/Actions/Hooks/StripePaymentsUpdate.php:270:13
         if (!$donation) {
             $this->logger->notice(sprintf('Donation not found with Charge ID %s', $charge->id));
             $this->entityManager->rollback();
-            return $this->respond($response, new ActionPayload(204));
+            return $this->respond($response, new ActionPayload(203));
         }
 

[Killed] Identical
Application/Actions/Hooks/StripePaymentsUpdate.php:273:9
             return $this->respond($response, new ActionPayload(204));
         }
 
-        $isTipRefund = $donation->getTipAmountFractional() === $amountRefunded;
+        $isTipRefund = $donation->getTipAmountFractional() !== $amountRefunded;
         $isFullRefund = $donation->getAmountFractionalIncTip() === $amountRefunded;
         // If things disagree about the original captured amount, this is still uncharted
killedBy: MatchBot\Tests\Application\Actions\Hooks\StripePaymentsUpdateTest::testSuccessfulFullRefund
statusReason: 1) MatchBot\Tests\Application\Actions\Hooks\StripePaymentsUpdateTest::testSuccessfulFullRefund
Failed asserting that two objects are equal.
--- Expected
+++ Actual
@@ @@
 MatchBot\Domain\DonationStatus Object (
-    'name' => 'Refunded'
-    'value' => 'Refunded'

[Killed] Identical
Application/Actions/Hooks/StripePaymentsUpdate.php:274:9
         }
 
         $isTipRefund = $donation->getTipAmountFractional() === $amountRefunded;
-        $isFullRefund = $donation->getAmountFractionalIncTip() === $amountRefunded;
+        $isFullRefund = $donation->getAmountFractionalIncTip() !== $amountRefunded;
         // If things disagree about the original captured amount, this is still uncharted
         // territory and we should refrain from processing. If that matches but there is an
killedBy: MatchBot\Tests\Application\Actions\Hooks\StripePaymentsUpdateTest::testSuccessfulFullRefund
statusReason: 1) MatchBot\Tests\Application\Actions\Hooks\StripePaymentsUpdateTest::testSuccessfulFullRefund
Failed asserting that two objects are equal.
--- Expected
+++ Actual
@@ @@
 MatchBot\Domain\DonationStatus Object (
-    'name' => 'Refunded'
-    'value' => 'Refunded'

[Killed] Identical
Application/Actions/Hooks/StripePaymentsUpdate.php:280:13
         // over-refund, we'll want to notify the team but we know we are best off handling it
         // like a simple refund from a donation status perspective.
         $isOverRefund = (
-            $donation->getAmountFractionalIncTip() === $charge->amount_captured &&
+            $isOverRefund = $donation->getAmountFractionalIncTip() !== $charge->amount_captured && $amountRefunded > $donation->getAmountFractionalIncTip();
             $amountRefunded > $donation->getAmountFractionalIncTip()
         );
killedBy: MatchBot\Tests\Application\Actions\Hooks\StripePaymentsUpdateTest::testOverRefundSendsSlackNoticeAndUpdatesRecord
statusReason: 1) MatchBot\Tests\Application\Actions\Hooks\StripePaymentsUpdateTest::testOverRefundSendsSlackNoticeAndUpdatesRecord
Failed asserting that two objects are equal.
--- Expected
+++ Actual
@@ @@
 MatchBot\Domain\DonationStatus Object (
-    'name' => 'Refunded'
-    'value' => 'Refunded'

[Killed] LogicalAndNegation
Application/Actions/Hooks/StripePaymentsUpdate.php:280:13
         // over-refund, we'll want to notify the team but we know we are best off handling it
         // like a simple refund from a donation status perspective.
         $isOverRefund = (
-            $donation->getAmountFractionalIncTip() === $charge->amount_captured &&
-            $amountRefunded > $donation->getAmountFractionalIncTip()
+            $isOverRefund = !($donation->getAmountFractionalIncTip() === $charge->amount_captured && $amountRefunded > $donation->getAmountFractionalIncTip());
         );
 
killedBy: MatchBot\Tests\Application\Actions\Hooks\StripePaymentsUpdateTest::testOverRefundSendsSlackNoticeAndUpdatesRecord
statusReason: 1) MatchBot\Tests\Application\Actions\Hooks\StripePaymentsUpdateTest::testOverRefundSendsSlackNoticeAndUpdatesRecord
Failed asserting that two objects are equal.
--- Expected
+++ Actual
@@ @@
 MatchBot\Domain\DonationStatus Object (
-    'name' => 'Refunded'
-    'value' => 'Refunded'

[Killed] GreaterThanNegotiation
Application/Actions/Hooks/StripePaymentsUpdate.php:281:13
         // like a simple refund from a donation status perspective.
         $isOverRefund = (
             $donation->getAmountFractionalIncTip() === $charge->amount_captured &&
-            $amountRefunded > $donation->getAmountFractionalIncTip()
+            $isOverRefund = $donation->getAmountFractionalIncTip() === $charge->amount_captured && $amountRefunded <= $donation->getAmountFractionalIncTip();
         );
 
killedBy: MatchBot\Tests\Application\Actions\Hooks\StripePaymentsUpdateTest::testOverRefundSendsSlackNoticeAndUpdatesRecord
statusReason: 1) MatchBot\Tests\Application\Actions\Hooks\StripePaymentsUpdateTest::testOverRefundSendsSlackNoticeAndUpdatesRecord
Failed asserting that two objects are equal.
--- Expected
+++ Actual
@@ @@
 MatchBot\Domain\DonationStatus Object (
-    'name' => 'Refunded'
-    'value' => 'Refunded'

[Killed] GreaterThan
Application/Actions/Hooks/StripePaymentsUpdate.php:281:13
         // like a simple refund from a donation status perspective.
         $isOverRefund = (
             $donation->getAmountFractionalIncTip() === $charge->amount_captured &&
-            $amountRefunded > $donation->getAmountFractionalIncTip()
+            $isOverRefund = $donation->getAmountFractionalIncTip() === $charge->amount_captured && $amountRefunded >= $donation->getAmountFractionalIncTip();
         );
 
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

...............                                                   15 / 15 (100%)

Time: 00:00.064, Memory: 24.00 MB

OK (15 tests, 88 assertions)

[Killed] MethodCallRemoval
Application/Actions/Hooks/StripePaymentsUpdate.php:285:13
         );
 
         if ($isTipRefund) {
-            $this->logger->info(sprintf(
-                'Setting donation %s tip amount to £0 based on charge ID %s',
-                $donation->getUuid(),
-                $charge->id,
-            ));
+            
             $refundDate = DateTimeImmutable::createFromFormat('U', (string)$event->created);
             assert($refundDate instanceof DateTimeImmutable);
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

...............                                                   15 / 15 (100%)

Time: 00:00.082, Memory: 24.00 MB

OK (15 tests, 88 assertions)

[Killed] CastString
Application/Actions/Hooks/StripePaymentsUpdate.php:290:13
                 $donation->getUuid(),
                 $charge->id,
             ));
-            $refundDate = DateTimeImmutable::createFromFormat('U', (string)$event->created);
+            $refundDate = DateTimeImmutable::createFromFormat('U', $event->created);
             assert($refundDate instanceof DateTimeImmutable);
             $donation->setPartialRefundDate($refundDate);
killedBy: MatchBot\Tests\Application\Actions\Hooks\StripePaymentsUpdateTest::testSuccessfulTipRefund
statusReason: 1) MatchBot\Tests\Application\Actions\Hooks\StripePaymentsUpdateTest::testSuccessfulTipRefund
TypeError: DateTimeImmutable::createFromFormat(): Argument #2 ($datetime) must be of type string, int given

/home/barney/projects/matchbot/src/Application/Actions/Hooks/StripePaymentsUpdate.php:202
/home/barney/projects/matchbot/src/Application/Actions/Hooks/StripePaymentsUpdate.php:69
/home/barney/proje

[Killed] MethodCallRemoval
Application/Actions/Hooks/StripePaymentsUpdate.php:292:13
             ));
             $refundDate = DateTimeImmutable::createFromFormat('U', (string)$event->created);
             assert($refundDate instanceof DateTimeImmutable);
-            $donation->setPartialRefundDate($refundDate);
+            
             $donation->setTipAmount('0.00');
         } elseif ($isFullRefund) {
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

...............                                                   15 / 15 (100%)

Time: 00:00.100, Memory: 24.00 MB

OK (15 tests, 88 assertions)

[Killed] MethodCallRemoval
Application/Actions/Hooks/StripePaymentsUpdate.php:293:13
             $refundDate = DateTimeImmutable::createFromFormat('U', (string)$event->created);
             assert($refundDate instanceof DateTimeImmutable);
             $donation->setPartialRefundDate($refundDate);
-            $donation->setTipAmount('0.00');
+            
         } elseif ($isFullRefund) {
             $this->logger->info(sprintf(
killedBy: MatchBot\Tests\Application\Actions\Hooks\StripePaymentsUpdateTest::testSuccessfulTipRefund
statusReason: 1) MatchBot\Tests\Application\Actions\Hooks\StripePaymentsUpdateTest::testSuccessfulTipRefund
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
-'0.00'
+'1.00'

[Killed] ElseIfNegation
Application/Actions/Hooks/StripePaymentsUpdate.php:294:9
             assert($refundDate instanceof DateTimeImmutable);
             $donation->setPartialRefundDate($refundDate);
             $donation->setTipAmount('0.00');
-        } elseif ($isFullRefund) {
-            $this->logger->info(sprintf(
-                'Marking donation %s refunded based on charge ID %s',
-                $donation->getUuid(),
-                $charge->id,
-            ));
-            $refundDate = DateTimeImmutable::createFromFormat('U', (string)$event->created);
-            assert($refundDate instanceof DateTimeImmutable);
-            $donation->recordRefundAt($refundDate);
-        } elseif ($isOverRefund) {
+        } elseif (!$isFullRefund) {
             $this->warnAboutOverRefund(
                 'charge.refunded',
killedBy: MatchBot\Tests\Application\Actions\Hooks\StripePaymentsUpdateTest::testSuccessfulFullRefund
statusReason: 1) MatchBot\Tests\Application\Actions\Hooks\StripePaymentsUpdateTest::testSuccessfulFullRefund
Failed asserting that two objects are equal.
--- Expected
+++ Actual
@@ @@
 MatchBot\Domain\DonationStatus Object (
-    'name' => 'Refunded'
-    'value' => 'Refunded'

[Killed] MethodCallRemoval
Application/Actions/Hooks/StripePaymentsUpdate.php:295:13
             $donation->setPartialRefundDate($refundDate);
             $donation->setTipAmount('0.00');
         } elseif ($isFullRefund) {
-            $this->logger->info(sprintf(
-                'Marking donation %s refunded based on charge ID %s',
-                $donation->getUuid(),
-                $charge->id,
-            ));
+            
             $refundDate = DateTimeImmutable::createFromFormat('U', (string)$event->created);
             assert($refundDate instanceof DateTimeImmutable);
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

...............                                                   15 / 15 (100%)

Time: 00:00.130, Memory: 24.00 MB

OK (15 tests, 88 assertions)

[Killed] ElseIfNegation
Application/Actions/Hooks/StripePaymentsUpdate.php:303:9
             $refundDate = DateTimeImmutable::createFromFormat('U', (string)$event->created);
             assert($refundDate instanceof DateTimeImmutable);
             $donation->recordRefundAt($refundDate);
-        } elseif ($isOverRefund) {
-            $this->warnAboutOverRefund(
-                'charge.refunded',
-                $donation,
-                $amountRefunded,
-                $charge->currency,
-            );
-
-            $this->logger->info(sprintf(
-                'Marking donation %s refunded (with extra) based on charge ID %s',
-                $donation->getUuid(),
-                $charge->id,
-            ));
-            $refundDate = DateTimeImmutable::createFromFormat('U', (string)$event->created);
-            assert($refundDate instanceof DateTimeImmutable);
-            $donation->recordRefundAt($refundDate);
-        } else {
+        } elseif (!$isOverRefund) {
             $this->logger->error(sprintf(
                 'Skipping unexpected partial non-tip refund amount %s pence for donation %s based on charge ID %s',
killedBy: MatchBot\Tests\Application\Actions\Hooks\StripePaymentsUpdateTest::testOverRefundSendsSlackNoticeAndUpdatesRecord
statusReason: 1) MatchBot\Tests\Application\Actions\Hooks\StripePaymentsUpdateTest::testOverRefundSendsSlackNoticeAndUpdatesRecord
Failed asserting that two objects are equal.
--- Expected
+++ Actual
@@ @@
 MatchBot\Domain\DonationStatus Object (
-    'name' => 'Refunded'
-    'value' => 'Refunded'

[Killed] MethodCallRemoval
Application/Actions/Hooks/StripePaymentsUpdate.php:304:13
             assert($refundDate instanceof DateTimeImmutable);
             $donation->recordRefundAt($refundDate);
         } elseif ($isOverRefund) {
-            $this->warnAboutOverRefund(
-                'charge.refunded',
-                $donation,
-                $amountRefunded,
-                $charge->currency,
-            );
+            
 
             $this->logger->info(sprintf(
killedBy: MatchBot\Tests\Application\Actions\Hooks\StripePaymentsUpdateTest::testOverRefundSendsSlackNoticeAndUpdatesRecord
statusReason: 1) MatchBot\Tests\Application\Actions\Hooks\StripePaymentsUpdateTest::testOverRefundSendsSlackNoticeAndUpdatesRecord
Some predictions failed:
Double\StripeChatterInterface\P5:
  Expected exactly 1 calls that match:
      Double\StripeChatterInterface\P5->send(exact(Symfony\Component\Notifier\Message\ChatMessage#1905 Object (
        'transport' => null
        'subject' => 'Over-refund detected'

[Killed] MethodCallRemoval
Application/Actions/Hooks/StripePaymentsUpdate.php:311:13
                 $charge->currency,
             );
 
-            $this->logger->info(sprintf(
-                'Marking donation %s refunded (with extra) based on charge ID %s',
-                $donation->getUuid(),
-                $charge->id,
-            ));
+            
             $refundDate = DateTimeImmutable::createFromFormat('U', (string)$event->created);
             assert($refundDate instanceof DateTimeImmutable);
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

...............                                                   15 / 15 (100%)

Time: 00:00.109, Memory: 24.00 MB

OK (15 tests, 88 assertions)

[Killed] MethodCallRemoval
Application/Actions/Hooks/StripePaymentsUpdate.php:320:13
             assert($refundDate instanceof DateTimeImmutable);
             $donation->recordRefundAt($refundDate);
         } else {
-            $this->logger->error(sprintf(
-                'Skipping unexpected partial non-tip refund amount %s pence for donation %s based on charge ID %s',
-                $amountRefunded,
-                $donation->getUuid(),
-                $charge->id,
-            ));
+            
             $this->entityManager->rollback();
             return $this->respond($response, new ActionPayload(204));
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

...............                                                   15 / 15 (100%)

Time: 00:00.089, Memory: 24.00 MB

OK (15 tests, 88 assertions)

[Killed] LogicalOr
Application/Actions/Hooks/StripePaymentsUpdate.php:330:9
             return $this->respond($response, new ActionPayload(204));
         }
 
-        $this->doPostMarkRefundedUpdates($donation, $isFullRefund || $isOverRefund);
+        $this->doPostMarkRefundedUpdates($donation, $isFullRefund && $isOverRefund);
 
         return $this->respondWithData($response, $charge);
killedBy: MatchBot\Tests\Application\Actions\Hooks\StripePaymentsUpdateTest::testSuccessfulFullRefund
statusReason: 1) MatchBot\Tests\Application\Actions\Hooks\StripePaymentsUpdateTest::testSuccessfulFullRefund
Some predictions failed:
Double\MatchBot\Domain\DonationRepository\P4:
  Expected exactly 1 calls that match:
      Double\MatchBot\Domain\DonationRepository\P4->releaseMatchFunds(exact(MatchBot\Domain\Donation#1946 Object (
        'id' => null
        'salesforceId' => 'sfDonation369'
        'salesfor

[Killed] LogicalOrNegation
Application/Actions/Hooks/StripePaymentsUpdate.php:330:9
             return $this->respond($response, new ActionPayload(204));
         }
 
-        $this->doPostMarkRefundedUpdates($donation, $isFullRefund || $isOverRefund);
+        $this->doPostMarkRefundedUpdates($donation, !($isFullRefund || $isOverRefund));
 
         return $this->respondWithData($response, $charge);
killedBy: MatchBot\Tests\Application\Actions\Hooks\StripePaymentsUpdateTest::testSuccessfulFullRefund
statusReason: 1) MatchBot\Tests\Application\Actions\Hooks\StripePaymentsUpdateTest::testSuccessfulFullRefund
Some predictions failed:
Double\MatchBot\Domain\DonationRepository\P4:
  Expected exactly 1 calls that match:
      Double\MatchBot\Domain\DonationRepository\P4->releaseMatchFunds(exact(MatchBot\Domain\Donation#1946 Object (
        'id' => null
        'salesforceId' => 'sfDonation369'
        'salesfor

[NoCoverage] Identical
Application/Actions/Hooks/StripePaymentsUpdate.php:342:9
 
         $donation = $this->donationRepository->findOneBy(['transactionId' => $paymentIntent->id]);
 
-        if ($donation === null) {
+        if ($donation !== null) {
             if (getenv('APP_ENV') !== 'production') {
                 // outside of production we expect Stripe to combine things from multiple test environments

[NoCoverage] NotIdentical
Application/Actions/Hooks/StripePaymentsUpdate.php:343:13
         $donation = $this->donationRepository->findOneBy(['transactionId' => $paymentIntent->id]);
 
         if ($donation === null) {
-            if (getenv('APP_ENV') !== 'production') {
+            if (getenv('APP_ENV') === 'production') {
                 // outside of production we expect Stripe to combine things from multiple test environments
                 // (staging & regtest) into one, so we may get irrelevant cancellation requests. We don't want

[NoCoverage] IncrementInteger
Application/Actions/Hooks/StripePaymentsUpdate.php:347:17
                 // outside of production we expect Stripe to combine things from multiple test environments
                 // (staging & regtest) into one, so we may get irrelevant cancellation requests. We don't want
                 // them logged as errors.
-                return $this->respond($response, new ActionPayload(204));
+                return $this->respond($response, new ActionPayload(205));
             }
             return $this->respond($response, new ActionPayload(404));

[NoCoverage] DecrementInteger
Application/Actions/Hooks/StripePaymentsUpdate.php:347:17
                 // outside of production we expect Stripe to combine things from multiple test environments
                 // (staging & regtest) into one, so we may get irrelevant cancellation requests. We don't want
                 // them logged as errors.
-                return $this->respond($response, new ActionPayload(204));
+                return $this->respond($response, new ActionPayload(203));
             }
             return $this->respond($response, new ActionPayload(404));

[NoCoverage] IncrementInteger
Application/Actions/Hooks/StripePaymentsUpdate.php:349:13
                 // them logged as errors.
                 return $this->respond($response, new ActionPayload(204));
             }
-            return $this->respond($response, new ActionPayload(404));
+            return $this->respond($response, new ActionPayload(405));
         }
 

[NoCoverage] DecrementInteger
Application/Actions/Hooks/StripePaymentsUpdate.php:349:13
                 // them logged as errors.
                 return $this->respond($response, new ActionPayload(204));
             }
-            return $this->respond($response, new ActionPayload(404));
+            return $this->respond($response, new ActionPayload(403));
         }
 

[NoCoverage] Identical
Application/Actions/Hooks/StripePaymentsUpdate.php:352:9
             return $this->respond($response, new ActionPayload(404));
         }
 
-        if (DonationStatus::Cancelled === $donation->getDonationStatus()) {
+        if (DonationStatus::Cancelled !== $donation->getDonationStatus()) {
             return $this->respond($response, new ActionPayload(204, ['reason' => 'Donation is already cancelled']));
         }

[NoCoverage] IncrementInteger
Application/Actions/Hooks/StripePaymentsUpdate.php:353:13
         }
 
         if (DonationStatus::Cancelled === $donation->getDonationStatus()) {
-            return $this->respond($response, new ActionPayload(204, ['reason' => 'Donation is already cancelled']));
+            return $this->respond($response, new ActionPayload(205, ['reason' => 'Donation is already cancelled']));
         }
 

[NoCoverage] DecrementInteger
Application/Actions/Hooks/StripePaymentsUpdate.php:353:13
         }
 
         if (DonationStatus::Cancelled === $donation->getDonationStatus()) {
-            return $this->respond($response, new ActionPayload(204, ['reason' => 'Donation is already cancelled']));
+            return $this->respond($response, new ActionPayload(203, ['reason' => 'Donation is already cancelled']));
         }
 

[NoCoverage] MethodCallRemoval
Application/Actions/Hooks/StripePaymentsUpdate.php:356:9
             return $this->respond($response, new ActionPayload(204, ['reason' => 'Donation is already cancelled']));
         }
 
-        $this->logger->info(sprintf(
-            'Received Stripe cancellation request, Donation UUID %s, payment intent ID %s',
-            $donation->getUuid(),
-            $paymentIntent->id,
-        ));
+        
 
         try {

[NoCoverage] MethodCallRemoval
Application/Actions/Hooks/StripePaymentsUpdate.php:363:13
         ));
 
         try {
-            $donation->cancel();
+            
         } catch (\UnexpectedValueException) {
             return $this->respond($response, new ActionPayload(400));

[NoCoverage] IncrementInteger
Application/Actions/Hooks/StripePaymentsUpdate.php:365:13
         try {
             $donation->cancel();
         } catch (\UnexpectedValueException) {
-            return $this->respond($response, new ActionPayload(400));
+            return $this->respond($response, new ActionPayload(401));
         }
 

[NoCoverage] DecrementInteger
Application/Actions/Hooks/StripePaymentsUpdate.php:365:13
         try {
             $donation->cancel();
         } catch (\UnexpectedValueException) {
-            return $this->respond($response, new ActionPayload(400));
+            return $this->respond($response, new ActionPayload(399));
         }
 

[NoCoverage] FalseValue
Application/Actions/Hooks/StripePaymentsUpdate.php:369:9
         }
 
         $this->entityManager->flush();
-        $this->donationRepository->push($donation, false); // Attempt immediate sync to Salesforce
+        $this->donationRepository->push($donation, true);
 
         return $this->respond($response, new ActionPayload(200));

[NoCoverage] MethodCallRemoval
Application/Actions/Hooks/StripePaymentsUpdate.php:369:9
         }
 
         $this->entityManager->flush();
-        $this->donationRepository->push($donation, false); // Attempt immediate sync to Salesforce
+         // Attempt immediate sync to Salesforce
 
         return $this->respond($response, new ActionPayload(200));

[NoCoverage] IncrementInteger
Application/Actions/Hooks/StripePaymentsUpdate.php:371:9
         $this->entityManager->flush();
         $this->donationRepository->push($donation, false); // Attempt immediate sync to Salesforce
 
-        return $this->respond($response, new ActionPayload(200));
+        return $this->respond($response, new ActionPayload(201));
     }
 

[NoCoverage] DecrementInteger
Application/Actions/Hooks/StripePaymentsUpdate.php:371:9
         $this->entityManager->flush();
         $this->donationRepository->push($donation, false); // Attempt immediate sync to Salesforce
 
-        return $this->respond($response, new ActionPayload(200));
+        return $this->respond($response, new ActionPayload(199));
     }
 

[Killed] MethodCallRemoval
Application/Actions/Hooks/StripePaymentsUpdate.php:392:9
             bcdiv((string) $refundedOrDisputedAmount, '100', 2),
             strtoupper($refundedOrDisputedCurrencyCode),
         );
-        $this->logger->warning($detailsMessage);
+        
 
         $chatMessage = new ChatMessage('Over-refund detected');
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

...............                                                   15 / 15 (100%)

Time: 00:00.084, Memory: 24.00 MB

OK (15 tests, 88 assertions)

[Killed] MethodCallRemoval
Application/Actions/Hooks/StripePaymentsUpdate.php:403:9
             ))))
             ->block((new SlackSectionBlock())->text($detailsMessage))
             ->iconEmoji(':o');
-        $chatMessage->options($options);
+        
 
         $this->chatter->send($chatMessage);
killedBy: MatchBot\Tests\Application\Actions\Hooks\StripePaymentsUpdateTest::testDisputeLostWithAmountUnexpectedlyHighIsStillProcessedButAlertsSlack
statusReason: 1) MatchBot\Tests\Application\Actions\Hooks\StripePaymentsUpdateTest::testDisputeLostWithAmountUnexpectedlyHighIsStillProcessedButAlertsSlack
Prophecy\Exception\Call\UnexpectedCallException: Unexpected method call on Double\StripeChatterInterface\P3:
  - send(
        Symfony\Component\Notifier\Message\ChatMessage#1810 Object (
            'transport' => null
            'subject' => 'Over-refund

[Killed] MethodCallRemoval
Application/Actions/Hooks/StripePaymentsUpdate.php:405:9
             ->iconEmoji(':o');
         $chatMessage->options($options);
 
-        $this->chatter->send($chatMessage);
+        
     }
 
killedBy: MatchBot\Tests\Application\Actions\Hooks\StripePaymentsUpdateTest::testDisputeLostWithAmountUnexpectedlyHighIsStillProcessedButAlertsSlack
statusReason: 1) MatchBot\Tests\Application\Actions\Hooks\StripePaymentsUpdateTest::testDisputeLostWithAmountUnexpectedlyHighIsStillProcessedButAlertsSlack
Some predictions failed:
Double\StripeChatterInterface\P3:
  Expected exactly 1 calls that match:
      Double\StripeChatterInterface\P3->send(exact(Symfony\Component\Notifier\Message\ChatMessage#1905 Object (
        'transport' => null
        'subject' =>

[Killed] NotIdentical
Application/Actions/Hooks/StripePaymentsUpdate.php:412:9
     {
         $txn = $this->stripeClient->balanceTransactions->retrieve($balanceTransactionId);
 
-        if (count($txn->fee_details) !== 1) {
+        if (count($txn->fee_details) === 1) {
             $this->logger->warning(sprintf(
                 'StripeChargeUpdate::getFee: Unexpected composite fee with %d parts: %s',
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

...............                                                   15 / 15 (100%)

Time: 00:00.083, Memory: 24.00 MB

OK (15 tests, 88 assertions)

[Killed] IncrementInteger
Application/Actions/Hooks/StripePaymentsUpdate.php:412:9
     {
         $txn = $this->stripeClient->balanceTransactions->retrieve($balanceTransactionId);
 
-        if (count($txn->fee_details) !== 1) {
+        if (count($txn->fee_details) !== 2) {
             $this->logger->warning(sprintf(
                 'StripeChargeUpdate::getFee: Unexpected composite fee with %d parts: %s',
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

...............                                                   15 / 15 (100%)

Time: 00:00.084, Memory: 24.00 MB

OK (15 tests, 88 assertions)

[NoCoverage] MethodCallRemoval
Application/Actions/Hooks/StripePaymentsUpdate.php:413:13
         $txn = $this->stripeClient->balanceTransactions->retrieve($balanceTransactionId);
 
         if (count($txn->fee_details) !== 1) {
-            $this->logger->warning(sprintf(
-                'StripeChargeUpdate::getFee: Unexpected composite fee with %d parts: %s',
-                count($txn->fee_details),
-                json_encode($txn->fee_details),
-            ));
+            
         }
 

[Killed] IncrementInteger
Application/Actions/Hooks/StripePaymentsUpdate.php:420:9
             ));
         }
 
-        if ($txn->fee_details[0]->currency !== strtolower($expectedCurrencyCode)) {
+        if ($txn->fee_details[1]->currency !== strtolower($expectedCurrencyCode)) {
             // `fee` should presumably still be in parent account's currency, so don't bail out.
             $this->logger->warning(sprintf(
killedBy: MatchBot\Tests\Application\Actions\Hooks\StripePaymentsUpdateTest::testSuccessfulPayment
statusReason: 1) MatchBot\Tests\Application\Actions\Hooks\StripePaymentsUpdateTest::testSuccessfulPayment
Undefined array key 1

/home/barney/projects/matchbot/src/Application/Actions/Hooks/StripePaymentsUpdate.php:271
/home/barney/projects/matchbot/src/Application/Actions/Hooks/StripePaymentsUpdate.php:106
/home/barney/projects/matchbot/src/Application/Actions/Hooks/StripePaymentsUpdate.php:71
/home/barney/pro

[Killed] NotIdentical
Application/Actions/Hooks/StripePaymentsUpdate.php:420:9
             ));
         }
 
-        if ($txn->fee_details[0]->currency !== strtolower($expectedCurrencyCode)) {
+        if ($txn->fee_details[0]->currency === strtolower($expectedCurrencyCode)) {
             // `fee` should presumably still be in parent account's currency, so don't bail out.
             $this->logger->warning(sprintf(
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

...............                                                   15 / 15 (100%)

Time: 00:00.096, Memory: 24.00 MB

OK (15 tests, 88 assertions)
