[NoCoverage] MethodCallRemoval
Application/Actions/Hooks/StripePaymentsUpdate.php:422:13
 
         if ($txn->fee_details[0]->currency !== strtolower($expectedCurrencyCode)) {
             // `fee` should presumably still be in parent account's currency, so don't bail out.
-            $this->logger->warning(sprintf(
-                'StripeChargeUpdate::getFee: Unexpected fee currency %s',
-                $txn->fee_details[0]->currency,
-            ));
+            
         }
 

[NoCoverage] IncrementInteger
Application/Actions/Hooks/StripePaymentsUpdate.php:424:17
             // `fee` should presumably still be in parent account's currency, so don't bail out.
             $this->logger->warning(sprintf(
                 'StripeChargeUpdate::getFee: Unexpected fee currency %s',
-                $txn->fee_details[0]->currency,
+                $this->logger->warning(sprintf('StripeChargeUpdate::getFee: Unexpected fee currency %s', $txn->fee_details[1]->currency));
             ));
         }

[Killed] IncrementInteger
Application/Actions/Hooks/StripePaymentsUpdate.php:428:9
             ));
         }
 
-        if ($txn->fee_details[0]->type !== 'stripe_fee') {
+        if ($txn->fee_details[1]->type !== 'stripe_fee') {
             $this->logger->warning(sprintf(
                 'StripeChargeUpdate::getFee: Unexpected type %s',
killedBy: MatchBot\Tests\Application\Actions\Hooks\StripePaymentsUpdateTest::testSuccessfulPayment
statusReason: 1) MatchBot\Tests\Application\Actions\Hooks\StripePaymentsUpdateTest::testSuccessfulPayment
Undefined array key 1

/home/barney/projects/matchbot/src/Application/Actions/Hooks/StripePaymentsUpdate.php:275
/home/barney/projects/matchbot/src/Application/Actions/Hooks/StripePaymentsUpdate.php:106
/home/barney/projects/matchbot/src/Application/Actions/Hooks/StripePaymentsUpdate.php:71
/home/barney/pro

[Killed] NotIdentical
Application/Actions/Hooks/StripePaymentsUpdate.php:428:9
             ));
         }
 
-        if ($txn->fee_details[0]->type !== 'stripe_fee') {
+        if ($txn->fee_details[0]->type === 'stripe_fee') {
             $this->logger->warning(sprintf(
                 'StripeChargeUpdate::getFee: Unexpected type %s',
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

...............                                                   15 / 15 (100%)

Time: 00:00.106, Memory: 24.00 MB

OK (15 tests, 88 assertions)

[NoCoverage] MethodCallRemoval
Application/Actions/Hooks/StripePaymentsUpdate.php:429:13
         }
 
         if ($txn->fee_details[0]->type !== 'stripe_fee') {
-            $this->logger->warning(sprintf(
-                'StripeChargeUpdate::getFee: Unexpected type %s',
-                $txn->fee_details[0]->type,
-            ));
+            
         }
 

[NoCoverage] IncrementInteger
Application/Actions/Hooks/StripePaymentsUpdate.php:431:17
         if ($txn->fee_details[0]->type !== 'stripe_fee') {
             $this->logger->warning(sprintf(
                 'StripeChargeUpdate::getFee: Unexpected type %s',
-                $txn->fee_details[0]->type,
+                $this->logger->warning(sprintf('StripeChargeUpdate::getFee: Unexpected type %s', $txn->fee_details[1]->type));
             ));
         }

[Killed] MethodCallRemoval
Application/Actions/Hooks/StripePaymentsUpdate.php:449:9
      */
     private function doPostMarkRefundedUpdates(Donation $donation, bool $isCoreDonationReversed): void
     {
-        $this->entityManager->persist($donation);
+        
         $this->entityManager->flush();
         $this->entityManager->commit();
killedBy: MatchBot\Tests\Application\Actions\Hooks\StripePaymentsUpdateTest::testSuccessfulTipRefund
statusReason: 1) MatchBot\Tests\Application\Actions\Hooks\StripePaymentsUpdateTest::testSuccessfulTipRefund
Some predictions failed:
Double\EntityManagerInterface\P4:
  Expected exactly 1 calls that match:
      Double\EntityManagerInterface\P4->persist(type(MatchBot\Domain\Donation))
    but none were made.

/home/barney/projects/matchbot/vendor/phpspec/prophecy-phpunit/src/ProphecyTrait.php:61

[Killed] LogicalAnd
Application/Actions/Hooks/StripePaymentsUpdate.php:456:13
         // Release match funds only if the donation was matched and
         // the refunded amount is equal to the local txn amount.
         if (
-            $isCoreDonationReversed &&
-            $donation->getDonationStatus()->isReversed() &&
-            $donation->getCampaign()->isMatched()
+            if ($isCoreDonationReversed && $donation->getDonationStatus()->isReversed() || $donation->getCampaign()->isMatched()) {isMatched()
         ) {
             $this->donationRepository->releaseMatchFunds($donation);
killedBy: MatchBot\Tests\Application\Actions\Hooks\StripePaymentsUpdateTest::testSuccessfulTipRefund
statusReason: 1) MatchBot\Tests\Application\Actions\Hooks\StripePaymentsUpdateTest::testSuccessfulTipRefund
Some predictions failed:
Double\MatchBot\Domain\DonationRepository\P3:
  No calls expected that match:
      Double\MatchBot\Domain\DonationRepository\P3->releaseMatchFunds(exact(MatchBot\Domain\Donation#1885 Object (
        'id' => null
        'salesforceId' => 'sfDonation369'
        'salesforceLastPu

[Killed] LogicalAndAllSubExprNegation
Application/Actions/Hooks/StripePaymentsUpdate.php:456:13
         // Release match funds only if the donation was matched and
         // the refunded amount is equal to the local txn amount.
         if (
-            $isCoreDonationReversed &&
-            $donation->getDonationStatus()->isReversed() &&
-            $donation->getCampaign()->isMatched()
+            if (!$isCoreDonationReversed && !$donation->getDonationStatus()->isReversed() && !$donation->getCampaign()->isMatched()) {isMatched()
         ) {
             $this->donationRepository->releaseMatchFunds($donation);
killedBy: MatchBot\Tests\Application\Actions\Hooks\StripePaymentsUpdateTest::testDisputeLostBehavesLikeRefund
statusReason: 1) MatchBot\Tests\Application\Actions\Hooks\StripePaymentsUpdateTest::testDisputeLostBehavesLikeRefund
Some predictions failed:
Double\MatchBot\Domain\DonationRepository\P3:
  Expected exactly 1 calls that match:
      Double\MatchBot\Domain\DonationRepository\P3->releaseMatchFunds(exact(MatchBot\Domain\Donation#1946 Object (
        'id' => null
        'salesforceId' => 'sfDonation369'
        '

[Killed] MethodCallRemoval
Application/Actions/Hooks/StripePaymentsUpdate.php:460:13
             $donation->getDonationStatus()->isReversed() &&
             $donation->getCampaign()->isMatched()
         ) {
-            $this->donationRepository->releaseMatchFunds($donation);
+            
         }
 
killedBy: MatchBot\Tests\Application\Actions\Hooks\StripePaymentsUpdateTest::testDisputeLostBehavesLikeRefund
statusReason: 1) MatchBot\Tests\Application\Actions\Hooks\StripePaymentsUpdateTest::testDisputeLostBehavesLikeRefund
Some predictions failed:
Double\MatchBot\Domain\DonationRepository\P3:
  Expected exactly 1 calls that match:
      Double\MatchBot\Domain\DonationRepository\P3->releaseMatchFunds(exact(MatchBot\Domain\Donation#1946 Object (
        'id' => null
        'salesforceId' => 'sfDonation369'
        '

[Killed] FalseValue
Application/Actions/Hooks/StripePaymentsUpdate.php:463:9
             $this->donationRepository->releaseMatchFunds($donation);
         }
 
-        $this->donationRepository->push($donation, false); // Attempt immediate sync to Salesforce
+        $this->donationRepository->push($donation, true);
     }
 
killedBy: MatchBot\Tests\Application\Actions\Hooks\StripePaymentsUpdateTest::testDisputeLostBehavesLikeRefund
statusReason: 1) MatchBot\Tests\Application\Actions\Hooks\StripePaymentsUpdateTest::testDisputeLostBehavesLikeRefund
TypeError: Double\MatchBot\Domain\DonationRepository\P3::push(): Return value must be of type bool, null returned

/home/barney/projects/matchbot/src/Application/Actions/Hooks/StripePaymentsUpdate.php:299
/home/barney/projects/matchbot/src/Application/Actions/Hooks/StripePaymentsUpdate.php:169
/h

[Killed] MethodCallRemoval
Application/Actions/Hooks/StripePaymentsUpdate.php:463:9
             $this->donationRepository->releaseMatchFunds($donation);
         }
 
-        $this->donationRepository->push($donation, false); // Attempt immediate sync to Salesforce
+         // Attempt immediate sync to Salesforce
     }
 
killedBy: MatchBot\Tests\Application\Actions\Hooks\StripePaymentsUpdateTest::testDisputeLostBehavesLikeRefund
statusReason: 1) MatchBot\Tests\Application\Actions\Hooks\StripePaymentsUpdateTest::testDisputeLostBehavesLikeRefund
Some predictions failed:
Double\MatchBot\Domain\DonationRepository\P3:
  Expected exactly 1 calls that match:
      Double\MatchBot\Domain\DonationRepository\P3->push(type(MatchBot\Domain\Donation), exact(false))
    but none were made.

/home/barney/projects/matchbot/vendor/phpspec/prophecy-phpu

[NoCoverage] MethodCallRemoval
Application/Actions/Hooks/StripePaymentsUpdate.php:468:9
 
     private function handleCashBalanceUpdate(Event $event, Response $response): Response
     {
-        Assertion::eq('customer_cash_balance_transaction.created', $event->type);
+        
 
         /** @var array{customer: string, currency: string, net_amount: int, ending_balance: int, type: string} $webhookObject */

[NoCoverage] NotIdentical
Application/Actions/Hooks/StripePaymentsUpdate.php:475:9
 
         $stripeAccountId = StripeCustomerId::of($webhookObject['customer']);
 
-        if ($webhookObject['type'] !== 'funded') {
+        if ($webhookObject['type'] === 'funded') {
             return $this->respond($response, new ActionPayload(200));
         }

[NoCoverage] IncrementInteger
Application/Actions/Hooks/StripePaymentsUpdate.php:476:13
         $stripeAccountId = StripeCustomerId::of($webhookObject['customer']);
 
         if ($webhookObject['type'] !== 'funded') {
-            return $this->respond($response, new ActionPayload(200));
+            return $this->respond($response, new ActionPayload(201));
         }
 

[NoCoverage] DecrementInteger
Application/Actions/Hooks/StripePaymentsUpdate.php:476:13
         $stripeAccountId = StripeCustomerId::of($webhookObject['customer']);
 
         if ($webhookObject['type'] !== 'funded') {
-            return $this->respond($response, new ActionPayload(200));
+            return $this->respond($response, new ActionPayload(199));
         }
 

[NoCoverage] Identical
Application/Actions/Hooks/StripePaymentsUpdate.php:485:9
         $endingBalance = Money::fromPence($webhookObject['ending_balance'], $currency);
 
         $app_env = getenv('APP_ENV');
-        if ($donorAccount === null) {
+        if ($donorAccount !== null) {
             \assert(is_string($app_env));
             if ($app_env !== "regression" && $app_env !== "staging") {

[NoCoverage] LogicalAnd
Application/Actions/Hooks/StripePaymentsUpdate.php:487:13
         $app_env = getenv('APP_ENV');
         if ($donorAccount === null) {
             \assert(is_string($app_env));
-            if ($app_env !== "regression" && $app_env !== "staging") {
+            if ($app_env !== "regression" || $app_env !== "staging") {
                 // We expect the regression and staging environments to generate irrelevent webhooks to each other,
                 // so we don't need to notify Slack about the unexpected webhooks there.

[NoCoverage] LogicalAndNegation
Application/Actions/Hooks/StripePaymentsUpdate.php:487:13
         $app_env = getenv('APP_ENV');
         if ($donorAccount === null) {
             \assert(is_string($app_env));
-            if ($app_env !== "regression" && $app_env !== "staging") {
+            if (!($app_env !== "regression" && $app_env !== "staging")) {
                 // We expect the regression and staging environments to generate irrelevent webhooks to each other,
                 // so we don't need to notify Slack about the unexpected webhooks there.

[NoCoverage] MethodCallRemoval
Application/Actions/Hooks/StripePaymentsUpdate.php:490:17
             if ($app_env !== "regression" && $app_env !== "staging") {
                 // We expect the regression and staging environments to generate irrelevent webhooks to each other,
                 // so we don't need to notify Slack about the unexpected webhooks there.
-                $this->chatter->send(new ChatMessage(
-                    "$app_env: Cash Balance update received for unknown account: " . $stripeAccountId->stripeCustomerId
-                ));
+                
             }
 

[NoCoverage] ConcatOperandRemoval
Application/Actions/Hooks/StripePaymentsUpdate.php:491:21
                 // We expect the regression and staging environments to generate irrelevent webhooks to each other,
                 // so we don't need to notify Slack about the unexpected webhooks there.
                 $this->chatter->send(new ChatMessage(
-                    "$app_env: Cash Balance update received for unknown account: " . $stripeAccountId->stripeCustomerId
+                    $this->chatter->send(new ChatMessage($stripeAccountId->stripeCustomerId));
                 ));
             }

[NoCoverage] ConcatOperandRemoval
Application/Actions/Hooks/StripePaymentsUpdate.php:491:21
                 // We expect the regression and staging environments to generate irrelevent webhooks to each other,
                 // so we don't need to notify Slack about the unexpected webhooks there.
                 $this->chatter->send(new ChatMessage(
-                    "$app_env: Cash Balance update received for unknown account: " . $stripeAccountId->stripeCustomerId
+                    $this->chatter->send(new ChatMessage("{$app_env}: Cash Balance update received for unknown account: "));
                 ));
             }

[NoCoverage] MethodCallRemoval
Application/Actions/Hooks/StripePaymentsUpdate.php:498:9
             return $this->respond($response, new ActionPayload(200));
         }
 
-        $this->donationFundsNotifier->notifyRecieptOfAccountFunds($donorAccount, $transferAmount, $endingBalance);
+        
 
         $donorAccountId = $donorAccount->getId();

[NoCoverage] MethodCallRemoval
Application/Actions/Hooks/StripePaymentsUpdate.php:502:9
 
         $donorAccountId = $donorAccount->getId();
         \assert(is_int($donorAccountId)); // must be an int since it was persisted before.
-        $this->logger->info(
-            'Sent notification of receipt of account funds for Stripe Account: ' . $stripeAccountId->stripeCustomerId .
-            ", transfer Amount" . $transferAmount->format() .
-            ", new balance" . $endingBalance->format() .
-            ", DonorAccount #" . $donorAccountId
-        );
+        
 
         return $this->respond($response, new ActionPayload(200));
