[Killed] MethodCallRemoval
Application/Commands/ClaimGiftAid.php:29:9
         private EntityManagerInterface $entityManager,
         private RoutableMessageBus $bus,
     ) {
-        parent::__construct();
+        
     }
 
killedBy: MatchBot\Tests\Application\Commands\ClaimGiftAidTest::testNothingToSend
statusReason: 1) MatchBot\Tests\Application\Commands\ClaimGiftAidTest::testNothingToSend
Symfony\Component\Console\Exception\LogicException: Command class "MatchBot\Application\Commands\ClaimGiftAid" is not correctly initialized. You probably forgot to call the parent constructor.

/home/barney/projects/matchbot/vendor/symfony/console/Command/Command.php:449
/home/barney/projects/matchbot/vendor/symfony/console

[Survived] MethodCallRemoval
Application/Commands/ClaimGiftAid.php:34:9
 
     protected function configure(): void
     {
-        $this->setDescription('Sends applicable donations to ClaimBot for HMRC Gift Aid claims');
+        
         $this->addOption(
             'with-resends',

[Killed] MethodCallRemoval
Application/Commands/ClaimGiftAid.php:35:9
     protected function configure(): void
     {
         $this->setDescription('Sends applicable donations to ClaimBot for HMRC Gift Aid claims');
-        $this->addOption(
-            'with-resends',
-            null,
-            InputOption::VALUE_NONE,
-            'Tells the command to send donations again, even if they were queued before. Non-Production only',
-        );
+        
     }
 
killedBy: MatchBot\Tests\Application\Commands\ClaimGiftAidTest::testNothingToSend
statusReason: 1) MatchBot\Tests\Application\Commands\ClaimGiftAidTest::testNothingToSend
Symfony\Component\Console\Exception\InvalidArgumentException: The "with-resends" option does not exist.

/home/barney/projects/matchbot/vendor/symfony/console/Input/Input.php:140
/home/barney/projects/matchbot/src/Application/Commands/ClaimGiftAid.php:32
/home/barney/projects/matchbot/src/Application/Commands/LockingCommand

[Killed] LogicalNot
Application/Commands/ClaimGiftAid.php:46:13
     protected function doExecute(InputInterface $input, OutputInterface $output): int
     {
         $toClaim = $this->donationRepository->findReadyToClaimGiftAid(
-            !empty($input->getOption('with-resends')),
+            $toClaim = $this->donationRepository->findReadyToClaimGiftAid(empty($input->getOption('with-resends')));
         );
 
killedBy: MatchBot\Tests\Application\Commands\ClaimGiftAidTest::testNothingToSend
statusReason: 1) MatchBot\Tests\Application\Commands\ClaimGiftAidTest::testNothingToSend
TypeError: Double\MatchBot\Domain\DonationRepository\P1::findReadyToClaimGiftAid(): Return value must be of type array, null returned

/home/barney/projects/matchbot/src/Application/Commands/ClaimGiftAid.php:32
/home/barney/projects/matchbot/src/Application/Commands/LockingCommand.php:37
/home/barney/projects/matchbot/vendo

[Killed] GreaterThan
Application/Commands/ClaimGiftAid.php:49:9
             !empty($input->getOption('with-resends')),
         );
 
-        if (count($toClaim) > 0) {
+        if (count($toClaim) >= 0) {
             foreach ($toClaim as $donation) {
                 $stamps = [
killedBy: MatchBot\Tests\Application\Commands\ClaimGiftAidTest::testNothingToSend
statusReason: 1) MatchBot\Tests\Application\Commands\ClaimGiftAidTest::testNothingToSend
Some predictions failed:
Double\EntityManagerInterface\P2:
  No calls expected that match:
      Double\EntityManagerInterface\P2->flush()
    but 1 was made:
      - flush() @ src/Application/Commands/ClaimGiftAid.php:40

[Killed] GreaterThanNegotiation
Application/Commands/ClaimGiftAid.php:49:9
             !empty($input->getOption('with-resends')),
         );
 
-        if (count($toClaim) > 0) {
+        if (count($toClaim) <= 0) {
             foreach ($toClaim as $donation) {
                 $stamps = [
killedBy: MatchBot\Tests\Application\Commands\ClaimGiftAidTest::testNothingToSend
statusReason: 1) MatchBot\Tests\Application\Commands\ClaimGiftAidTest::testNothingToSend
Some predictions failed:
Double\EntityManagerInterface\P2:
  No calls expected that match:
      Double\EntityManagerInterface\P2->flush()
    but 1 was made:
      - flush() @ src/Application/Commands/ClaimGiftAid.php:40

[Killed] Foreach_
Application/Commands/ClaimGiftAid.php:50:13
         );
 
         if (count($toClaim) > 0) {
-            foreach ($toClaim as $donation) {
-                $stamps = [
-                    new BusNameStamp('claimbot.donation.claim'),
-                    new TransportMessageIdStamp("claimbot.donation.claim.{$donation->getUuid()}"),
-                ];
-                $this->bus->dispatch(new Envelope($donation->toClaimBotModel(), $stamps));
-
-                $donation->setTbgGiftAidRequestQueuedAt(new \DateTime());
-                $this->entityManager->persist($donation);
-            }
+            foreach (array() as $donation) {
 
             $this->entityManager->flush();
killedBy: MatchBot\Tests\Application\Commands\ClaimGiftAidTest::testSend
statusReason: 1) MatchBot\Tests\Application\Commands\ClaimGiftAidTest::testSend
Some predictions failed:
Double\EntityManagerInterface\P2:
  Expected exactly 1 calls that match:
      Double\EntityManagerInterface\P2->persist(exact(MatchBot\Domain\Donation#337 Object (
        'id' => null
        'salesforceId' => 'sfDonation369'
        'salesforceLastPush' => null

[Killed] ArrayItemRemoval
Application/Commands/ClaimGiftAid.php:51:17
 
         if (count($toClaim) > 0) {
             foreach ($toClaim as $donation) {
-                $stamps = [
-                    new BusNameStamp('claimbot.donation.claim'),
-                    new TransportMessageIdStamp("claimbot.donation.claim.{$donation->getUuid()}"),
-                ];
+                $stamps = [new TransportMessageIdStamp("claimbot.donation.claim.{$donation->getUuid()}")];
                 $this->bus->dispatch(new Envelope($donation->toClaimBotModel(), $stamps));
 
killedBy: MatchBot\Tests\Application\Commands\ClaimGiftAidTest::testSend
statusReason: 1) MatchBot\Tests\Application\Commands\ClaimGiftAidTest::testSend
TypeError: Double\Symfony\Component\Messenger\RoutableMessageBus\P3::dispatch(): Return value must be of type Symfony\Component\Messenger\Envelope, null returned

/home/barney/projects/matchbot/src/Application/Commands/ClaimGiftAid.php:36
/home/barney/projects/matchbot/src/Application/Commands/LockingCommand.php:37
/home/barney/proj

[Killed] MethodCallRemoval
Application/Commands/ClaimGiftAid.php:55:17
                     new BusNameStamp('claimbot.donation.claim'),
                     new TransportMessageIdStamp("claimbot.donation.claim.{$donation->getUuid()}"),
                 ];
-                $this->bus->dispatch(new Envelope($donation->toClaimBotModel(), $stamps));
+                
 
                 $donation->setTbgGiftAidRequestQueuedAt(new \DateTime());
killedBy: MatchBot\Tests\Application\Commands\ClaimGiftAidTest::testSend
statusReason: 1) MatchBot\Tests\Application\Commands\ClaimGiftAidTest::testSend
Some predictions failed:
Double\Symfony\Component\Messenger\RoutableMessageBus\P3:
  Expected exactly 1 calls that match:
      Double\Symfony\Component\Messenger\RoutableMessageBus\P3->dispatch(exact(Symfony\Component\Messenger\Envelope#267 Object (
        'stamps' => Array &0 (
            'Symfony\Component\Messenger\Stamp\BusNa

[Survived] MethodCallRemoval
Application/Commands/ClaimGiftAid.php:57:17
                 ];
                 $this->bus->dispatch(new Envelope($donation->toClaimBotModel(), $stamps));
 
-                $donation->setTbgGiftAidRequestQueuedAt(new \DateTime());
+                
                 $this->entityManager->persist($donation);
             }

[Killed] MethodCallRemoval
Application/Commands/ClaimGiftAid.php:58:17
                 $this->bus->dispatch(new Envelope($donation->toClaimBotModel(), $stamps));
 
                 $donation->setTbgGiftAidRequestQueuedAt(new \DateTime());
-                $this->entityManager->persist($donation);
+                
             }
 
killedBy: MatchBot\Tests\Application\Commands\ClaimGiftAidTest::testSend
statusReason: 1) MatchBot\Tests\Application\Commands\ClaimGiftAidTest::testSend
Some predictions failed:
Double\EntityManagerInterface\P2:
  Expected exactly 1 calls that match:
      Double\EntityManagerInterface\P2->persist(exact(MatchBot\Domain\Donation#337 Object (
        'id' => null
        'salesforceId' => 'sfDonation369'
        'salesforceLastPush' => null

[Killed] MethodCallRemoval
Application/Commands/ClaimGiftAid.php:65:9
         }
 
         $numberSent = count($toClaim);
-        $output->writeln("Submitted $numberSent donations to the ClaimBot queue");
+        
 
         return 0;
killedBy: MatchBot\Tests\Application\Commands\ClaimGiftAidTest::testNothingToSend
statusReason: 1) MatchBot\Tests\Application\Commands\ClaimGiftAidTest::testNothingToSend
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
 'matchbot:claim-gift-aid starting!\n
-Submitted 0 donations to the ClaimBot queue\n
 matchbot:claim-gift-aid complete!\n

[Killed] IncrementInteger
Application/Commands/ClaimGiftAid.php:67:9
         $numberSent = count($toClaim);
         $output->writeln("Submitted $numberSent donations to the ClaimBot queue");
 
-        return 0;
+        return 1;
     }
 }
killedBy: MatchBot\Tests\Application\Commands\ClaimGiftAidTest::testNothingToSend
statusReason: 1) MatchBot\Tests\Application\Commands\ClaimGiftAidTest::testNothingToSend
Failed asserting that 1 matches expected 0.

/home/barney/projects/matchbot/tests/Application/Commands/ClaimGiftAidTest.php:57

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.

[Killed] DecrementInteger
Application/Commands/ClaimGiftAid.php:67:9
         $numberSent = count($toClaim);
         $output->writeln("Submitted $numberSent donations to the ClaimBot queue");
 
-        return 0;
+        return -1;
     }
 }
killedBy: MatchBot\Tests\Application\Commands\ClaimGiftAidTest::testNothingToSend
statusReason: 1) MatchBot\Tests\Application\Commands\ClaimGiftAidTest::testNothingToSend
Failed asserting that -1 matches expected 0.

/home/barney/projects/matchbot/tests/Application/Commands/ClaimGiftAidTest.php:57

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.
