[Survived] MethodCallRemoval
Application/Commands/DeleteStalePaymentDetails.php:36:9
 
     protected function configure(): void
     {
-        $this->setDescription('Deletes unused and likely-non-customer-deletable payment methods from Stripe');
+        
     }
 

[Killed] DecrementInteger
Application/Commands/DeleteStalePaymentDetails.php:42:9
     protected function doExecute(InputInterface $input, OutputInterface $output): int
     {
         $startTime = microtime(true);
-        $customerCount = 0;
+        $customerCount = -1;
         $methodsDeleted = 0;
         $oneDayAgo = $this->initDate
killedBy: MatchBot\Tests\Application\Commands\DeleteStalePaymentDetailsTest::testDeletingOneStaleCard
statusReason: 1) MatchBot\Tests\Application\Commands\DeleteStalePaymentDetailsTest::testDeletingOneStaleCard
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
 'matchbot:delete-stale-payment-details starting!\n
-Deleted 1 payment methods from Stripe, having checked 1 customers. Time Taken: 0s\n
+Deleted 1 payment methods from Stripe, having checked 0 customers. Time Taken: 0s\n

[Killed] DecrementInteger
Application/Commands/DeleteStalePaymentDetails.php:43:9
     {
         $startTime = microtime(true);
         $customerCount = 0;
-        $methodsDeleted = 0;
+        $methodsDeleted = -1;
         $oneDayAgo = $this->initDate
             ->sub(new \DateInterval('P1D'))
killedBy: MatchBot\Tests\Application\Commands\DeleteStalePaymentDetailsTest::testDeletingOneStaleCard
statusReason: 1) MatchBot\Tests\Application\Commands\DeleteStalePaymentDetailsTest::testDeletingOneStaleCard
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
 'matchbot:delete-stale-payment-details starting!\n
-Deleted 1 payment methods from Stripe, having checked 1 customers. Time Taken: 0s\n
+Deleted 0 payment methods from Stripe, having checked 1 customers. Time Taken: 0s\n

[Killed] GreaterThanOrEqualToNegotiation
Application/Commands/DeleteStalePaymentDetails.php:57:13
         ]);
 
         foreach ($customers->autoPagingIterator() as $customer) {
-            if ($customerCount >= self::MAX_CUSTOMER_COUNT_TO_DETATCH_PER_RUN) {
+            if ($customerCount < self::MAX_CUSTOMER_COUNT_TO_DETATCH_PER_RUN) {
                 break;
             }
killedBy: MatchBot\Tests\Application\Commands\DeleteStalePaymentDetailsTest::testDeletingOneStaleCard
statusReason: 1) MatchBot\Tests\Application\Commands\DeleteStalePaymentDetailsTest::testDeletingOneStaleCard
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
 'matchbot:delete-stale-payment-details starting!\n
-Deleted 1 payment methods from Stripe, having checked 1 customers. Time Taken: 0s\n
+Deleted 0 payment methods from Stripe, having checked 0 customers. Time Taken: 0s\n

[Survived] GreaterThanOrEqualTo
Application/Commands/DeleteStalePaymentDetails.php:57:13
         ]);
 
         foreach ($customers->autoPagingIterator() as $customer) {
-            if ($customerCount >= self::MAX_CUSTOMER_COUNT_TO_DETATCH_PER_RUN) {
+            if ($customerCount > self::MAX_CUSTOMER_COUNT_TO_DETATCH_PER_RUN) {
                 break;
             }

[NoCoverage] Break_
Application/Commands/DeleteStalePaymentDetails.php:58:17
 
         foreach ($customers->autoPagingIterator() as $customer) {
             if ($customerCount >= self::MAX_CUSTOMER_COUNT_TO_DETATCH_PER_RUN) {
-                break;
+                continue;
             }
 

[Killed] Increment
Application/Commands/DeleteStalePaymentDetails.php:61:13
                 break;
             }
 
-            $customerCount++;
+            $customerCount--;
 
             // Get all *card* type payment methods for this customer – condition (3).
killedBy: MatchBot\Tests\Application\Commands\DeleteStalePaymentDetailsTest::testDeletingOneStaleCard
statusReason: 1) MatchBot\Tests\Application\Commands\DeleteStalePaymentDetailsTest::testDeletingOneStaleCard
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
 'matchbot:delete-stale-payment-details starting!\n
-Deleted 1 payment methods from Stripe, having checked 1 customers. Time Taken: 0s\n
+Deleted 1 payment methods from Stripe, having checked -1 customers. Time Taken: 0s\n

[Killed] ArrayItemRemoval
Application/Commands/DeleteStalePaymentDetails.php:64:13
             $customerCount++;
 
             // Get all *card* type payment methods for this customer – condition (3).
-            $paymentMethods = $this->stripeClient->paymentMethods->all([
-                'customer' => $customer->id,
-                'type' => 'card',
-                'limit' => static::STRIPE_PAGE_SIZE,
-            ]);
+            $paymentMethods = $this->stripeClient->paymentMethods->all(['type' => 'card', 'limit' => static::STRIPE_PAGE_SIZE]);
 
             foreach ($paymentMethods->autoPagingIterator() as $paymentMethod) {
killedBy: MatchBot\Tests\Application\Commands\DeleteStalePaymentDetailsTest::testDeletingOneStaleCard
statusReason: 1) MatchBot\Tests\Application\Commands\DeleteStalePaymentDetailsTest::testDeletingOneStaleCard
Error: Call to a member function autoPagingIterator() on null

/home/barney/projects/matchbot/src/Application/Commands/DeleteStalePaymentDetails.php:47
/home/barney/projects/matchbot/src/Application/Commands/LockingCommand.php:37
/home/barney/projects/matchbot/vendor/symfony/console/Command/Command.php:3

[Killed] Foreach_
Application/Commands/DeleteStalePaymentDetails.php:70:13
                 'limit' => static::STRIPE_PAGE_SIZE,
             ]);
 
-            foreach ($paymentMethods->autoPagingIterator() as $paymentMethod) {
-                // Soft-delete / prevent reuse of the payment method.
-                $this->logger->info(sprintf(
-                    'Detaching payment method %s, previously of customer %s',
-                    $paymentMethod->id,
-                    $customer->id,
-                ));
-                $this->stripeClient->paymentMethods->detach($paymentMethod->id);
-                $methodsDeleted++;
-            }
+            foreach (array() as $paymentMethod) {
 
             $this->stripeClient->customers->update(
killedBy: MatchBot\Tests\Application\Commands\DeleteStalePaymentDetailsTest::testDeletingOneStaleCard
statusReason: 1) MatchBot\Tests\Application\Commands\DeleteStalePaymentDetailsTest::testDeletingOneStaleCard
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
 'matchbot:delete-stale-payment-details starting!\n
-Deleted 1 payment methods from Stripe, having checked 1 customers. Time Taken: 0s\n
+Deleted 0 payment methods from Stripe, having checked 1 customers. Time Taken: 0s\n

[Survived] MethodCallRemoval
Application/Commands/DeleteStalePaymentDetails.php:72:17
 
             foreach ($paymentMethods->autoPagingIterator() as $paymentMethod) {
                 // Soft-delete / prevent reuse of the payment method.
-                $this->logger->info(sprintf(
-                    'Detaching payment method %s, previously of customer %s',
-                    $paymentMethod->id,
-                    $customer->id,
-                ));
+                
                 $this->stripeClient->paymentMethods->detach($paymentMethod->id);
                 $methodsDeleted++;

[Killed] MethodCallRemoval
Application/Commands/DeleteStalePaymentDetails.php:77:17
                     $paymentMethod->id,
                     $customer->id,
                 ));
-                $this->stripeClient->paymentMethods->detach($paymentMethod->id);
+                
                 $methodsDeleted++;
             }
killedBy: MatchBot\Tests\Application\Commands\DeleteStalePaymentDetailsTest::testDeletingOneStaleCard
statusReason: 1) MatchBot\Tests\Application\Commands\DeleteStalePaymentDetailsTest::testDeletingOneStaleCard
Some predictions failed:
Double\Stripe\Service\PaymentMethodService\P1:
  Expected exactly 1 calls that match:
      Double\Stripe\Service\PaymentMethodService\P1->detach(exact("pm_aaaaaaaaaaaa13"))
    but none were made.

/home/barney/projects/matchbot/vendor/phpspec/prophecy-phpunit/src/ProphecyTrait.

[Killed] Increment
Application/Commands/DeleteStalePaymentDetails.php:78:17
                     $customer->id,
                 ));
                 $this->stripeClient->paymentMethods->detach($paymentMethod->id);
-                $methodsDeleted++;
+                $methodsDeleted--;
             }
 
killedBy: MatchBot\Tests\Application\Commands\DeleteStalePaymentDetailsTest::testDeletingOneStaleCard
statusReason: 1) MatchBot\Tests\Application\Commands\DeleteStalePaymentDetailsTest::testDeletingOneStaleCard
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
 'matchbot:delete-stale-payment-details starting!\n
-Deleted 1 payment methods from Stripe, having checked 1 customers. Time Taken: 0s\n
+Deleted -1 payment methods from Stripe, having checked 1 customers. Time Taken: 0s\n

[Killed] MethodCallRemoval
Application/Commands/DeleteStalePaymentDetails.php:81:13
                 $methodsDeleted++;
             }
 
-            $this->stripeClient->customers->update(
-                $customer->id,
-                ['metadata' => ['paymentMethodsCleared' => $this->initDate->format('Y-m-d H:i:s')]]
-            );
+            
         }
 
killedBy: MatchBot\Tests\Application\Commands\DeleteStalePaymentDetailsTest::testDeletingOneStaleCard
statusReason: 1) MatchBot\Tests\Application\Commands\DeleteStalePaymentDetailsTest::testDeletingOneStaleCard
Some predictions failed:
Double\Stripe\Service\CustomerService\P3:
  Expected exactly 1 calls that match:
      Double\Stripe\Service\CustomerService\P3->update(exact("cus_aaaaaaaaaaaa11"), exact(["metadata" => ["paymentMethodsCleared" => "2023-04-10 00:00:00"]]))
    but none were made.

/home/barney/pr

[Killed] ArrayItem
Application/Commands/DeleteStalePaymentDetails.php:83:17
 
             $this->stripeClient->customers->update(
                 $customer->id,
-                ['metadata' => ['paymentMethodsCleared' => $this->initDate->format('Y-m-d H:i:s')]]
+                $this->stripeClient->customers->update($customer->id, ['metadata' => ['paymentMethodsCleared' > $this->initDate->format('Y-m-d H:i:s')]]);
             );
         }
killedBy: MatchBot\Tests\Application\Commands\DeleteStalePaymentDetailsTest::testDeletingOneStaleCard
statusReason: 1) MatchBot\Tests\Application\Commands\DeleteStalePaymentDetailsTest::testDeletingOneStaleCard
Prophecy\Exception\Call\UnexpectedCallException: Unexpected method call on Double\Stripe\Service\CustomerService\P3:
  - update(
        "cus_aaaaaaaaaaaa11",
        ["metadata" => [true]]
    )
expected calls were:
  - search(

[Killed] Minus
Application/Commands/DeleteStalePaymentDetails.php:87:9
             );
         }
 
-        $timeTaken = microtime(true) - $startTime;
+        $timeTaken = microtime(true) + $startTime;
         $timeTaken = round($timeTaken, 2);
 
killedBy: MatchBot\Tests\Application\Commands\DeleteStalePaymentDetailsTest::testDeletingOneStaleCard
statusReason: 1) MatchBot\Tests\Application\Commands\DeleteStalePaymentDetailsTest::testDeletingOneStaleCard
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
 'matchbot:delete-stale-payment-details starting!\n
-Deleted 1 payment methods from Stripe, having checked 1 customers. Time Taken: 0s\n
+Deleted 1 payment methods from Stripe, having checked 1 customers. Time Taken: 3397772780.68

[Killed] RoundingFamily
Application/Commands/DeleteStalePaymentDetails.php:88:9
         }
 
         $timeTaken = microtime(true) - $startTime;
-        $timeTaken = round($timeTaken, 2);
+        $timeTaken = ceil($timeTaken);
 
         $output->writeln("Deleted $methodsDeleted payment methods from Stripe, having checked $customerCount customers. Time Taken: {$timeTaken}s");
killedBy: MatchBot\Tests\Application\Commands\DeleteStalePaymentDetailsTest::testDeletingOneStaleCard
statusReason: 1) MatchBot\Tests\Application\Commands\DeleteStalePaymentDetailsTest::testDeletingOneStaleCard
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
 'matchbot:delete-stale-payment-details starting!\n
-Deleted 1 payment methods from Stripe, having checked 1 customers. Time Taken: 0s\n
+Deleted 1 payment methods from Stripe, having checked 1 customers. Time Taken: 1s\n

[Survived] IncrementInteger
Application/Commands/DeleteStalePaymentDetails.php:88:9
         }
 
         $timeTaken = microtime(true) - $startTime;
-        $timeTaken = round($timeTaken, 2);
+        $timeTaken = round($timeTaken, 3);
 
         $output->writeln("Deleted $methodsDeleted payment methods from Stripe, having checked $customerCount customers. Time Taken: {$timeTaken}s");

[Killed] MethodCallRemoval
Application/Commands/DeleteStalePaymentDetails.php:90:9
         $timeTaken = microtime(true) - $startTime;
         $timeTaken = round($timeTaken, 2);
 
-        $output->writeln("Deleted $methodsDeleted payment methods from Stripe, having checked $customerCount customers. Time Taken: {$timeTaken}s");
+        
 
         return 0;
killedBy: MatchBot\Tests\Application\Commands\DeleteStalePaymentDetailsTest::testDeletingOneStaleCard
statusReason: 1) MatchBot\Tests\Application\Commands\DeleteStalePaymentDetailsTest::testDeletingOneStaleCard
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
 'matchbot:delete-stale-payment-details starting!\n
-Deleted 1 payment methods from Stripe, having checked 1 customers. Time Taken: 0s\n
 matchbot:delete-stale-payment-details complete!\n
