[Killed] MethodCallRemoval
Application/Commands/HandleOutOfSyncFunds.php:49:9
 
     protected function configure(): void
     {
-        $this->setDescription("Tries to match every fund's amount available to its FundingWithdrawals' total");
+        
         $this->addArgument(
             'mode',
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

....                                                                4 / 4 (100%)

Time: 00:00.027, Memory: 14.00 MB

OK (4 tests, 28 assertions)

[Killed] MethodCallRemoval
Application/Commands/HandleOutOfSyncFunds.php:50:9
     protected function configure(): void
     {
         $this->setDescription("Tries to match every fund's amount available to its FundingWithdrawals' total");
-        $this->addArgument(
-            'mode',
-            InputArgument::REQUIRED,
-            '"check" to print status information only or "fix" to attempt to restore over-allocated funds.'
-        );
+        
     }
 
killedBy: MatchBot\Tests\Application\Commands\HandleOutOfSyncFundsTest::testCheck
statusReason: 1) MatchBot\Tests\Application\Commands\HandleOutOfSyncFundsTest::testCheck
Symfony\Component\Console\Exception\InvalidArgumentException: The "mode" argument does not exist.

/home/barney/projects/matchbot/vendor/symfony/console/Input/ArrayInput.php:191
/home/barney/projects/matchbot/vendor/symfony/console/Input/ArrayInput.php:130
/home/barney/projects/matchbot/vendor/symfony/console/Input/Input.ph

[Killed] LogicalNot
Application/Commands/HandleOutOfSyncFunds.php:64:9
     protected function doExecute(InputInterface $input, OutputInterface $output): int
     {
         $mode = $input->getArgument('mode');
-        if (!in_array($mode, ['check', 'fix'], true)) {
+        if (in_array($mode, ['check', 'fix'], true)) {
             $output->writeln('Please set the mode to "check" or "fix"');
             return 1;
killedBy: MatchBot\Tests\Application\Commands\HandleOutOfSyncFundsTest::testCheck
statusReason: 1) MatchBot\Tests\Application\Commands\HandleOutOfSyncFundsTest::testCheck
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
 'matchbot:handle-out-of-sync-funds starting!\n
-Funding 2 is over-matched by 10.00. Donation withdrawals 51.00, funding allocations 41.00\n
-Funding 3 is under-matched by 30.00. Donation withdrawals 500.00, funding allocations 530.00\n

[Killed] MethodCallRemoval
Application/Commands/HandleOutOfSyncFunds.php:65:13
     {
         $mode = $input->getArgument('mode');
         if (!in_array($mode, ['check', 'fix'], true)) {
-            $output->writeln('Please set the mode to "check" or "fix"');
+            
             return 1;
         }
killedBy: MatchBot\Tests\Application\Commands\HandleOutOfSyncFundsTest::testWithModeInvalid
statusReason: 1) MatchBot\Tests\Application\Commands\HandleOutOfSyncFundsTest::testWithModeInvalid
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
 'matchbot:handle-out-of-sync-funds starting!\n
-Please set the mode to "check" or "fix"\n
 matchbot:handle-out-of-sync-funds complete!\n

[Killed] IncrementInteger
Application/Commands/HandleOutOfSyncFunds.php:66:13
         $mode = $input->getArgument('mode');
         if (!in_array($mode, ['check', 'fix'], true)) {
             $output->writeln('Please set the mode to "check" or "fix"');
-            return 1;
+            return 2;
         }
 
killedBy: MatchBot\Tests\Application\Commands\HandleOutOfSyncFundsTest::testWithModeInvalid
statusReason: 1) MatchBot\Tests\Application\Commands\HandleOutOfSyncFundsTest::testWithModeInvalid
Failed asserting that 2 matches expected 1.

/home/barney/projects/matchbot/tests/Application/Commands/HandleOutOfSyncFundsTest.php:112

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.

[Killed] IntegerNegation
Application/Commands/HandleOutOfSyncFunds.php:66:13
         $mode = $input->getArgument('mode');
         if (!in_array($mode, ['check', 'fix'], true)) {
             $output->writeln('Please set the mode to "check" or "fix"');
-            return 1;
+            return -1;
         }
 
killedBy: MatchBot\Tests\Application\Commands\HandleOutOfSyncFundsTest::testWithModeInvalid
statusReason: 1) MatchBot\Tests\Application\Commands\HandleOutOfSyncFundsTest::testWithModeInvalid
Failed asserting that -1 matches expected 1.

/home/barney/projects/matchbot/tests/Application/Commands/HandleOutOfSyncFundsTest.php:112

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.

[NoCoverage] IncrementInteger
Application/Commands/HandleOutOfSyncFunds.php:71:13
 
         $excludedFundingIds = [];
         if ($excludeJson = getenv('KNOWN_OVERMATCHED_FUNDING_IDS')) {
-            $excludedFundingIds = json_decode($excludeJson, true, 512, JSON_THROW_ON_ERROR);
+            $excludedFundingIds = json_decode($excludeJson, true, 513, JSON_THROW_ON_ERROR);
         }
 

[NoCoverage] DecrementInteger
Application/Commands/HandleOutOfSyncFunds.php:71:13
 
         $excludedFundingIds = [];
         if ($excludeJson = getenv('KNOWN_OVERMATCHED_FUNDING_IDS')) {
-            $excludedFundingIds = json_decode($excludeJson, true, 512, JSON_THROW_ON_ERROR);
+            $excludedFundingIds = json_decode($excludeJson, true, 511, JSON_THROW_ON_ERROR);
         }
 

[Killed] DecrementInteger
Application/Commands/HandleOutOfSyncFunds.php:74:9
             $excludedFundingIds = json_decode($excludeJson, true, 512, JSON_THROW_ON_ERROR);
         }
 
-        $numFundingsCorrect = 0;
+        $numFundingsCorrect = -1;
         $numFundingsOvermatched = 0;
         $numFundingsUndermatched = 0;
killedBy: MatchBot\Tests\Application\Commands\HandleOutOfSyncFundsTest::testCheck
statusReason: 1) MatchBot\Tests\Application\Commands\HandleOutOfSyncFundsTest::testCheck
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
 Funding 2 is over-matched by 10.00. Donation withdrawals 51.00, funding allocations 41.00\n
 Funding 3 is under-matched by 30.00. Donation withdrawals 500.00, funding allocations 530.00\n
 Funding 4 is under-matched by 0.01. Donation withdrawals 0.0

[Killed] DecrementInteger
Application/Commands/HandleOutOfSyncFunds.php:75:9
         }
 
         $numFundingsCorrect = 0;
-        $numFundingsOvermatched = 0;
+        $numFundingsOvermatched = -1;
         $numFundingsUndermatched = 0;
         /** @var CampaignFunding[] $fundings */
killedBy: MatchBot\Tests\Application\Commands\HandleOutOfSyncFundsTest::testCheck
statusReason: 1) MatchBot\Tests\Application\Commands\HandleOutOfSyncFundsTest::testCheck
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
 Funding 2 is over-matched by 10.00. Donation withdrawals 51.00, funding allocations 41.00\n
 Funding 3 is under-matched by 30.00. Donation withdrawals 500.00, funding allocations 530.00\n
 Funding 4 is under-matched by 0.01. Donation withdrawals 0.0

[Killed] DecrementInteger
Application/Commands/HandleOutOfSyncFunds.php:76:9
 
         $numFundingsCorrect = 0;
         $numFundingsOvermatched = 0;
-        $numFundingsUndermatched = 0;
+        $numFundingsUndermatched = -1;
         /** @var CampaignFunding[] $fundings */
         $fundings = $this->campaignFundingRepository->findAll();
killedBy: MatchBot\Tests\Application\Commands\HandleOutOfSyncFundsTest::testCheck
statusReason: 1) MatchBot\Tests\Application\Commands\HandleOutOfSyncFundsTest::testCheck
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
 Funding 2 is over-matched by 10.00. Donation withdrawals 51.00, funding allocations 41.00\n
 Funding 3 is under-matched by 30.00. Donation withdrawals 500.00, funding allocations 530.00\n
 Funding 4 is under-matched by 0.01. Donation withdrawals 0.0

[Killed] IfNegation
Application/Commands/HandleOutOfSyncFunds.php:82:13
         $numFundings = count($fundings);
 
         foreach ($fundings as $funding) {
-            if (in_array($funding->getId(), $excludedFundingIds, true)) {
-                continue;
-            }
+            if (!in_array($funding->getId(), $excludedFundingIds, true)) {
 
             // Amount allocated from the CampaignFunding
killedBy: MatchBot\Tests\Application\Commands\HandleOutOfSyncFundsTest::testCheck
statusReason: 1) MatchBot\Tests\Application\Commands\HandleOutOfSyncFundsTest::testCheck
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
 'matchbot:handle-out-of-sync-funds starting!\n
-Funding 2 is over-matched by 10.00. Donation withdrawals 51.00, funding allocations 41.00\n
-Funding 3 is under-matched by 30.00. Donation withdrawals 500.00, funding allocations 530.00\n

[NoCoverage] Continue_
Application/Commands/HandleOutOfSyncFunds.php:83:17
 
         foreach ($fundings as $funding) {
             if (in_array($funding->getId(), $excludedFundingIds, true)) {
-                continue;
+                break;
             }
 

[Killed] DecrementInteger
Application/Commands/HandleOutOfSyncFunds.php:88:13
 
             // Amount allocated from the CampaignFunding
             $fundingAvailable = $this->matchingAdapter->getAmountAvailable($funding);
-            $campaignFundingAllocated = bcsub($funding->getAmount(), $fundingAvailable, 2);
+            $campaignFundingAllocated = bcsub($funding->getAmount(), $fundingAvailable, 1);
 
             // Get the sum of all FundingWithdrawals for donations, whether complete or active reservations.
killedBy: MatchBot\Tests\Application\Commands\HandleOutOfSyncFundsTest::testCheck
statusReason: 1) MatchBot\Tests\Application\Commands\HandleOutOfSyncFundsTest::testCheck
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
 'matchbot:handle-out-of-sync-funds starting!\n
-Funding 2 is over-matched by 10.00. Donation withdrawals 51.00, funding allocations 41.00\n
-Funding 3 is under-matched by 30.00. Donation withdrawals 500.00, funding allocations 530.00\n

[Killed] BCMath
Application/Commands/HandleOutOfSyncFunds.php:88:13
 
             // Amount allocated from the CampaignFunding
             $fundingAvailable = $this->matchingAdapter->getAmountAvailable($funding);
-            $campaignFundingAllocated = bcsub($funding->getAmount(), $fundingAvailable, 2);
+            $campaignFundingAllocated = (string) ($funding->getAmount() - $fundingAvailable);
 
             // Get the sum of all FundingWithdrawals for donations, whether complete or active reservations.
killedBy: MatchBot\Tests\Application\Commands\HandleOutOfSyncFundsTest::testCheck
statusReason: 1) MatchBot\Tests\Application\Commands\HandleOutOfSyncFundsTest::testCheck
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
 'matchbot:handle-out-of-sync-funds starting!\n
-Funding 2 is over-matched by 10.00. Donation withdrawals 51.00, funding allocations 41.00\n
-Funding 3 is under-matched by 30.00. Donation withdrawals 500.00, funding allocations 530.00\n

[Killed] IncrementInteger
Application/Commands/HandleOutOfSyncFunds.php:93:13
             // Get the sum of all FundingWithdrawals for donations, whether complete or active reservations.
             $fundingWithdrawalTotal = $this->fundingWithdrawalRepository->getWithdrawalsTotal($funding);
 
-            $comparison = bccomp($campaignFundingAllocated, $fundingWithdrawalTotal, 2);
+            $comparison = bccomp($campaignFundingAllocated, $fundingWithdrawalTotal, 3);
 
             if ($comparison === 0) {
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

....                                                                4 / 4 (100%)

Time: 00:00.031, Memory: 14.00 MB

OK (4 tests, 28 assertions)

[Killed] DecrementInteger
Application/Commands/HandleOutOfSyncFunds.php:93:13
             // Get the sum of all FundingWithdrawals for donations, whether complete or active reservations.
             $fundingWithdrawalTotal = $this->fundingWithdrawalRepository->getWithdrawalsTotal($funding);
 
-            $comparison = bccomp($campaignFundingAllocated, $fundingWithdrawalTotal, 2);
+            $comparison = bccomp($campaignFundingAllocated, $fundingWithdrawalTotal, 1);
 
             if ($comparison === 0) {
killedBy: MatchBot\Tests\Application\Commands\HandleOutOfSyncFundsTest::testCheck
statusReason: 1) MatchBot\Tests\Application\Commands\HandleOutOfSyncFundsTest::testCheck
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
 'matchbot:handle-out-of-sync-funds starting!\n
 Funding 2 is over-matched by 10.00. Donation withdrawals 51.00, funding allocations 41.00\n
 Funding 3 is under-matched by 30.00. Donation withdrawals 500.00, funding allocations 530.00\n

[Killed] DecrementInteger
Application/Commands/HandleOutOfSyncFunds.php:95:13
 
             $comparison = bccomp($campaignFundingAllocated, $fundingWithdrawalTotal, 2);
 
-            if ($comparison === 0) {
+            if ($comparison === -1) {
                 // If they match, add to the OK campaigns total
                 $numFundingsCorrect++;
killedBy: MatchBot\Tests\Application\Commands\HandleOutOfSyncFundsTest::testCheck
statusReason: 1) MatchBot\Tests\Application\Commands\HandleOutOfSyncFundsTest::testCheck
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
 'matchbot:handle-out-of-sync-funds starting!\n
-Funding 2 is over-matched by 10.00. Donation withdrawals 51.00, funding allocations 41.00\n
+Funding 1 is under-matched by 0.00. Donation withdrawals 43.44, funding allocations 43.44\n

[Killed] Identical
Application/Commands/HandleOutOfSyncFunds.php:95:13
 
             $comparison = bccomp($campaignFundingAllocated, $fundingWithdrawalTotal, 2);
 
-            if ($comparison === 0) {
+            if ($comparison !== 0) {
                 // If they match, add to the OK campaigns total
                 $numFundingsCorrect++;
killedBy: MatchBot\Tests\Application\Commands\HandleOutOfSyncFundsTest::testCheck
statusReason: 1) MatchBot\Tests\Application\Commands\HandleOutOfSyncFundsTest::testCheck
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
 'matchbot:handle-out-of-sync-funds starting!\n
-Funding 2 is over-matched by 10.00. Donation withdrawals 51.00, funding allocations 41.00\n
-Funding 3 is under-matched by 30.00. Donation withdrawals 500.00, funding allocations 530.00\n

[Killed] Increment
Application/Commands/HandleOutOfSyncFunds.php:97:17
 
             if ($comparison === 0) {
                 // If they match, add to the OK campaigns total
-                $numFundingsCorrect++;
+                $numFundingsCorrect--;
                 continue;
             }
killedBy: MatchBot\Tests\Application\Commands\HandleOutOfSyncFundsTest::testCheck
statusReason: 1) MatchBot\Tests\Application\Commands\HandleOutOfSyncFundsTest::testCheck
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
 Funding 2 is over-matched by 10.00. Donation withdrawals 51.00, funding allocations 41.00\n
 Funding 3 is under-matched by 30.00. Donation withdrawals 500.00, funding allocations 530.00\n
 Funding 4 is under-matched by 0.01. Donation withdrawals 0.0

[Killed] Continue_
Application/Commands/HandleOutOfSyncFunds.php:98:17
             if ($comparison === 0) {
                 // If they match, add to the OK campaigns total
                 $numFundingsCorrect++;
-                continue;
+                break;
             }
 
killedBy: MatchBot\Tests\Application\Commands\HandleOutOfSyncFundsTest::testCheck
statusReason: 1) MatchBot\Tests\Application\Commands\HandleOutOfSyncFundsTest::testCheck
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
 'matchbot:handle-out-of-sync-funds starting!\n
-Funding 2 is over-matched by 10.00. Donation withdrawals 51.00, funding allocations 41.00\n
-Funding 3 is under-matched by 30.00. Donation withdrawals 500.00, funding allocations 530.00\n

[Killed] IncrementInteger
Application/Commands/HandleOutOfSyncFunds.php:104:13
             // If the sum of FundingWithdrawals is larger, log and count the over-match. No action can safely auto-fix
             // this.
             $details = "Donation withdrawals $fundingWithdrawalTotal, funding allocations $campaignFundingAllocated";
-            if ($comparison === -1) {
+            if ($comparison === -0) {
                 $numFundingsOvermatched++;
                 $overmatchAmount = bcsub($fundingWithdrawalTotal, $campaignFundingAllocated, 2);
killedBy: MatchBot\Tests\Application\Commands\HandleOutOfSyncFundsTest::testCheck
statusReason: 1) MatchBot\Tests\Application\Commands\HandleOutOfSyncFundsTest::testCheck
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
 'matchbot:handle-out-of-sync-funds starting!\n
-Funding 2 is over-matched by 10.00. Donation withdrawals 51.00, funding allocations 41.00\n
+Funding 2 is under-matched by -10.00. Donation withdrawals 51.00, funding allocations 41.00\n

[Killed] Identical
Application/Commands/HandleOutOfSyncFunds.php:104:13
             // If the sum of FundingWithdrawals is larger, log and count the over-match. No action can safely auto-fix
             // this.
             $details = "Donation withdrawals $fundingWithdrawalTotal, funding allocations $campaignFundingAllocated";
-            if ($comparison === -1) {
+            if ($comparison !== -1) {
                 $numFundingsOvermatched++;
                 $overmatchAmount = bcsub($fundingWithdrawalTotal, $campaignFundingAllocated, 2);
killedBy: MatchBot\Tests\Application\Commands\HandleOutOfSyncFundsTest::testCheck
statusReason: 1) MatchBot\Tests\Application\Commands\HandleOutOfSyncFundsTest::testCheck
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
 'matchbot:handle-out-of-sync-funds starting!\n
-Funding 2 is over-matched by 10.00. Donation withdrawals 51.00, funding allocations 41.00\n
-Funding 3 is under-matched by 30.00. Donation withdrawals 500.00, funding allocations 530.00\n

[Killed] Increment
Application/Commands/HandleOutOfSyncFunds.php:105:17
             // this.
             $details = "Donation withdrawals $fundingWithdrawalTotal, funding allocations $campaignFundingAllocated";
             if ($comparison === -1) {
-                $numFundingsOvermatched++;
+                $numFundingsOvermatched--;
                 $overmatchAmount = bcsub($fundingWithdrawalTotal, $campaignFundingAllocated, 2);
                 $output->writeln("Funding {$funding->getId()} is over-matched by $overmatchAmount. $details");
killedBy: MatchBot\Tests\Application\Commands\HandleOutOfSyncFundsTest::testCheck
statusReason: 1) MatchBot\Tests\Application\Commands\HandleOutOfSyncFundsTest::testCheck
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
 Funding 2 is over-matched by 10.00. Donation withdrawals 51.00, funding allocations 41.00\n
 Funding 3 is under-matched by 30.00. Donation withdrawals 500.00, funding allocations 530.00\n
 Funding 4 is under-matched by 0.01. Donation withdrawals 0.0

[Killed] BCMath
Application/Commands/HandleOutOfSyncFunds.php:106:17
             $details = "Donation withdrawals $fundingWithdrawalTotal, funding allocations $campaignFundingAllocated";
             if ($comparison === -1) {
                 $numFundingsOvermatched++;
-                $overmatchAmount = bcsub($fundingWithdrawalTotal, $campaignFundingAllocated, 2);
+                $overmatchAmount = (string) ($fundingWithdrawalTotal - $campaignFundingAllocated);
                 $output->writeln("Funding {$funding->getId()} is over-matched by $overmatchAmount. $details");
                 continue;
killedBy: MatchBot\Tests\Application\Commands\HandleOutOfSyncFundsTest::testCheck
statusReason: 1) MatchBot\Tests\Application\Commands\HandleOutOfSyncFundsTest::testCheck
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
 'matchbot:handle-out-of-sync-funds starting!\n
-Funding 2 is over-matched by 10.00. Donation withdrawals 51.00, funding allocations 41.00\n
+Funding 2 is over-matched by 10. Donation withdrawals 51.00, funding allocations 41.00\n

[Killed] IncrementInteger
Application/Commands/HandleOutOfSyncFunds.php:106:17
             $details = "Donation withdrawals $fundingWithdrawalTotal, funding allocations $campaignFundingAllocated";
             if ($comparison === -1) {
                 $numFundingsOvermatched++;
-                $overmatchAmount = bcsub($fundingWithdrawalTotal, $campaignFundingAllocated, 2);
+                $overmatchAmount = bcsub($fundingWithdrawalTotal, $campaignFundingAllocated, 3);
                 $output->writeln("Funding {$funding->getId()} is over-matched by $overmatchAmount. $details");
                 continue;
killedBy: MatchBot\Tests\Application\Commands\HandleOutOfSyncFundsTest::testCheck
statusReason: 1) MatchBot\Tests\Application\Commands\HandleOutOfSyncFundsTest::testCheck
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
 'matchbot:handle-out-of-sync-funds starting!\n
-Funding 2 is over-matched by 10.00. Donation withdrawals 51.00, funding allocations 41.00\n
+Funding 2 is over-matched by 10.000. Donation withdrawals 51.00, funding allocations 41.00\n

[Killed] MethodCallRemoval
Application/Commands/HandleOutOfSyncFunds.php:107:17
             if ($comparison === -1) {
                 $numFundingsOvermatched++;
                 $overmatchAmount = bcsub($fundingWithdrawalTotal, $campaignFundingAllocated, 2);
-                $output->writeln("Funding {$funding->getId()} is over-matched by $overmatchAmount. $details");
+                
                 continue;
             }
killedBy: MatchBot\Tests\Application\Commands\HandleOutOfSyncFundsTest::testCheck
statusReason: 1) MatchBot\Tests\Application\Commands\HandleOutOfSyncFundsTest::testCheck
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
 'matchbot:handle-out-of-sync-funds starting!\n
-Funding 2 is over-matched by 10.00. Donation withdrawals 51.00, funding allocations 41.00\n
 Funding 3 is under-matched by 30.00. Donation withdrawals 500.00, funding allocations 530.00\n

[Killed] Continue_
Application/Commands/HandleOutOfSyncFunds.php:108:17
                 $numFundingsOvermatched++;
                 $overmatchAmount = bcsub($fundingWithdrawalTotal, $campaignFundingAllocated, 2);
                 $output->writeln("Funding {$funding->getId()} is over-matched by $overmatchAmount. $details");
-                continue;
+                break;
             }
 
killedBy: MatchBot\Tests\Application\Commands\HandleOutOfSyncFundsTest::testCheck
statusReason: 1) MatchBot\Tests\Application\Commands\HandleOutOfSyncFundsTest::testCheck
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
 'matchbot:handle-out-of-sync-funds starting!\n
 Funding 2 is over-matched by 10.00. Donation withdrawals 51.00, funding allocations 41.00\n
-Funding 3 is under-matched by 30.00. Donation withdrawals 500.00, funding allocations 530.00\n

[Killed] Increment
Application/Commands/HandleOutOfSyncFunds.php:114:13
             // If the sum of FundingWithdrawals is smaller, add to an under-matched log count. If in
             // fix mode, restore any difference to Funds starting with the highest allocationOrder,
             // until the totals match.
-            $numFundingsUndermatched++;
+            $numFundingsUndermatched--;
 
             $undermatchAmount = bcsub($campaignFundingAllocated, $fundingWithdrawalTotal, 2);
killedBy: MatchBot\Tests\Application\Commands\HandleOutOfSyncFundsTest::testCheck
statusReason: 1) MatchBot\Tests\Application\Commands\HandleOutOfSyncFundsTest::testCheck
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
 Funding 2 is over-matched by 10.00. Donation withdrawals 51.00, funding allocations 41.00\n
 Funding 3 is under-matched by 30.00. Donation withdrawals 500.00, funding allocations 530.00\n
 Funding 4 is under-matched by 0.01. Donation withdrawals 0.0

[Killed] DecrementInteger
Application/Commands/HandleOutOfSyncFunds.php:116:13
             // until the totals match.
             $numFundingsUndermatched++;
 
-            $undermatchAmount = bcsub($campaignFundingAllocated, $fundingWithdrawalTotal, 2);
+            $undermatchAmount = bcsub($campaignFundingAllocated, $fundingWithdrawalTotal, 1);
 
             $output->writeln("Funding {$funding->getId()} is under-matched by $undermatchAmount. $details");
killedBy: MatchBot\Tests\Application\Commands\HandleOutOfSyncFundsTest::testCheck
statusReason: 1) MatchBot\Tests\Application\Commands\HandleOutOfSyncFundsTest::testCheck
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
 'matchbot:handle-out-of-sync-funds starting!\n
 Funding 2 is over-matched by 10.00. Donation withdrawals 51.00, funding allocations 41.00\n
-Funding 3 is under-matched by 30.00. Donation withdrawals 500.00, funding allocations 530.00\n

[Killed] BCMath
Application/Commands/HandleOutOfSyncFunds.php:116:13
             // until the totals match.
             $numFundingsUndermatched++;
 
-            $undermatchAmount = bcsub($campaignFundingAllocated, $fundingWithdrawalTotal, 2);
+            $undermatchAmount = (string) ($campaignFundingAllocated - $fundingWithdrawalTotal);
 
             $output->writeln("Funding {$funding->getId()} is under-matched by $undermatchAmount. $details");
killedBy: MatchBot\Tests\Application\Commands\HandleOutOfSyncFundsTest::testCheck
statusReason: 1) MatchBot\Tests\Application\Commands\HandleOutOfSyncFundsTest::testCheck
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
 'matchbot:handle-out-of-sync-funds starting!\n
 Funding 2 is over-matched by 10.00. Donation withdrawals 51.00, funding allocations 41.00\n
-Funding 3 is under-matched by 30.00. Donation withdrawals 500.00, funding allocations 530.00\n

[Killed] MethodCallRemoval
Application/Commands/HandleOutOfSyncFunds.php:118:13
 
             $undermatchAmount = bcsub($campaignFundingAllocated, $fundingWithdrawalTotal, 2);
 
-            $output->writeln("Funding {$funding->getId()} is under-matched by $undermatchAmount. $details");
+            
 
             if ($mode === 'fix') {
killedBy: MatchBot\Tests\Application\Commands\HandleOutOfSyncFundsTest::testCheck
statusReason: 1) MatchBot\Tests\Application\Commands\HandleOutOfSyncFundsTest::testCheck
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
 'matchbot:handle-out-of-sync-funds starting!\n
 Funding 2 is over-matched by 10.00. Donation withdrawals 51.00, funding allocations 41.00\n
-Funding 3 is under-matched by 30.00. Donation withdrawals 500.00, funding allocations 530.00\n

[Killed] Identical
Application/Commands/HandleOutOfSyncFunds.php:120:13
 
             $output->writeln("Funding {$funding->getId()} is under-matched by $undermatchAmount. $details");
 
-            if ($mode === 'fix') {
+            if ($mode !== 'fix') {
                 $newTotal = $this->matchingAdapter->runTransactionally(
                     function () use ($funding, $undermatchAmount) {
killedBy: MatchBot\Tests\Application\Commands\HandleOutOfSyncFundsTest::testCheck
statusReason: 1) MatchBot\Tests\Application\Commands\HandleOutOfSyncFundsTest::testCheck
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
 'matchbot:handle-out-of-sync-funds starting!\n
 Funding 2 is over-matched by 10.00. Donation withdrawals 51.00, funding allocations 41.00\n
 Funding 3 is under-matched by 30.00. Donation withdrawals 500.00, funding allocations 530.00\n

[Killed] MethodCallRemoval
Application/Commands/HandleOutOfSyncFunds.php:127:17
                     }
                 );
 
-                $output->writeln("Released {$undermatchAmount} to funding ID {$funding->getId()}");
+                
                 $output->writeln("New fund total for funding ID {$funding->getId()}: $newTotal");
             }
killedBy: MatchBot\Tests\Application\Commands\HandleOutOfSyncFundsTest::testFix
statusReason: 1) MatchBot\Tests\Application\Commands\HandleOutOfSyncFundsTest::testFix
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
 'matchbot:handle-out-of-sync-funds starting!\n
 Funding 2 is over-matched by 10.00. Donation withdrawals 51.00, funding allocations 41.00\n
 Funding 3 is under-matched by 30.00. Donation withdrawals 500.00, funding allocations 530.00\n

[Killed] MethodCallRemoval
Application/Commands/HandleOutOfSyncFunds.php:128:17
                 );
 
                 $output->writeln("Released {$undermatchAmount} to funding ID {$funding->getId()}");
-                $output->writeln("New fund total for funding ID {$funding->getId()}: $newTotal");
+                
             }
         }
killedBy: MatchBot\Tests\Application\Commands\HandleOutOfSyncFundsTest::testFix
statusReason: 1) MatchBot\Tests\Application\Commands\HandleOutOfSyncFundsTest::testFix
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
 Funding 2 is over-matched by 10.00. Donation withdrawals 51.00, funding allocations 41.00\n
 Funding 3 is under-matched by 30.00. Donation withdrawals 500.00, funding allocations 530.00\n
 Released 30.00 to funding ID 3\n
