[Killed] PublicVisibility
Application/Commands/LockingCommand.php:23:5
     private LockInterface $lock;
     private LoggerInterface $logger;
 
-    public function setLockFactory(LockFactory $lockFactory): void
+    protected function setLockFactory(LockFactory $lockFactory) : void
     {
         $this->lockFactory = $lockFactory;
killedBy: MatchBot\Tests\Application\Commands\PushDonationsTest::testSinglePush
statusReason: 1) MatchBot\Tests\Application\Commands\PushDonationsTest::testSinglePush
Error: Call to protected method MatchBot\Application\Commands\LockingCommand::setLockFactory() from scope MatchBot\Tests\Application\Commands\PushDonationsTest

/home/barney/projects/matchbot/tests/Application/Commands/PushDonationsTest.php:27

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] PublicVisibility
Application/Commands/LockingCommand.php:28:5
         $this->lockFactory = $lockFactory;
     }
 
-    public function setLogger(LoggerInterface $logger): void
+    protected function setLogger(LoggerInterface $logger) : void
     {
         $this->logger = $logger;
killedBy: MatchBot\Tests\Application\Commands\PushDonationsTest::testSinglePush
statusReason: 1) MatchBot\Tests\Application\Commands\PushDonationsTest::testSinglePush
Error: Call to protected method MatchBot\Application\Commands\LockingCommand::setLogger() from scope MatchBot\Tests\Application\Commands\PushDonationsTest

/home/barney/projects/matchbot/tests/Application/Commands/PushDonationsTest.php:28

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] IfNegation
Application/Commands/LockingCommand.php:36:9
     protected function execute(InputInterface $input, OutputInterface $output): int
     {
         $this->start($output);
-        if ($this->getLock()) {
-            $return = $this->doExecute($input, $output);
-            $this->releaseLock();
-        } else {
-            $message = $this->getName() . ' did nothing as another instance had the lock.';
-            $output->writeln($message);
-            $this->logger->warning($message);
-            return 0; // Log at warning level to help monitoring volume but don't fire error alarms.
-        }
+        if (!$this->getLock()) {
         $this->finish($output);
 
killedBy: MatchBot\Tests\Application\Commands\PushDonationsTest::testSinglePush
statusReason: 1) MatchBot\Tests\Application\Commands\PushDonationsTest::testSinglePush
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
 'matchbot:push-donations starting!\n
-Pushed 1 donations to Salesforce\n
-matchbot:push-donations complete!\n

[Killed] MethodCallRemoval
Application/Commands/LockingCommand.php:38:13
         $this->start($output);
         if ($this->getLock()) {
             $return = $this->doExecute($input, $output);
-            $this->releaseLock();
+            
         } else {
             $message = $this->getName() . ' did nothing as another instance had the lock.';
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

......................                                            22 / 22 (100%)

Time: 00:00.260, Memory: 22.00 MB

OK (22 tests, 109 assertions)

[NoCoverage] Concat
Application/Commands/LockingCommand.php:40:13
             $return = $this->doExecute($input, $output);
             $this->releaseLock();
         } else {
-            $message = $this->getName() . ' did nothing as another instance had the lock.';
+            $message = ' did nothing as another instance had the lock.' . $this->getName();
             $output->writeln($message);
             $this->logger->warning($message);

[NoCoverage] ConcatOperandRemoval
Application/Commands/LockingCommand.php:40:13
             $return = $this->doExecute($input, $output);
             $this->releaseLock();
         } else {
-            $message = $this->getName() . ' did nothing as another instance had the lock.';
+            $message = ' did nothing as another instance had the lock.';
             $output->writeln($message);
             $this->logger->warning($message);

[NoCoverage] MethodCallRemoval
Application/Commands/LockingCommand.php:41:13
             $this->releaseLock();
         } else {
             $message = $this->getName() . ' did nothing as another instance had the lock.';
-            $output->writeln($message);
+            
             $this->logger->warning($message);
             return 0; // Log at warning level to help monitoring volume but don't fire error alarms.

[NoCoverage] MethodCallRemoval
Application/Commands/LockingCommand.php:42:13
         } else {
             $message = $this->getName() . ' did nothing as another instance had the lock.';
             $output->writeln($message);
-            $this->logger->warning($message);
+            
             return 0; // Log at warning level to help monitoring volume but don't fire error alarms.
         }

[NoCoverage] DecrementInteger
Application/Commands/LockingCommand.php:43:13
             $message = $this->getName() . ' did nothing as another instance had the lock.';
             $output->writeln($message);
             $this->logger->warning($message);
-            return 0; // Log at warning level to help monitoring volume but don't fire error alarms.
+            return -1;
         }
         $this->finish($output);

[NoCoverage] IncrementInteger
Application/Commands/LockingCommand.php:43:13
             $message = $this->getName() . ' did nothing as another instance had the lock.';
             $output->writeln($message);
             $this->logger->warning($message);
-            return 0; // Log at warning level to help monitoring volume but don't fire error alarms.
+            return 1;
         }
         $this->finish($output);

[Killed] MethodCallRemoval
Application/Commands/LockingCommand.php:45:9
             $this->logger->warning($message);
             return 0; // Log at warning level to help monitoring volume but don't fire error alarms.
         }
-        $this->finish($output);
+        
 
         return $return;
killedBy: MatchBot\Tests\Application\Commands\PushDonationsTest::testSinglePush
statusReason: 1) MatchBot\Tests\Application\Commands\PushDonationsTest::testSinglePush
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
 'matchbot:push-donations starting!\n
 Pushed 1 donations to Salesforce\n
-matchbot:push-donations complete!\n

[Killed] DecrementInteger
Application/Commands/LockingCommand.php:54:13
     {
         $this->lock = $this->lockFactory->createLock(
             $this->getName(),
-            30 * 60,    // 30 minute lock
+            30 * 59,
             true        // auto-release on process end
         );
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

......................                                            22 / 22 (100%)

Time: 00:00.201, Memory: 22.00 MB

OK (22 tests, 109 assertions)

[Killed] IncrementInteger
Application/Commands/LockingCommand.php:54:13
     {
         $this->lock = $this->lockFactory->createLock(
             $this->getName(),
-            30 * 60,    // 30 minute lock
+            31 * 60,
             true        // auto-release on process end
         );
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

......................                                            22 / 22 (100%)

Time: 00:00.213, Memory: 22.00 MB

OK (22 tests, 109 assertions)

[Killed] TrueValue
Application/Commands/LockingCommand.php:55:13
         $this->lock = $this->lockFactory->createLock(
             $this->getName(),
             30 * 60,    // 30 minute lock
-            true        // auto-release on process end
+            false
         );
 
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

......................                                            22 / 22 (100%)

Time: 00:00.098, Memory: 22.00 MB

OK (22 tests, 109 assertions)

[Killed] FalseValue
Application/Commands/LockingCommand.php:58:9
             true        // auto-release on process end
         );
 
-        return $this->lock->acquire(false);
+        return $this->lock->acquire(true);
     }
 
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

......................                                            22 / 22 (100%)

Time: 00:00.105, Memory: 22.00 MB

OK (22 tests, 109 assertions)

[Killed] MethodCallRemoval
Application/Commands/LockingCommand.php:63:9
 
     private function releaseLock(): void
     {
-        $this->lock->release();
+        
     }
 }
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

......................                                            22 / 22 (100%)

Time: 00:00.191, Memory: 22.00 MB

OK (22 tests, 109 assertions)
