[Survived] MethodCallRemoval
Application/Commands/PushDonations.php:23:9
 
     protected function configure(): void
     {
-        $this->setDescription('Pushes details of any new or updated donations not yet synced to Salesforce');
+        
     }
 

[Killed] GreaterThanNegotiation
Application/Commands/PushDonations.php:28:9
 
     protected function doExecute(InputInterface $input, OutputInterface $output): int
     {
-        if (($numberAbandoned = $this->donationRepository->abandonOldCancelled()) > 0) {
+        if (($numberAbandoned = $this->donationRepository->abandonOldCancelled()) <= 0) {
             $output->writeln("Abandoned $numberAbandoned old Cancelled donations from Salesforce push");
         }
killedBy: MatchBot\Tests\Application\Commands\PushDonationsTest::testSinglePush
statusReason: 1) MatchBot\Tests\Application\Commands\PushDonationsTest::testSinglePush
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
 'matchbot:push-donations starting!\n
+Abandoned 0 old Cancelled donations from Salesforce push\n
 Pushed 1 donations to Salesforce\n

[Killed] GreaterThan
Application/Commands/PushDonations.php:28:9
 
     protected function doExecute(InputInterface $input, OutputInterface $output): int
     {
-        if (($numberAbandoned = $this->donationRepository->abandonOldCancelled()) > 0) {
+        if (($numberAbandoned = $this->donationRepository->abandonOldCancelled()) >= 0) {
             $output->writeln("Abandoned $numberAbandoned old Cancelled donations from Salesforce push");
         }
killedBy: MatchBot\Tests\Application\Commands\PushDonationsTest::testSinglePush
statusReason: 1) MatchBot\Tests\Application\Commands\PushDonationsTest::testSinglePush
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
 'matchbot:push-donations starting!\n
+Abandoned 0 old Cancelled donations from Salesforce push\n
 Pushed 1 donations to Salesforce\n

[Killed] MethodCallRemoval
Application/Commands/PushDonations.php:29:13
     protected function doExecute(InputInterface $input, OutputInterface $output): int
     {
         if (($numberAbandoned = $this->donationRepository->abandonOldCancelled()) > 0) {
-            $output->writeln("Abandoned $numberAbandoned old Cancelled donations from Salesforce push");
+            
         }
 
killedBy: MatchBot\Tests\Application\Commands\PushDonationsTest::testPushWithOneCancelledAbandonedDonation
statusReason: 1) MatchBot\Tests\Application\Commands\PushDonationsTest::testPushWithOneCancelledAbandonedDonation
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
 'matchbot:push-donations starting!\n
-Abandoned 1 old Cancelled donations from Salesforce push\n
 Pushed 1 donations to Salesforce\n

[Killed] MethodCallRemoval
Application/Commands/PushDonations.php:33:9
         }
 
         $numberPushed = $this->donationRepository->pushSalesforcePending();
-        $output->writeln("Pushed $numberPushed donations to Salesforce");
+        
 
         return 0;
killedBy: MatchBot\Tests\Application\Commands\PushDonationsTest::testSinglePush
statusReason: 1) MatchBot\Tests\Application\Commands\PushDonationsTest::testSinglePush
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
 'matchbot:push-donations starting!\n
-Pushed 1 donations to Salesforce\n
 matchbot:push-donations complete!\n
