[Survived] MethodCallRemoval
Application/Commands/ResetMatching.php:30:9
 
     protected function configure(): void
     {
-        $this->setDescription('Delete fund balance data from the matching adapter');
+        
     }
 

[Killed] Identical
Application/Commands/ResetMatching.php:35:9
 
     protected function doExecute(InputInterface $input, OutputInterface $output): int
     {
-        if (getenv('APP_ENV') === 'production') {
+        if (getenv('APP_ENV') !== 'production') {
             // Erroring in one command stops the Composer script running the next one too, so this
             // should also eliminate the possibility of Composer `matchbot:reset` clearing the
killedBy: MatchBot\Tests\Application\Commands\ResetMatchingTest::testSinglePush
statusReason: 1) MatchBot\Tests\Application\Commands\ResetMatchingTest::testSinglePush
RuntimeException: Reset not supported on Production

/home/barney/projects/matchbot/src/Application/Commands/ResetMatching.php:32
/home/barney/projects/matchbot/src/Application/Commands/LockingCommand.php:37
/home/barney/projects/matchbot/vendor/symfony/console/Command/Command.php:326
/home/barney/projects/matchbot/vendor/sym

[NoCoverage] Throw_
Application/Commands/ResetMatching.php:39:13
             // Erroring in one command stops the Composer script running the next one too, so this
             // should also eliminate the possibility of Composer `matchbot:reset` clearing the
             // Production database if run there in error.
-            throw new \RuntimeException('Reset not supported on Production');
+            new \RuntimeException('Reset not supported on Production');
         }
 

[Killed] MethodCallRemoval
Application/Commands/ResetMatching.php:45:13
         try {
             $fundings = $this->campaignFundingRepository->findAll();
         } catch (TableNotFoundException $exception) {
-            $output->writeln('Skipping matching reset as database is empty.');
+            
 
             return 0;
killedBy: MatchBot\Tests\Application\Commands\ResetMatchingTest::testBlankDb
statusReason: 1) MatchBot\Tests\Application\Commands\ResetMatchingTest::testBlankDb
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
 'matchbot:reset-matching starting!\n
-Skipping matching reset as database is empty.\n
 matchbot:reset-matching complete!\n

[Killed] Foreach_
Application/Commands/ResetMatching.php:50:9
             return 0;
         }
 
-        foreach ($fundings as $funding) {
-            $this->matchingAdapter->delete($funding);
-        }
+        foreach (array() as $funding) {
         $output->writeln(sprintf('Completed matching reset for %d fundings.', count($fundings)));
 
killedBy: MatchBot\Tests\Application\Commands\ResetMatchingTest::testSinglePush
statusReason: 1) MatchBot\Tests\Application\Commands\ResetMatchingTest::testSinglePush
Some predictions failed:
Double\MatchBot\Application\Matching\Adapter\P1:
  Expected exactly 1 calls that match:
      Double\MatchBot\Application\Matching\Adapter\P1->delete(exact(MatchBot\Domain\CampaignFunding#340 Object (
        'id' => null
        'campaigns' => Doctrine\Common\Collections\ArrayCollection#341 Object (

[Killed] MethodCallRemoval
Application/Commands/ResetMatching.php:51:13
         }
 
         foreach ($fundings as $funding) {
-            $this->matchingAdapter->delete($funding);
+            
         }
         $output->writeln(sprintf('Completed matching reset for %d fundings.', count($fundings)));
killedBy: MatchBot\Tests\Application\Commands\ResetMatchingTest::testSinglePush
statusReason: 1) MatchBot\Tests\Application\Commands\ResetMatchingTest::testSinglePush
Some predictions failed:
Double\MatchBot\Application\Matching\Adapter\P1:
  Expected exactly 1 calls that match:
      Double\MatchBot\Application\Matching\Adapter\P1->delete(exact(MatchBot\Domain\CampaignFunding#340 Object (
        'id' => null
        'campaigns' => Doctrine\Common\Collections\ArrayCollection#341 Object (

[Killed] MethodCallRemoval
Application/Commands/ResetMatching.php:53:9
         foreach ($fundings as $funding) {
             $this->matchingAdapter->delete($funding);
         }
-        $output->writeln(sprintf('Completed matching reset for %d fundings.', count($fundings)));
+        
 
         return 0;
killedBy: MatchBot\Tests\Application\Commands\ResetMatchingTest::testSinglePush
statusReason: 1) MatchBot\Tests\Application\Commands\ResetMatchingTest::testSinglePush
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
 'matchbot:reset-matching starting!\n
-Completed matching reset for 1 fundings.\n
 matchbot:reset-matching complete!\n
