[NoCoverage] MethodCallRemoval
Application/Commands/ScheduledOutOfSyncFundsCheck.php:30:9
 
     )
     {
-        parent::__construct($campaignFundingRepository, $fundingWithdrawalRepository, $matchingAdapter);
+        
     }
 

[NoCoverage] MethodCallRemoval
Application/Commands/ScheduledOutOfSyncFundsCheck.php:37:9
 
     protected function configure(): void
     {
-        $this->setDescription("For running via a cron job. Checks for out of sync funds but doesn't attempt to fix them. Sends output to Slack");
+        
     }
 

[NoCoverage] ArrayItemRemoval
Application/Commands/ScheduledOutOfSyncFundsCheck.php:44:9
     {
         $bufferedOutput = new BufferedOutput();
 
-        $arrayInput = new ArrayInput(['mode' => 'check'], new InputDefinition([new InputArgument('mode', InputArgument::REQUIRED)]));
+        $arrayInput = new ArrayInput([], new InputDefinition([new InputArgument('mode', InputArgument::REQUIRED)]));
 
         parent::doExecute($arrayInput, $bufferedOutput);

[NoCoverage] ArrayItemRemoval
Application/Commands/ScheduledOutOfSyncFundsCheck.php:44:9
     {
         $bufferedOutput = new BufferedOutput();
 
-        $arrayInput = new ArrayInput(['mode' => 'check'], new InputDefinition([new InputArgument('mode', InputArgument::REQUIRED)]));
+        $arrayInput = new ArrayInput(['mode' => 'check'], new InputDefinition([]));
 
         parent::doExecute($arrayInput, $bufferedOutput);

[NoCoverage] MethodCallRemoval
Application/Commands/ScheduledOutOfSyncFundsCheck.php:46:9
 
         $arrayInput = new ArrayInput(['mode' => 'check'], new InputDefinition([new InputArgument('mode', InputArgument::REQUIRED)]));
 
-        parent::doExecute($arrayInput, $bufferedOutput);
+        
 
         $chatMessage = new ChatMessage('Out of sync funds check');

[NoCoverage] Concat
Application/Commands/ScheduledOutOfSyncFundsCheck.php:49:9
         parent::doExecute($arrayInput, $bufferedOutput);
 
         $chatMessage = new ChatMessage('Out of sync funds check');
-        $message = 'Out of sync funds check completed' . ($this->outOfSyncFundFound ? " OUT OF SYNC FUNDS DETECTED" : " no out of sync funds detected");
+        $message = ($this->outOfSyncFundFound ? " OUT OF SYNC FUNDS DETECTED" : " no out of sync funds detected") . 'Out of sync funds check completed';
         $output->writeln($message);
         if ($this->outOfSyncFundFound) {

[NoCoverage] ConcatOperandRemoval
Application/Commands/ScheduledOutOfSyncFundsCheck.php:49:9
         parent::doExecute($arrayInput, $bufferedOutput);
 
         $chatMessage = new ChatMessage('Out of sync funds check');
-        $message = 'Out of sync funds check completed' . ($this->outOfSyncFundFound ? " OUT OF SYNC FUNDS DETECTED" : " no out of sync funds detected");
+        $message = 'Out of sync funds check completed';
         $output->writeln($message);
         if ($this->outOfSyncFundFound) {

[NoCoverage] MethodCallRemoval
Application/Commands/ScheduledOutOfSyncFundsCheck.php:50:9
 
         $chatMessage = new ChatMessage('Out of sync funds check');
         $message = 'Out of sync funds check completed' . ($this->outOfSyncFundFound ? " OUT OF SYNC FUNDS DETECTED" : " no out of sync funds detected");
-        $output->writeln($message);
+        
         if ($this->outOfSyncFundFound) {
             $env = getenv('APP_ENV');

[NoCoverage] MethodCallRemoval
Application/Commands/ScheduledOutOfSyncFundsCheck.php:61:13
                     $message,
                 ))))
                 ->block((new SlackSectionBlock())->text($bufferedOutput->fetch()));
-            $chatMessage->options($options);
+            
 
             $this->chatter->send($chatMessage);
