[Killed] MethodCallRemoval
Application/Commands/UpdateCampaigns.php:32:9
         private FundRepository $fundRepository,
         private LoggerInterface $logger
     ) {
-        parent::__construct(static::$defaultName);
+        
     }
 
killedBy: MatchBot\Tests\Application\Commands\UpdateCampaignsTest::testSingleUpdateSuccess
statusReason: 1) MatchBot\Tests\Application\Commands\UpdateCampaignsTest::testSingleUpdateSuccess
Symfony\Component\Console\Exception\LogicException: Command class "MatchBot\Application\Commands\UpdateCampaigns" is not correctly initialized. You probably forgot to call the parent constructor.

/home/barney/projects/matchbot/vendor/symfony/console/Command/Command.php:449
/home/barney/projects/matchbot/vendor/sym

[Killed] MethodCallRemoval
Application/Commands/UpdateCampaigns.php:37:9
 
     protected function configure(): void
     {
-        $this->setDescription(<<<EOT
-Pulls down and saves the latest details of existing, already-known Campaigns from Salesforce
-which were not expected to have ended over a week ago (unless --all option set, in which
-case that constraint is loosened)
-EOT
-        );
+        
         $this->addOption('all', null, InputOption::VALUE_NONE, 'Expands the update to ALL historic known campaigns');
     }
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

.....                                                               5 / 5 (100%)

Time: 00:00.057, Memory: 18.00 MB

OK (5 tests, 24 assertions)

[Killed] MethodCallRemoval
Application/Commands/UpdateCampaigns.php:43:9
 case that constraint is loosened)
 EOT
         );
-        $this->addOption('all', null, InputOption::VALUE_NONE, 'Expands the update to ALL historic known campaigns');
+        
     }
 
killedBy: MatchBot\Tests\Application\Commands\UpdateCampaignsTest::testSingleUpdateSuccess
statusReason: 1) MatchBot\Tests\Application\Commands\UpdateCampaignsTest::testSingleUpdateSuccess
Symfony\Component\Console\Exception\InvalidArgumentException: The "all" option does not exist.

/home/barney/projects/matchbot/vendor/symfony/console/Input/Input.php:140
/home/barney/projects/matchbot/src/Application/Commands/UpdateCampaigns.php:45
/home/barney/projects/matchbot/src/Application/Commands/LockingComm

[Killed] IfNegation
Application/Commands/UpdateCampaigns.php:49:9
     protected function doExecute(InputInterface $input, OutputInterface $output): int
     {
         /** @var Campaign[] $campaigns */
-        if ($input->getOption('all')) {
-            $campaigns = $this->campaignRepository->findAll();
-        } else {
-            $campaigns = $this->campaignRepository->findRecentAndLive();
-        }
+        if (!$input->getOption('all')) {
 
         foreach ($campaigns as $campaign) {
killedBy: MatchBot\Tests\Application\Commands\UpdateCampaignsTest::testSingleUpdateSuccess
statusReason: 1) MatchBot\Tests\Application\Commands\UpdateCampaignsTest::testSingleUpdateSuccess
foreach() argument must be of type array|object, null given

/home/barney/projects/matchbot/src/Application/Commands/UpdateCampaigns.php:50
/home/barney/projects/matchbot/src/Application/Commands/LockingCommand.php:37
/home/barney/projects/matchbot/vendor/symfony/console/Command/Command.php:326
/home/barney/project

[Killed] MethodCallRemoval
Application/Commands/UpdateCampaigns.php:57:17
 
         foreach ($campaigns as $campaign) {
             try {
-                $this->pull($campaign, $output);
+                
             } catch (NotFoundException $exception) {
                 if (getenv('APP_ENV') === 'production') {
killedBy: MatchBot\Tests\Application\Commands\UpdateCampaignsTest::testSingleUpdateSuccess
statusReason: 1) MatchBot\Tests\Application\Commands\UpdateCampaignsTest::testSingleUpdateSuccess
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
 'matchbot:update-campaigns starting!\n
-Updated campaign someCampaignId\n
 matchbot:update-campaigns complete!\n

[Killed] Identical
Application/Commands/UpdateCampaigns.php:59:17
             try {
                 $this->pull($campaign, $output);
             } catch (NotFoundException $exception) {
-                if (getenv('APP_ENV') === 'production') {
+                if (getenv('APP_ENV') !== 'production') {
                     // This is currently possible if a charity had a campaign already launchable
                     // before, but no longer meets the requirements to run it. Our Saleforce APIs
killedBy: MatchBot\Tests\Application\Commands\UpdateCampaignsTest::testSingleUpdateNotFoundOnSalesforceOutsideProduction
statusReason: 1) MatchBot\Tests\Application\Commands\UpdateCampaignsTest::testSingleUpdateNotFoundOnSalesforceOutsideProduction
Error: Typed property MatchBot\Domain\Campaign::$endDate must not be accessed before initialization

/home/barney/projects/matchbot/src/Domain/Campaign.php:202
/home/barney/projects/matchbot/src/Application/Commands/UpdateCampaigns.php:58
/home/barney/projects/matchbot/src/Application/

[NoCoverage] LessThan
Application/Commands/UpdateCampaigns.php:63:21
                     // This is currently possible if a charity had a campaign already launchable
                     // before, but no longer meets the requirements to run it. Our Saleforce APIs
                     // will then 404 and no longer return current data for the campaign.
-                    if ($campaign->getEndDate() < new \DateTime()) {
+                    if ($campaign->getEndDate() <= new \DateTime()) {
                         $this->logger->info(sprintf(
                             'Skipping unknown PRODUCTION campaign %s whose end date had passed – charity inactive?',

[NoCoverage] LessThanNegotiation
Application/Commands/UpdateCampaigns.php:63:21
                     // This is currently possible if a charity had a campaign already launchable
                     // before, but no longer meets the requirements to run it. Our Saleforce APIs
                     // will then 404 and no longer return current data for the campaign.
-                    if ($campaign->getEndDate() < new \DateTime()) {
+                    if ($campaign->getEndDate() >= new \DateTime()) {
                         $this->logger->info(sprintf(
                             'Skipping unknown PRODUCTION campaign %s whose end date had passed – charity inactive?',

[NoCoverage] MethodCallRemoval
Application/Commands/UpdateCampaigns.php:64:25
                     // before, but no longer meets the requirements to run it. Our Saleforce APIs
                     // will then 404 and no longer return current data for the campaign.
                     if ($campaign->getEndDate() < new \DateTime()) {
-                        $this->logger->info(sprintf(
-                            'Skipping unknown PRODUCTION campaign %s whose end date had passed – charity inactive?',
-                            $campaign->getSalesforceId()
-                        ));
+                        
                     } else {
                         $this->logger->error(sprintf(

[NoCoverage] MethodCallRemoval
Application/Commands/UpdateCampaigns.php:69:25
                             $campaign->getSalesforceId()
                         ));
                     } else {
-                        $this->logger->error(sprintf(
-                            'Skipping unknown PRODUCTION campaign %s – charity inactive?',
-                            $campaign->getSalesforceId()
-                        ));
+                        
                     }
                 } else {

[Killed] MethodCallRemoval
Application/Commands/UpdateCampaigns.php:76:21
                     }
                 } else {
                     // Chances are a sandbox refresh has led to this campaign being deleted in the Salesforce sandbox.
-                    $output->writeln('Skipping unknown sandbox campaign ' . $campaign->getSalesforceId());
+                    
                 }
             } catch (DomainCurrencyMustNotChangeException $exception) {
killedBy: MatchBot\Tests\Application\Commands\UpdateCampaignsTest::testSingleUpdateNotFoundOnSalesforceOutsideProduction
statusReason: 1) MatchBot\Tests\Application\Commands\UpdateCampaignsTest::testSingleUpdateNotFoundOnSalesforceOutsideProduction
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
 'matchbot:update-campaigns starting!\n
-Skipping unknown sandbox campaign missingOnSfCampaignId\n
 matchbot:update-campaigns complete!\n

[Killed] Concat
Application/Commands/UpdateCampaigns.php:76:21
                     }
                 } else {
                     // Chances are a sandbox refresh has led to this campaign being deleted in the Salesforce sandbox.
-                    $output->writeln('Skipping unknown sandbox campaign ' . $campaign->getSalesforceId());
+                    $output->writeln($campaign->getSalesforceId() . 'Skipping unknown sandbox campaign ');
                 }
             } catch (DomainCurrencyMustNotChangeException $exception) {
killedBy: MatchBot\Tests\Application\Commands\UpdateCampaignsTest::testSingleUpdateNotFoundOnSalesforceOutsideProduction
statusReason: 1) MatchBot\Tests\Application\Commands\UpdateCampaignsTest::testSingleUpdateNotFoundOnSalesforceOutsideProduction
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
 'matchbot:update-campaigns starting!\n
-Skipping unknown sandbox campaign missingOnSfCampaignId\n
+missingOnSfCampaignIdSkipping unknown sandbox campaign \n

[NoCoverage] ConcatOperandRemoval
Application/Commands/UpdateCampaigns.php:79:17
                     $output->writeln('Skipping unknown sandbox campaign ' . $campaign->getSalesforceId());
                 }
             } catch (DomainCurrencyMustNotChangeException $exception) {
-                $output->writeln('Skipping invalid currency change campaign ' . $campaign->getSalesforceId());
+                $output->writeln('Skipping invalid currency change campaign ');
             } catch (TransferException $exception) {
                 $this->logger->info(sprintf(

[NoCoverage] MethodCallRemoval
Application/Commands/UpdateCampaigns.php:79:17
                     $output->writeln('Skipping unknown sandbox campaign ' . $campaign->getSalesforceId());
                 }
             } catch (DomainCurrencyMustNotChangeException $exception) {
-                $output->writeln('Skipping invalid currency change campaign ' . $campaign->getSalesforceId());
+                
             } catch (TransferException $exception) {
                 $this->logger->info(sprintf(

[Killed] MethodCallRemoval
Application/Commands/UpdateCampaigns.php:81:17
             } catch (DomainCurrencyMustNotChangeException $exception) {
                 $output->writeln('Skipping invalid currency change campaign ' . $campaign->getSalesforceId());
             } catch (TransferException $exception) {
-                $this->logger->info(sprintf(
-                    'Retrying campaign %s due to transfer error "%s"',
-                    $campaign->getSalesforceId(),
-                    $exception->getMessage(),
-                ));
+                
 
                 try {
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

.....                                                               5 / 5 (100%)

Time: 00:00.066, Memory: 18.00 MB

OK (5 tests, 24 assertions)

[Killed] MethodCallRemoval
Application/Commands/UpdateCampaigns.php:95:21
                         $campaign->getSalesforceId(),
                         $exception->getMessage(),
                     );
-                    $output->writeln($transferError);
+                    
                     $this->logger->warning($transferError);
                 }
killedBy: MatchBot\Tests\Application\Commands\UpdateCampaignsTest::testSingleUpdateHitsTransferExceptionTwice
statusReason: 1) MatchBot\Tests\Application\Commands\UpdateCampaignsTest::testSingleUpdateHitsTransferExceptionTwice
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
 'matchbot:update-campaigns starting!\n
-Skipping campaign someCampaignId due to 2nd transfer error "dummy exc message"\n
 matchbot:update-campaigns complete!\n

[Killed] MethodCallRemoval
Application/Commands/UpdateCampaigns.php:96:21
                         $exception->getMessage(),
                     );
                     $output->writeln($transferError);
-                    $this->logger->warning($transferError);
+                    
                 }
             }
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

.....                                                               5 / 5 (100%)

Time: 00:00.075, Memory: 18.00 MB

OK (5 tests, 24 assertions)

[Killed] MethodCallRemoval
Application/Commands/UpdateCampaigns.php:106:9
         // cache so future processes see all the new data straight away.
         /** @var CacheProvider $cacheDriver */
         $cacheDriver = $this->entityManager->getConfiguration()->getResultCacheImpl();
-        $cacheDriver->deleteAll();
+        
 
         return 0;
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

.....                                                               5 / 5 (100%)

Time: 00:00.058, Memory: 18.00 MB

OK (5 tests, 24 assertions)

[Killed] ProtectedVisibility
Application/Commands/UpdateCampaigns.php:111:5
         return 0;
     }
 
-    protected function pull(Campaign $campaign, OutputInterface $output): void
+    private function pull(Campaign $campaign, OutputInterface $output) : void
     {
         $this->campaignRepository->pull($campaign);
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

.....                                                               5 / 5 (100%)

Time: 00:00.059, Memory: 18.00 MB

OK (5 tests, 24 assertions)

[Killed] MethodCallRemoval
Application/Commands/UpdateCampaigns.php:113:9
 
     protected function pull(Campaign $campaign, OutputInterface $output): void
     {
-        $this->campaignRepository->pull($campaign);
+        
         $this->fundRepository->pullForCampaign($campaign);
         $output->writeln('Updated campaign ' . $campaign->getSalesforceId());
killedBy: MatchBot\Tests\Application\Commands\UpdateCampaignsTest::testSingleUpdateSuccess
statusReason: 1) MatchBot\Tests\Application\Commands\UpdateCampaignsTest::testSingleUpdateSuccess
Some predictions failed:
Double\MatchBot\Domain\CampaignRepository\P1:
  Expected exactly 1 calls that match:
      Double\MatchBot\Domain\CampaignRepository\P1->pull(exact(MatchBot\Domain\Campaign#332 Object (
        'id' => null
        'salesforceId' => 'someCampaignId'
        'salesforceLastPull' => null

[Killed] MethodCallRemoval
Application/Commands/UpdateCampaigns.php:114:9
     protected function pull(Campaign $campaign, OutputInterface $output): void
     {
         $this->campaignRepository->pull($campaign);
-        $this->fundRepository->pullForCampaign($campaign);
+        
         $output->writeln('Updated campaign ' . $campaign->getSalesforceId());
     }
killedBy: MatchBot\Tests\Application\Commands\UpdateCampaignsTest::testSingleUpdateSuccess
statusReason: 1) MatchBot\Tests\Application\Commands\UpdateCampaignsTest::testSingleUpdateSuccess
Some predictions failed:
Double\MatchBot\Domain\FundRepository\P2:
  Expected exactly 1 calls that match:
      Double\MatchBot\Domain\FundRepository\P2->pullForCampaign(exact(MatchBot\Domain\Campaign#332 Object (
        'id' => null
        'salesforceId' => 'someCampaignId'
        'salesforceLastPull' => null

[Killed] MethodCallRemoval
Application/Commands/UpdateCampaigns.php:115:9
     {
         $this->campaignRepository->pull($campaign);
         $this->fundRepository->pullForCampaign($campaign);
-        $output->writeln('Updated campaign ' . $campaign->getSalesforceId());
+        
     }
 }
killedBy: MatchBot\Tests\Application\Commands\UpdateCampaignsTest::testSingleUpdateSuccess
statusReason: 1) MatchBot\Tests\Application\Commands\UpdateCampaignsTest::testSingleUpdateSuccess
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
 'matchbot:update-campaigns starting!\n
-Updated campaign someCampaignId\n
 matchbot:update-campaigns complete!\n

[Killed] Concat
Application/Commands/UpdateCampaigns.php:115:9
     {
         $this->campaignRepository->pull($campaign);
         $this->fundRepository->pullForCampaign($campaign);
-        $output->writeln('Updated campaign ' . $campaign->getSalesforceId());
+        $output->writeln($campaign->getSalesforceId() . 'Updated campaign ');
     }
 }
killedBy: MatchBot\Tests\Application\Commands\UpdateCampaignsTest::testSingleUpdateSuccess
statusReason: 1) MatchBot\Tests\Application\Commands\UpdateCampaignsTest::testSingleUpdateSuccess
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
 'matchbot:update-campaigns starting!\n
-Updated campaign someCampaignId\n
+someCampaignIdUpdated campaign \n
