[Killed] LogicalNot
Application/Fees/Calculator.php:43:9
         readonly private ?float $feePercentageOverride = null,
     ) {
         $this->pspFeeSettings = $settings[$psp]['fee'];
-        if (! in_array($this->cardBrand, [...self::STRIPE_CARD_BRANDS, null], true)) {
+        if (in_array($this->cardBrand, [...self::STRIPE_CARD_BRANDS, null], true)) {
             throw new \UnexpectedValueException('Unexpected card brand, expected brands are ' . implode(', ', self::STRIPE_CARD_BRANDS));
         }
killedBy: MatchBot\Tests\Application\Fees\CalculatorTest::testStripeUKCardGBPDonation
statusReason: 1) MatchBot\Tests\Application\Fees\CalculatorTest::testStripeUKCardGBPDonation
UnexpectedValueException: Unexpected card brand, expected brands are amex, diners, discover, eftpos_au, jcb, mastercard, unionpay, visa, unknown

/home/barney/projects/matchbot/src/Application/Fees/Calculator.php:33
/home/barney/projects/matchbot/tests/Application/Fees/CalculatorTest.php:44

ERRORS!
Tests: 1, Assertions

[Killed] SpreadOneItem
Application/Fees/Calculator.php:43:9
         readonly private ?float $feePercentageOverride = null,
     ) {
         $this->pspFeeSettings = $settings[$psp]['fee'];
-        if (! in_array($this->cardBrand, [...self::STRIPE_CARD_BRANDS, null], true)) {
+        if (!in_array($this->cardBrand, [[...self::STRIPE_CARD_BRANDS][0], null], true)) {
             throw new \UnexpectedValueException('Unexpected card brand, expected brands are ' . implode(', ', self::STRIPE_CARD_BRANDS));
         }
killedBy: MatchBot\Tests\Application\Fees\CalculatorTest::testStripeUKCardGBPDonation
statusReason: 1) MatchBot\Tests\Application\Fees\CalculatorTest::testStripeUKCardGBPDonation
UnexpectedValueException: Unexpected card brand, expected brands are amex, diners, discover, eftpos_au, jcb, mastercard, unionpay, visa, unknown

/home/barney/projects/matchbot/src/Application/Fees/Calculator.php:33
/home/barney/projects/matchbot/tests/Application/Fees/CalculatorTest.php:44

ERRORS!
Tests: 1, Assertions

[NoCoverage] Concat
Application/Fees/Calculator.php:44:13
     ) {
         $this->pspFeeSettings = $settings[$psp]['fee'];
         if (! in_array($this->cardBrand, [...self::STRIPE_CARD_BRANDS, null], true)) {
-            throw new \UnexpectedValueException('Unexpected card brand, expected brands are ' . implode(', ', self::STRIPE_CARD_BRANDS));
+            throw new \UnexpectedValueException(implode(', ', self::STRIPE_CARD_BRANDS) . 'Unexpected card brand, expected brands are ');
         }
     }

[NoCoverage] Throw_
Application/Fees/Calculator.php:44:13
     ) {
         $this->pspFeeSettings = $settings[$psp]['fee'];
         if (! in_array($this->cardBrand, [...self::STRIPE_CARD_BRANDS, null], true)) {
-            throw new \UnexpectedValueException('Unexpected card brand, expected brands are ' . implode(', ', self::STRIPE_CARD_BRANDS));
+            new \UnexpectedValueException('Unexpected card brand, expected brands are ' . implode(', ', self::STRIPE_CARD_BRANDS));
         }
     }

[Killed] PublicVisibility
Application/Fees/Calculator.php:48:5
         }
     }
 
-    public function getCoreFee(): string
+    protected function getCoreFee() : string
     {
         $giftAidFee = '0.00';
killedBy: MatchBot\Tests\Application\Fees\CalculatorTest::testStripeUKCardGBPDonation
statusReason: 1) MatchBot\Tests\Application\Fees\CalculatorTest::testStripeUKCardGBPDonation
Error: Call to protected method MatchBot\Application\Fees\Calculator::getCoreFee() from scope MatchBot\Tests\Application\Fees\CalculatorTest

/home/barney/projects/matchbot/tests/Application/Fees/CalculatorTest.php:48

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] Identical
Application/Fees/Calculator.php:53:9
         $giftAidFee = '0.00';
         $feeAmountFixed = '0.00';
 
-        if ($this->feePercentageOverride === null) {
+        if ($this->feePercentageOverride !== null) {
             // Standard, dynamic fee model. Typically includes fixed amount. Historically may include
             // a fee on Gift Aid. May vary by card type & country.
killedBy: MatchBot\Tests\Application\Fees\CalculatorTest::testStripeUKCardGBPDonation
statusReason: 1) MatchBot\Tests\Application\Fees\CalculatorTest::testStripeUKCardGBPDonation
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
-'2.05'
+'0.00'

[Killed] UnwrapStrToUpper
Application/Fees/Calculator.php:57:13
             // Standard, dynamic fee model. Typically includes fixed amount. Historically may include
             // a fee on Gift Aid. May vary by card type & country.
 
-            $currencyCode = strtoupper($this->currencyCode); // Just in case (Stripe use lowercase internally).
+            $currencyCode = $this->currencyCode;
             if (array_key_exists($currencyCode, $this->pspFeeSettings['fixed'])) {
                 $feeAmountFixed = $this->pspFeeSettings['fixed'][$currencyCode];
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

..............................                                    30 / 30 (100%)

Time: 00:00.076, Memory: 20.00 MB

OK (30 tests, 97 assertions)

[Killed] IfNegation
Application/Fees/Calculator.php:58:13
             // a fee on Gift Aid. May vary by card type & country.
 
             $currencyCode = strtoupper($this->currencyCode); // Just in case (Stripe use lowercase internally).
-            if (array_key_exists($currencyCode, $this->pspFeeSettings['fixed'])) {
-                $feeAmountFixed = $this->pspFeeSettings['fixed'][$currencyCode];
-            } else {
-                $feeAmountFixed = $this->pspFeeSettings['fixed']['default'];
-            }
+            if (!array_key_exists($currencyCode, $this->pspFeeSettings['fixed'])) {
 
             $feeRatio = bcdiv($this->pspFeeSettings['main_percentage_standard'], '100', 3);
killedBy: MatchBot\Tests\Application\Fees\CalculatorTest::testStripeUKCardGBPDonation
statusReason: 1) MatchBot\Tests\Application\Fees\CalculatorTest::testStripeUKCardGBPDonation
Undefined array key "GBP"

/home/barney/projects/matchbot/src/Application/Fees/Calculator.php:46
/home/barney/projects/matchbot/tests/Application/Fees/CalculatorTest.php:48

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] DecrementInteger
Application/Fees/Calculator.php:64:13
                 $feeAmountFixed = $this->pspFeeSettings['fixed']['default'];
             }
 
-            $feeRatio = bcdiv($this->pspFeeSettings['main_percentage_standard'], '100', 3);
+            $feeRatio = bcdiv($this->pspFeeSettings['main_percentage_standard'], '100', 2);
             if (
                 isset($this->pspFeeSettings['main_percentage_amex_or_non_uk_eu']) &&
killedBy: MatchBot\Tests\Application\Fees\CalculatorTest::testStripeUKCardGBPDonation
statusReason: 1) MatchBot\Tests\Application\Fees\CalculatorTest::testStripeUKCardGBPDonation
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
-'2.05'
+'1.43'

[Killed] IncrementInteger
Application/Fees/Calculator.php:64:13
                 $feeAmountFixed = $this->pspFeeSettings['fixed']['default'];
             }
 
-            $feeRatio = bcdiv($this->pspFeeSettings['main_percentage_standard'], '100', 3);
+            $feeRatio = bcdiv($this->pspFeeSettings['main_percentage_standard'], '100', 4);
             if (
                 isset($this->pspFeeSettings['main_percentage_amex_or_non_uk_eu']) &&
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

..............................                                    30 / 30 (100%)

Time: 00:00.071, Memory: 20.00 MB

OK (30 tests, 97 assertions)

[Killed] LogicalAnd
Application/Fees/Calculator.php:66:17
 
             $feeRatio = bcdiv($this->pspFeeSettings['main_percentage_standard'], '100', 3);
             if (
-                isset($this->pspFeeSettings['main_percentage_amex_or_non_uk_eu']) &&
-                ($this->cardBrand === 'amex' || !$this->isEU($this->cardCountry))
+                if (isset($this->pspFeeSettings['main_percentage_amex_or_non_uk_eu']) || ($this->cardBrand === 'amex' || !$this->isEU($this->cardCountry))) {
             ) {
                 $feeRatio = bcdiv($this->pspFeeSettings['main_percentage_amex_or_non_uk_eu'], '100', 3);
killedBy: MatchBot\Tests\Application\Fees\CalculatorTest::testStripeUKCardGBPDonation
statusReason: 1) MatchBot\Tests\Application\Fees\CalculatorTest::testStripeUKCardGBPDonation
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
-'2.05'
+'4.14'

[Killed] LogicalAndNegation
Application/Fees/Calculator.php:66:17
 
             $feeRatio = bcdiv($this->pspFeeSettings['main_percentage_standard'], '100', 3);
             if (
-                isset($this->pspFeeSettings['main_percentage_amex_or_non_uk_eu']) &&
-                ($this->cardBrand === 'amex' || !$this->isEU($this->cardCountry))
+                if (!(isset($this->pspFeeSettings['main_percentage_amex_or_non_uk_eu']) && ($this->cardBrand === 'amex' || !$this->isEU($this->cardCountry)))) {
             ) {
                 $feeRatio = bcdiv($this->pspFeeSettings['main_percentage_amex_or_non_uk_eu'], '100', 3);
killedBy: MatchBot\Tests\Application\Fees\CalculatorTest::testStripeUKCardGBPDonation
statusReason: 1) MatchBot\Tests\Application\Fees\CalculatorTest::testStripeUKCardGBPDonation
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
-'2.05'
+'4.14'

[Killed] LogicalOrAllSubExprNegation
Application/Fees/Calculator.php:67:17
             $feeRatio = bcdiv($this->pspFeeSettings['main_percentage_standard'], '100', 3);
             if (
                 isset($this->pspFeeSettings['main_percentage_amex_or_non_uk_eu']) &&
-                ($this->cardBrand === 'amex' || !$this->isEU($this->cardCountry))
+                if (isset($this->pspFeeSettings['main_percentage_amex_or_non_uk_eu']) && (!($this->cardBrand === 'amex') || $this->isEU($this->cardCountry))) {
             ) {
                 $feeRatio = bcdiv($this->pspFeeSettings['main_percentage_amex_or_non_uk_eu'], '100', 3);
killedBy: MatchBot\Tests\Application\Fees\CalculatorTest::testStripeUKCardGBPDonation
statusReason: 1) MatchBot\Tests\Application\Fees\CalculatorTest::testStripeUKCardGBPDonation
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
-'2.05'
+'4.14'

[Killed] Identical
Application/Fees/Calculator.php:67:17
             $feeRatio = bcdiv($this->pspFeeSettings['main_percentage_standard'], '100', 3);
             if (
                 isset($this->pspFeeSettings['main_percentage_amex_or_non_uk_eu']) &&
-                ($this->cardBrand === 'amex' || !$this->isEU($this->cardCountry))
+                if (isset($this->pspFeeSettings['main_percentage_amex_or_non_uk_eu']) && ($this->cardBrand !== 'amex' || !$this->isEU($this->cardCountry))) {
             ) {
                 $feeRatio = bcdiv($this->pspFeeSettings['main_percentage_amex_or_non_uk_eu'], '100', 3);
killedBy: MatchBot\Tests\Application\Fees\CalculatorTest::testStripeUKCardGBPDonation
statusReason: 1) MatchBot\Tests\Application\Fees\CalculatorTest::testStripeUKCardGBPDonation
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
-'2.05'
+'4.14'

[Killed] BCMath
Application/Fees/Calculator.php:69:17
                 isset($this->pspFeeSettings['main_percentage_amex_or_non_uk_eu']) &&
                 ($this->cardBrand === 'amex' || !$this->isEU($this->cardCountry))
             ) {
-                $feeRatio = bcdiv($this->pspFeeSettings['main_percentage_amex_or_non_uk_eu'], '100', 3);
+                $feeRatio = (string) ($this->pspFeeSettings['main_percentage_amex_or_non_uk_eu'] / '100');
             }
 
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

..............................                                    30 / 30 (100%)

Time: 00:00.079, Memory: 20.00 MB

OK (30 tests, 97 assertions)

[Killed] DecrementInteger
Application/Fees/Calculator.php:69:17
                 isset($this->pspFeeSettings['main_percentage_amex_or_non_uk_eu']) &&
                 ($this->cardBrand === 'amex' || !$this->isEU($this->cardCountry))
             ) {
-                $feeRatio = bcdiv($this->pspFeeSettings['main_percentage_amex_or_non_uk_eu'], '100', 3);
+                $feeRatio = bcdiv($this->pspFeeSettings['main_percentage_amex_or_non_uk_eu'], '100', 2);
             }
 
killedBy: MatchBot\Tests\Application\Fees\CalculatorTest::testStripeUSCardGBPDonation
statusReason: 1) MatchBot\Tests\Application\Fees\CalculatorTest::testStripeUSCardGBPDonation
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
-'4.14'
+'3.89'

[Killed] BCMath
Application/Fees/Calculator.php:74:17
 
             if ($this->hasGiftAid) {
                 // 4 points needed to handle overall percentages of GA fee like 0.75% == 0.0075 ratio.
-                $giftAidFee = bcmul(
-                    bcdiv($this->pspFeeSettings['gift_aid_percentage'], '100', 4),
-                    $this->amount,
-                    3,
-                );
+                $giftAidFee = (string) (bcdiv($this->pspFeeSettings['gift_aid_percentage'], '100', 4) * $this->amount);
             }
         } else {
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

..............................                                    30 / 30 (100%)

Time: 00:00.076, Memory: 20.00 MB

OK (30 tests, 97 assertions)

[Killed] IncrementInteger
Application/Fees/Calculator.php:75:21
             if ($this->hasGiftAid) {
                 // 4 points needed to handle overall percentages of GA fee like 0.75% == 0.0075 ratio.
                 $giftAidFee = bcmul(
-                    bcdiv($this->pspFeeSettings['gift_aid_percentage'], '100', 4),
+                    $giftAidFee = bcmul(bcdiv($this->pspFeeSettings['gift_aid_percentage'], '100', 5), $this->amount, 3);
                     $this->amount,
                     3,
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

..............................                                    30 / 30 (100%)

Time: 00:00.076, Memory: 20.00 MB

OK (30 tests, 97 assertions)

[Killed] DecrementInteger
Application/Fees/Calculator.php:75:21
             if ($this->hasGiftAid) {
                 // 4 points needed to handle overall percentages of GA fee like 0.75% == 0.0075 ratio.
                 $giftAidFee = bcmul(
-                    bcdiv($this->pspFeeSettings['gift_aid_percentage'], '100', 4),
+                    $giftAidFee = bcmul(bcdiv($this->pspFeeSettings['gift_aid_percentage'], '100', 3), $this->amount, 3);
                     $this->amount,
                     3,
killedBy: MatchBot\Tests\Application\Fees\CalculatorTest::testStripeUSCardGBPDonationWithTbgClaimingGiftAid
statusReason: 1) MatchBot\Tests\Application\Fees\CalculatorTest::testStripeUSCardGBPDonationWithTbgClaimingGiftAid
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
-'4.15'
+'4.10'

[Killed] IncrementInteger
Application/Fees/Calculator.php:77:21
                 $giftAidFee = bcmul(
                     bcdiv($this->pspFeeSettings['gift_aid_percentage'], '100', 4),
                     $this->amount,
-                    3,
+                    $giftAidFee = bcmul(bcdiv($this->pspFeeSettings['gift_aid_percentage'], '100', 4), $this->amount, 4);
                 );
             }
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

..............................                                    30 / 30 (100%)

Time: 00:00.074, Memory: 20.00 MB

OK (30 tests, 97 assertions)

[Killed] DecrementInteger
Application/Fees/Calculator.php:77:21
                 $giftAidFee = bcmul(
                     bcdiv($this->pspFeeSettings['gift_aid_percentage'], '100', 4),
                     $this->amount,
-                    3,
+                    $giftAidFee = bcmul(bcdiv($this->pspFeeSettings['gift_aid_percentage'], '100', 4), $this->amount, 2);
                 );
             }
killedBy: MatchBot\Tests\Domain\DonationRepositoryTest::testStripeAmountForCharityWithoutTipWhenTbgClaimingGiftAid
statusReason: 1) MatchBot\Tests\Domain\DonationRepositoryTest::testStripeAmountForCharityWithoutTipWhenTbgClaimingGiftAid
Failed asserting that 2241 matches expected 2242.

/home/barney/projects/matchbot/tests/Domain/DonationRepositoryTest.php:344

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] BCMath
Application/Fees/Calculator.php:83:13
         } else {
             // Alternative fixed % model. `$giftAidFee` and `$feeAmountFixed` remain zero.
             // Amount given is inclusive of any tax, so subtract it to get a net value.
-            $vatRatio = bcdiv($this->getFeeVatPercentage(), '100', 3);
+            $vatRatio = (string) ($this->getFeeVatPercentage() / '100');
             $vatRatioPlusOne = bcadd('1', $vatRatio, 2);
             $grossFeeRatio = bcdiv((string)$this->feePercentageOverride, '100', 3);
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

..............................                                    30 / 30 (100%)

Time: 00:00.080, Memory: 20.00 MB

OK (30 tests, 97 assertions)

[Killed] IncrementInteger
Application/Fees/Calculator.php:83:13
         } else {
             // Alternative fixed % model. `$giftAidFee` and `$feeAmountFixed` remain zero.
             // Amount given is inclusive of any tax, so subtract it to get a net value.
-            $vatRatio = bcdiv($this->getFeeVatPercentage(), '100', 3);
+            $vatRatio = bcdiv($this->getFeeVatPercentage(), '100', 4);
             $vatRatioPlusOne = bcadd('1', $vatRatio, 2);
             $grossFeeRatio = bcdiv((string)$this->feePercentageOverride, '100', 3);
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

..............................                                    30 / 30 (100%)

Time: 00:00.073, Memory: 20.00 MB

OK (30 tests, 97 assertions)

[Killed] DecrementInteger
Application/Fees/Calculator.php:84:13
             // Alternative fixed % model. `$giftAidFee` and `$feeAmountFixed` remain zero.
             // Amount given is inclusive of any tax, so subtract it to get a net value.
             $vatRatio = bcdiv($this->getFeeVatPercentage(), '100', 3);
-            $vatRatioPlusOne = bcadd('1', $vatRatio, 2);
+            $vatRatioPlusOne = bcadd('1', $vatRatio, 1);
             $grossFeeRatio = bcdiv((string)$this->feePercentageOverride, '100', 3);
 
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

..............................                                    30 / 30 (100%)

Time: 00:00.067, Memory: 20.00 MB

OK (30 tests, 97 assertions)

[Killed] IncrementInteger
Application/Fees/Calculator.php:84:13
             // Alternative fixed % model. `$giftAidFee` and `$feeAmountFixed` remain zero.
             // Amount given is inclusive of any tax, so subtract it to get a net value.
             $vatRatio = bcdiv($this->getFeeVatPercentage(), '100', 3);
-            $vatRatioPlusOne = bcadd('1', $vatRatio, 2);
+            $vatRatioPlusOne = bcadd('1', $vatRatio, 3);
             $grossFeeRatio = bcdiv((string)$this->feePercentageOverride, '100', 3);
 
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

..............................                                    30 / 30 (100%)

Time: 00:00.066, Memory: 20.00 MB

OK (30 tests, 97 assertions)

[Killed] IncrementInteger
Application/Fees/Calculator.php:85:13
             // Amount given is inclusive of any tax, so subtract it to get a net value.
             $vatRatio = bcdiv($this->getFeeVatPercentage(), '100', 3);
             $vatRatioPlusOne = bcadd('1', $vatRatio, 2);
-            $grossFeeRatio = bcdiv((string)$this->feePercentageOverride, '100', 3);
+            $grossFeeRatio = bcdiv((string) $this->feePercentageOverride, '100', 4);
 
             $feeRatioBeforeOffest = bcdiv($grossFeeRatio, $vatRatioPlusOne, 10);
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

..............................                                    30 / 30 (100%)

Time: 00:00.067, Memory: 20.00 MB

OK (30 tests, 97 assertions)

[Killed] DecrementInteger
Application/Fees/Calculator.php:85:13
             // Amount given is inclusive of any tax, so subtract it to get a net value.
             $vatRatio = bcdiv($this->getFeeVatPercentage(), '100', 3);
             $vatRatioPlusOne = bcadd('1', $vatRatio, 2);
-            $grossFeeRatio = bcdiv((string)$this->feePercentageOverride, '100', 3);
+            $grossFeeRatio = bcdiv((string) $this->feePercentageOverride, '100', 2);
 
             $feeRatioBeforeOffest = bcdiv($grossFeeRatio, $vatRatioPlusOne, 10);
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

..............................                                    30 / 30 (100%)

Time: 00:00.065, Memory: 20.00 MB

OK (30 tests, 97 assertions)

[Killed] DecrementInteger
Application/Fees/Calculator.php:87:13
             $vatRatioPlusOne = bcadd('1', $vatRatio, 2);
             $grossFeeRatio = bcdiv((string)$this->feePercentageOverride, '100', 3);
 
-            $feeRatioBeforeOffest = bcdiv($grossFeeRatio, $vatRatioPlusOne, 10);
+            $feeRatioBeforeOffest = bcdiv($grossFeeRatio, $vatRatioPlusOne, 9);
             // To get rounding correct (by standard accounting calculations), we need to 'round up'
             // slightly so that e.g a ratio of 0.0416666666 (as resulting from UK 20% rate) becomes
killedBy: MatchBot\Tests\Application\Fees\CalculatorTest::testStripeUKCardGBPDonationWithFeeCover
statusReason: 1) MatchBot\Tests\Application\Fees\CalculatorTest::testStripeUKCardGBPDonationWithFeeCover
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
-'5.13'
+'5.12'

[Killed] IncrementInteger
Application/Fees/Calculator.php:87:13
             $vatRatioPlusOne = bcadd('1', $vatRatio, 2);
             $grossFeeRatio = bcdiv((string)$this->feePercentageOverride, '100', 3);
 
-            $feeRatioBeforeOffest = bcdiv($grossFeeRatio, $vatRatioPlusOne, 10);
+            $feeRatioBeforeOffest = bcdiv($grossFeeRatio, $vatRatioPlusOne, 11);
             // To get rounding correct (by standard accounting calculations), we need to 'round up'
             // slightly so that e.g a ratio of 0.0416666666 (as resulting from UK 20% rate) becomes
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

..............................                                    30 / 30 (100%)

Time: 00:00.069, Memory: 20.00 MB

OK (30 tests, 97 assertions)

[Killed] IncrementInteger
Application/Fees/Calculator.php:91:13
             // To get rounding correct (by standard accounting calculations), we need to 'round up'
             // slightly so that e.g a ratio of 0.0416666666 (as resulting from UK 20% rate) becomes
             // 0.0416666667.
-            $feeRatio = bcadd($feeRatioBeforeOffest, '0.0000000001', 10);
+            $feeRatio = bcadd($feeRatioBeforeOffest, '0.0000000001', 11);
         }
 
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

..............................                                    30 / 30 (100%)

Time: 00:00.066, Memory: 20.00 MB

OK (30 tests, 97 assertions)

[Killed] DecrementInteger
Application/Fees/Calculator.php:91:13
             // To get rounding correct (by standard accounting calculations), we need to 'round up'
             // slightly so that e.g a ratio of 0.0416666666 (as resulting from UK 20% rate) becomes
             // 0.0416666667.
-            $feeRatio = bcadd($feeRatioBeforeOffest, '0.0000000001', 10);
+            $feeRatio = bcadd($feeRatioBeforeOffest, '0.0000000001', 9);
         }
 
killedBy: MatchBot\Tests\Application\Fees\CalculatorTest::testStripeUKCardGBPDonationWithFeeCover
statusReason: 1) MatchBot\Tests\Application\Fees\CalculatorTest::testStripeUKCardGBPDonationWithFeeCover
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
-'5.13'
+'5.12'

[Killed] IncrementInteger
Application/Fees/Calculator.php:98:13
         // in the normal mathematical way we need to start with 3 d.p. scale and round with a
         // workaround.
         $feeAmountFromPercentageComponent = $this->roundAmount(
-            bcmul($this->amount, $feeRatio, 3)
+            $feeAmountFromPercentageComponent = $this->roundAmount(bcmul($this->amount, $feeRatio, 4));
         );
 
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

..............................                                    30 / 30 (100%)

Time: 00:00.067, Memory: 20.00 MB

OK (30 tests, 97 assertions)

[Killed] BCMath
Application/Fees/Calculator.php:98:13
         // in the normal mathematical way we need to start with 3 d.p. scale and round with a
         // workaround.
         $feeAmountFromPercentageComponent = $this->roundAmount(
-            bcmul($this->amount, $feeRatio, 3)
+            $feeAmountFromPercentageComponent = $this->roundAmount((string) ($this->amount * $feeRatio));
         );
 
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

..............................                                    30 / 30 (100%)

Time: 00:00.066, Memory: 20.00 MB

OK (30 tests, 97 assertions)

[Killed] BCMath
Application/Fees/Calculator.php:104:13
         // Charity fee calculated as:
         // Fixed fee amount + proportion of base donation amount + Gift Aid fee (for Stripe this is £0.00)
         return $this->roundAmount(
-            bcadd(bcadd($feeAmountFixed, $feeAmountFromPercentageComponent, 3), $giftAidFee, 3)
+            return $this->roundAmount((string) (bcadd($feeAmountFixed, $feeAmountFromPercentageComponent, 3) + $giftAidFee));
         );
     }
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

..............................                                    30 / 30 (100%)

Time: 00:00.070, Memory: 20.00 MB

OK (30 tests, 97 assertions)

[Killed] BCMath
Application/Fees/Calculator.php:104:13
         // Charity fee calculated as:
         // Fixed fee amount + proportion of base donation amount + Gift Aid fee (for Stripe this is £0.00)
         return $this->roundAmount(
-            bcadd(bcadd($feeAmountFixed, $feeAmountFromPercentageComponent, 3), $giftAidFee, 3)
+            return $this->roundAmount(bcadd((string) ($feeAmountFixed + $feeAmountFromPercentageComponent), $giftAidFee, 3));
         );
     }
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

..............................                                    30 / 30 (100%)

Time: 00:00.062, Memory: 20.00 MB

OK (30 tests, 97 assertions)

[Killed] PublicVisibility
Application/Fees/Calculator.php:108:5
         );
     }
 
-    public function getFeeVat(): string
+    protected function getFeeVat() : string
     {
         // We need to handle flat, inc-VAT fee logic differently to avoid rounding issues.
killedBy: MatchBot\Tests\Application\Fees\CalculatorTest::testStripeUKCardGBPDonation
statusReason: 1) MatchBot\Tests\Application\Fees\CalculatorTest::testStripeUKCardGBPDonation
Error: Call to protected method MatchBot\Application\Fees\Calculator::getFeeVat() from scope MatchBot\Tests\Application\Fees\CalculatorTest

/home/barney/projects/matchbot/tests/Application/Fees/CalculatorTest.php:49

ERRORS!
Tests: 1, Assertions: 1, Errors: 1.

[Killed] DecrementInteger
Application/Fees/Calculator.php:115:13
         // the VAT amount. This is not necessarily the same result as adding the VAT % to
         // the *rounded* net fee.
         if ($this->feePercentageOverride) {
-            $grossFeeRatio = bcdiv((string)$this->feePercentageOverride, '100', 3);
+            $grossFeeRatio = bcdiv((string) $this->feePercentageOverride, '100', 2);
             $grossFeeAmount = $this->roundAmount(bcmul($this->amount, $grossFeeRatio, 3));
 
killedBy: MatchBot\Tests\Domain\DonationRepositoryTest::testStripeAmountForCharityWithFeeCover
statusReason: 1) MatchBot\Tests\Domain\DonationRepositoryTest::testStripeAmountForCharityWithFeeCover
Failed asserting that 3951 matches expected 4444.

/home/barney/projects/matchbot/tests/Domain/DonationRepositoryTest.php:265

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] BCMath
Application/Fees/Calculator.php:115:13
         // the VAT amount. This is not necessarily the same result as adding the VAT % to
         // the *rounded* net fee.
         if ($this->feePercentageOverride) {
-            $grossFeeRatio = bcdiv((string)$this->feePercentageOverride, '100', 3);
+            $grossFeeRatio = (string) ((string) $this->feePercentageOverride / '100');
             $grossFeeAmount = $this->roundAmount(bcmul($this->amount, $grossFeeRatio, 3));
 
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

..............................                                    30 / 30 (100%)

Time: 00:00.064, Memory: 20.00 MB

OK (30 tests, 97 assertions)

[Killed] IncrementInteger
Application/Fees/Calculator.php:116:13
         // the *rounded* net fee.
         if ($this->feePercentageOverride) {
             $grossFeeRatio = bcdiv((string)$this->feePercentageOverride, '100', 3);
-            $grossFeeAmount = $this->roundAmount(bcmul($this->amount, $grossFeeRatio, 3));
+            $grossFeeAmount = $this->roundAmount(bcmul($this->amount, $grossFeeRatio, 4));
 
             return bcsub($grossFeeAmount, $this->getCoreFee(), 2);
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

..............................                                    30 / 30 (100%)

Time: 00:00.064, Memory: 20.00 MB

OK (30 tests, 97 assertions)
