[Killed] BCMath
Application/Fees/Calculator.php:116:13
         // the *rounded* net fee.
         if ($this->feePercentageOverride) {
             $grossFeeRatio = bcdiv((string)$this->feePercentageOverride, '100', 3);
-            $grossFeeAmount = $this->roundAmount(bcmul($this->amount, $grossFeeRatio, 3));
+            $grossFeeAmount = $this->roundAmount((string) ($this->amount * $grossFeeRatio));
 
             return bcsub($grossFeeAmount, $this->getCoreFee(), 2);
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

..............................                                    30 / 30 (100%)

Time: 00:00.064, Memory: 20.00 MB

OK (30 tests, 97 assertions)

[Killed] DecrementInteger
Application/Fees/Calculator.php:118:13
             $grossFeeRatio = bcdiv((string)$this->feePercentageOverride, '100', 3);
             $grossFeeAmount = $this->roundAmount(bcmul($this->amount, $grossFeeRatio, 3));
 
-            return bcsub($grossFeeAmount, $this->getCoreFee(), 2);
+            return bcsub($grossFeeAmount, $this->getCoreFee(), 1);
         }
 
killedBy: MatchBot\Tests\Application\Fees\CalculatorTest::testStripeUKCardGBPDonationWithFeeCover
statusReason: 1) MatchBot\Tests\Application\Fees\CalculatorTest::testStripeUKCardGBPDonationWithFeeCover
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
-'1.02'
+'1.0'

[Killed] IncrementInteger
Application/Fees/Calculator.php:118:13
             $grossFeeRatio = bcdiv((string)$this->feePercentageOverride, '100', 3);
             $grossFeeAmount = $this->roundAmount(bcmul($this->amount, $grossFeeRatio, 3));
 
-            return bcsub($grossFeeAmount, $this->getCoreFee(), 2);
+            return bcsub($grossFeeAmount, $this->getCoreFee(), 3);
         }
 
killedBy: MatchBot\Tests\Application\Fees\CalculatorTest::testStripeUKCardGBPDonationWithFeeCover
statusReason: 1) MatchBot\Tests\Application\Fees\CalculatorTest::testStripeUKCardGBPDonationWithFeeCover
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
-'1.02'
+'1.020'

[Killed] BCMath
Application/Fees/Calculator.php:122:9
         }
 
         // Standard, non-flat-fee logic.
-        $vatRatio = bcdiv($this->getFeeVatPercentage(), '100', 3);
+        $vatRatio = (string) ($this->getFeeVatPercentage() / '100');
 
         return $this->roundAmount(bcmul($vatRatio, $this->getCoreFee(), 3));
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

..............................                                    30 / 30 (100%)

Time: 00:00.062, Memory: 20.00 MB

OK (30 tests, 97 assertions)

[Killed] DecrementInteger
Application/Fees/Calculator.php:122:9
         }
 
         // Standard, non-flat-fee logic.
-        $vatRatio = bcdiv($this->getFeeVatPercentage(), '100', 3);
+        $vatRatio = bcdiv($this->getFeeVatPercentage(), '100', 2);
 
         return $this->roundAmount(bcmul($vatRatio, $this->getCoreFee(), 3));
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

..............................                                    30 / 30 (100%)

Time: 00:00.062, Memory: 20.00 MB

OK (30 tests, 97 assertions)

[Killed] IncrementInteger
Application/Fees/Calculator.php:124:9
         // Standard, non-flat-fee logic.
         $vatRatio = bcdiv($this->getFeeVatPercentage(), '100', 3);
 
-        return $this->roundAmount(bcmul($vatRatio, $this->getCoreFee(), 3));
+        return $this->roundAmount(bcmul($vatRatio, $this->getCoreFee(), 4));
     }
 
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

..............................                                    30 / 30 (100%)

Time: 00:00.062, Memory: 20.00 MB

OK (30 tests, 97 assertions)

[Killed] DecrementInteger
Application/Fees/Calculator.php:124:9
         // Standard, non-flat-fee logic.
         $vatRatio = bcdiv($this->getFeeVatPercentage(), '100', 3);
 
-        return $this->roundAmount(bcmul($vatRatio, $this->getCoreFee(), 3));
+        return $this->roundAmount(bcmul($vatRatio, $this->getCoreFee(), 2));
     }
 
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

..............................                                    30 / 30 (100%)

Time: 00:00.063, Memory: 20.00 MB

OK (30 tests, 97 assertions)

[Killed] ArrayItemRemoval
Application/Fees/Calculator.php:134:9
         }
 
         $currencyCode = strtoupper($this->currencyCode); // Just in case (Stripe use lowercase internally).
-        $currenciesIncurringFeeVat = ['EUR', 'GBP'];
+        $currenciesIncurringFeeVat = ['GBP'];
         if (!in_array($currencyCode, $currenciesIncurringFeeVat, true)) {
             return '0';
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

..............................                                    30 / 30 (100%)

Time: 00:00.062, Memory: 20.00 MB

OK (30 tests, 97 assertions)

[Killed] LogicalNot
Application/Fees/Calculator.php:135:9
 
         $currencyCode = strtoupper($this->currencyCode); // Just in case (Stripe use lowercase internally).
         $currenciesIncurringFeeVat = ['EUR', 'GBP'];
-        if (!in_array($currencyCode, $currenciesIncurringFeeVat, true)) {
+        if (in_array($currencyCode, $currenciesIncurringFeeVat, true)) {
             return '0';
         }
killedBy: MatchBot\Tests\Application\Fees\CalculatorTest::testStripeUKCardGBPDonation
statusReason: 1) MatchBot\Tests\Application\Fees\CalculatorTest::testStripeUKCardGBPDonation
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
-'0.41'
+'0.00'

[Killed] GreaterThanOrEqualToNegotiation
Application/Fees/Calculator.php:140:9
         }
 
         $switchDate = new \DateTime($this->pspFeeSettings['vat_live_date']);
-        if (new \DateTime('now') >= $switchDate) {
+        if (new \DateTime('now') < $switchDate) {
             return $this->pspFeeSettings['vat_percentage_live'];
         }
killedBy: MatchBot\Tests\Application\Fees\CalculatorTest::testStripeUKCardGBPDonation
statusReason: 1) MatchBot\Tests\Application\Fees\CalculatorTest::testStripeUKCardGBPDonation
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
-'0.41'
+'0.00'

[Killed] GreaterThanOrEqualTo
Application/Fees/Calculator.php:140:9
         }
 
         $switchDate = new \DateTime($this->pspFeeSettings['vat_live_date']);
-        if (new \DateTime('now') >= $switchDate) {
+        if (new \DateTime('now') > $switchDate) {
             return $this->pspFeeSettings['vat_percentage_live'];
         }
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

..............................                                    30 / 30 (100%)

Time: 00:00.063, Memory: 20.00 MB

OK (30 tests, 97 assertions)

[Killed] BCMath
Application/Fees/Calculator.php:159:9
     {
         $e = '1000'; // Base 10 ^ 3
 
-        return bcdiv(bcadd(bcmul($amount, $e, 0), '5'), $e, 2);
+        return bcdiv((string) (bcmul($amount, $e, 0) + '5'), $e, 2);
     }
 
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

..............................                                    30 / 30 (100%)

Time: 00:00.063, Memory: 20.00 MB

OK (30 tests, 97 assertions)

[Killed] DecrementInteger
Application/Fees/Calculator.php:159:9
     {
         $e = '1000'; // Base 10 ^ 3
 
-        return bcdiv(bcadd(bcmul($amount, $e, 0), '5'), $e, 2);
+        return bcdiv(bcadd(bcmul($amount, $e, -1), '5'), $e, 2);
     }
 
killedBy: MatchBot\Tests\Application\Fees\CalculatorTest::testStripeUKCardGBPDonation
statusReason: 1) MatchBot\Tests\Application\Fees\CalculatorTest::testStripeUKCardGBPDonation
ValueError: bcmul(): Argument #3 ($scale) must be between 0 and 2147483647

/home/barney/projects/matchbot/src/Application/Fees/Calculator.php:124
/home/barney/projects/matchbot/src/Application/Fees/Calculator.php:73
/home/barney/projects/matchbot/tests/Application/Fees/CalculatorTest.php:48

ERRORS!

[Killed] Identical
Application/Fees/Calculator.php:168:9
      */
     #[Pure] private function isEU(?string $cardCountry): bool
     {
-        if ($cardCountry === null) {
+        if ($cardCountry !== null) {
             // Default to 1.5% calculation if card country is not known yet OR remains
             // null because the donation is settled from a Customer's cash balance.
killedBy: MatchBot\Tests\Application\Fees\CalculatorTest::testStripeUSCardGBPDonation
statusReason: 1) MatchBot\Tests\Application\Fees\CalculatorTest::testStripeUSCardGBPDonation
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
-'4.14'
+'2.05'

[Killed] TrueValue
Application/Fees/Calculator.php:171:13
         if ($cardCountry === null) {
             // Default to 1.5% calculation if card country is not known yet OR remains
             // null because the donation is settled from a Customer's cash balance.
-            return true;
+            return false;
         }
 
killedBy: MatchBot\Tests\Domain\DonationRepositoryTest::testStripeAmountForCharityWithTip
statusReason: 1) MatchBot\Tests\Domain\DonationRepositoryTest::testStripeAmountForCharityWithTip
Failed asserting that 4180 matches expected 2501.

/home/barney/projects/matchbot/tests/Domain/DonationRepositoryTest.php:286

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.
