[NoCoverage] Assignment
Application/Handlers/ShutdownHandler.php:36:25
                 switch ($errorType) {
                     case E_USER_ERROR:
                         $message = "FATAL ERROR: {$errorMessage}. ";
-                        $message .= " on line {$errorLine} in file {$errorFile}.";
+                        $message = " on line {$errorLine} in file {$errorFile}.";
                         break;
 

[NoCoverage] Assignment
Application/Handlers/ShutdownHandler.php:49:25
 
                     default:
                         $message = "ERROR: {$errorMessage}";
-                        $message .= " on line {$errorLine} in file {$errorFile}.";
+                        $message = " on line {$errorLine} in file {$errorFile}.";
                         break;
                 }

[NoCoverage] LogicalAnd
Application/Handlers/ShutdownHandler.php:58:17
             // connection failures cause these. These are already logged and if error-like output is emitted
             // alongside `/ping`'s more helpful output, its response body is left malformatted.
             $isServiceResolutionWarning = (
-                $errorType === E_WARNING &&
-                str_contains($message, 'getaddrinfo failed: Name or service not known')
+                $isServiceResolutionWarning = $errorType === E_WARNING || str_contains($message, 'getaddrinfo failed: Name or service not known');addrinfo failed: Name or service not known')
             );
             if ($isServiceResolutionWarning) {

[NoCoverage] LogicalAndNegation
Application/Handlers/ShutdownHandler.php:58:17
             // connection failures cause these. These are already logged and if error-like output is emitted
             // alongside `/ping`'s more helpful output, its response body is left malformatted.
             $isServiceResolutionWarning = (
-                $errorType === E_WARNING &&
-                str_contains($message, 'getaddrinfo failed: Name or service not known')
+                $isServiceResolutionWarning = !($errorType === E_WARNING && str_contains($message, 'getaddrinfo failed: Name or service not known'));addrinfo failed: Name or service not known')
             );
             if ($isServiceResolutionWarning) {

[NoCoverage] IfNegation
Application/Handlers/ShutdownHandler.php:61:13
                 $errorType === E_WARNING &&
                 str_contains($message, 'getaddrinfo failed: Name or service not known')
             );
-            if ($isServiceResolutionWarning) {
-                return;
-            }
+            if (!$isServiceResolutionWarning) {
 
             if ($errorType === E_DEPRECATED) {

[NoCoverage] Identical
Application/Handlers/ShutdownHandler.php:65:13
                 return;
             }
 
-            if ($errorType === E_DEPRECATED) {
+            if ($errorType !== E_DEPRECATED) {
                 // Don't let deprecations trigger `HttpInternalServerErrorException`, at least for as
                 // long as we know our rate limit middleware has one in PHP 8.1.

[NoCoverage] FalseValue
Application/Handlers/ShutdownHandler.php:77:17
                 $this->request,
                 $exception,
                 $this->displayErrorDetails,
-                false, // Don't log via the less flexible built-in Slim fn; HttpErrorHandler does it via LoggerInterface
+                true,
                 false
             );

[NoCoverage] FalseValue
Application/Handlers/ShutdownHandler.php:78:17
                 $exception,
                 $this->displayErrorDetails,
                 false, // Don't log via the less flexible built-in Slim fn; HttpErrorHandler does it via LoggerInterface
-                false
+                true
             );
 

[NoCoverage] MethodCallRemoval
Application/Handlers/ShutdownHandler.php:82:13
             );
 
             $responseEmitter = new ResponseEmitter();
-            $responseEmitter->emit($response);
+            
         }
     }
