[NoCoverage] MethodCallRemoval
Application/Matching/LessThanRequestedAllocatedException.php:24:9
         private string $amountAllocated,
         private string $fundRemainingAmount
     ) {
-        parent::__construct('Less than requested was allocated');
+        
     }
 

[NoCoverage] PublicVisibility
Application/Matching/LessThanRequestedAllocatedException.php:27:5
         parent::__construct('Less than requested was allocated');
     }
 
-    public function getAmountAllocated(): string
+    protected function getAmountAllocated() : string
     {
         return $this->amountAllocated;
