[Killed] PublicVisibility
Application/Messenger/StripePayout.php:13:5
     public string $connectAccountId;
     public string $payoutId;
 
-    public function getConnectAccountId(): string
+    protected function getConnectAccountId() : string
     {
         return $this->connectAccountId;
killedBy: MatchBot\Tests\Application\Messenger\Handler\StripePayoutHandlerTest::testUnrecognisedChargeId
statusReason: 1) MatchBot\Tests\Application\Messenger\Handler\StripePayoutHandlerTest::testUnrecognisedChargeId
Error: Call to protected method MatchBot\Application\Messenger\StripePayout::getConnectAccountId() from scope MatchBot\Application\Messenger\Handler\StripePayoutHandler

/home/barney/projects/matchbot/src/Application/Messenger/Handler/StripePayoutHandler.php:38
/home/barney/projects/matchbot/tests/App

[Killed] PublicVisibility
Application/Messenger/StripePayout.php:18:5
         return $this->connectAccountId;
     }
 
-    public function setConnectAccountId(string $connectAccountId): self
+    protected function setConnectAccountId(string $connectAccountId) : self
     {
         $this->connectAccountId = $connectAccountId;
killedBy: MatchBot\Tests\Application\Messenger\Handler\StripePayoutHandlerTest::testUnrecognisedChargeId
statusReason: 1) MatchBot\Tests\Application\Messenger\Handler\StripePayoutHandlerTest::testUnrecognisedChargeId
Error: Call to protected method MatchBot\Application\Messenger\StripePayout::setConnectAccountId() from scope MatchBot\Tests\Application\Messenger\Handler\StripePayoutHandlerTest

/home/barney/projects/matchbot/tests/Application/Messenger/Handler/StripePayoutHandlerTest.php:118

ERRORS!
Tests: 1, Asse

[Killed] PublicVisibility
Application/Messenger/StripePayout.php:25:5
         return $this;
     }
 
-    public function getPayoutId(): string
+    protected function getPayoutId() : string
     {
         return $this->payoutId;
killedBy: MatchBot\Tests\Application\Messenger\Handler\StripePayoutHandlerTest::testUnrecognisedChargeId
statusReason: 1) MatchBot\Tests\Application\Messenger\Handler\StripePayoutHandlerTest::testUnrecognisedChargeId
Error: Call to protected method MatchBot\Application\Messenger\StripePayout::getPayoutId() from scope MatchBot\Application\Messenger\Handler\StripePayoutHandler

/home/barney/projects/matchbot/src/Application/Messenger/Handler/StripePayoutHandler.php:39
/home/barney/projects/matchbot/tests/Application

[Killed] PublicVisibility
Application/Messenger/StripePayout.php:30:5
         return $this->payoutId;
     }
 
-    public function setPayoutId(string $payoutId): self
+    protected function setPayoutId(string $payoutId) : self
     {
         $this->payoutId = $payoutId;
killedBy: MatchBot\Tests\Application\Messenger\Handler\StripePayoutHandlerTest::testUnrecognisedChargeId
statusReason: 1) MatchBot\Tests\Application\Messenger\Handler\StripePayoutHandlerTest::testUnrecognisedChargeId
Error: Call to protected method MatchBot\Application\Messenger\StripePayout::setPayoutId() from scope MatchBot\Tests\Application\Messenger\Handler\StripePayoutHandlerTest

/home/barney/projects/matchbot/tests/Application/Messenger/Handler/StripePayoutHandlerTest.php:119

ERRORS!
Tests: 1, Assertions:
