[Killed] Coalesce
Application/Persistence/RetrySafeEntityManager.php:48:9
         private LoggerInterface $logger,
         \Closure $entityManagerFactory = null,
     ) {
-        $this->entityManagerFactory = $entityManagerFactory ??
-            fn (): EntityManager => EntityManager::create($connectionSettings, $this->ormConfig);
+        $this->entityManagerFactory = fn(): EntityManager => EntityManager::create($connectionSettings, $this->ormConfig) ?? $entityManagerFactory;nectionSettings, $this->ormConfig);
 
         $this->entityManager = $this->buildEntityManager();
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

.................................................                 49 / 49 (100%)

Time: 00:00.196, Memory: 34.00 MB

OK (49 tests, 345 assertions)

[Killed] MethodCallRemoval
Application/Persistence/RetrySafeEntityManager.php:52:9
             fn (): EntityManager => EntityManager::create($connectionSettings, $this->ormConfig);
 
         $this->entityManager = $this->buildEntityManager();
-        parent::__construct($this->entityManager);
+        
     }
 
killedBy: MatchBot\Tests\Monolog\Processor\AwsTraceIdProcessorTest::testContextAdded
statusReason: 1) MatchBot\Tests\Monolog\Processor\AwsTraceIdProcessorTest::testContextAdded
Error: Call to a member function getConnection() on null

/home/barney/projects/matchbot/vendor/doctrine/orm/lib/Doctrine/ORM/Decorator/EntityManagerDecorator.php:38
/home/barney/projects/matchbot/src/Application/Actions/Status.php:48
/home/barney/projects/matchbot/src/Application/Actions/Action.php:34
/home/barney/proje

[NoCoverage] DecrementInteger
Application/Persistence/RetrySafeEntityManager.php:62:9
      */
     public function transactional($func): mixed
     {
-        $retries = 0;
+        $retries = -1;
         do {
             $this->beginTransaction();

[NoCoverage] MethodCallRemoval
Application/Persistence/RetrySafeEntityManager.php:64:13
     {
         $retries = 0;
         do {
-            $this->beginTransaction();
+            
 
             try {

[NoCoverage] MethodCallRemoval
Application/Persistence/RetrySafeEntityManager.php:69:17
             try {
                 $ret = $func();
 
-                $this->flush();
+                
                 $this->commit();
 

[NoCoverage] MethodCallRemoval
Application/Persistence/RetrySafeEntityManager.php:70:17
                 $ret = $func();
 
                 $this->flush();
-                $this->commit();
+                
 
                 return $ret;

[NoCoverage] MethodCallRemoval
Application/Persistence/RetrySafeEntityManager.php:74:17
 
                 return $ret;
             } catch (RetryableException $ex) {
-                $this->rollback();
+                
                 $this->close();
 

[NoCoverage] MethodCallRemoval
Application/Persistence/RetrySafeEntityManager.php:75:17
                 return $ret;
             } catch (RetryableException $ex) {
                 $this->rollback();
-                $this->close();
+                
 
                 $this->logger->error(

[NoCoverage] MethodCallRemoval
Application/Persistence/RetrySafeEntityManager.php:77:17
                 $this->rollback();
                 $this->close();
 
-                $this->logger->error(
-                    'EM closed. RetrySafeEntityManager::transactional rolling back from ' . get_class($ex) .
-                    $ex->__tostring()
-                );
+                
                 usleep(random_int(0, 200000)); // Wait between 0 and 0.2 seconds before retrying
 

[NoCoverage] ConcatOperandRemoval
Application/Persistence/RetrySafeEntityManager.php:78:21
                 $this->close();
 
                 $this->logger->error(
-                    'EM closed. RetrySafeEntityManager::transactional rolling back from ' . get_class($ex) .
+                    $this->logger->error(get_class($ex) . $ex->__tostring());
                     $ex->__tostring()
                 );

[NoCoverage] Concat
Application/Persistence/RetrySafeEntityManager.php:78:21
                 $this->close();
 
                 $this->logger->error(
-                    'EM closed. RetrySafeEntityManager::transactional rolling back from ' . get_class($ex) .
-                    $ex->__tostring()
+                    $this->logger->error('EM closed. RetrySafeEntityManager::transactional rolling back from ' . $ex->__tostring() . get_class($ex));
                 );
                 usleep(random_int(0, 200000)); // Wait between 0 and 0.2 seconds before retrying

[NoCoverage] FunctionCallRemoval
Application/Persistence/RetrySafeEntityManager.php:81:17
                     'EM closed. RetrySafeEntityManager::transactional rolling back from ' . get_class($ex) .
                     $ex->__tostring()
                 );
-                usleep(random_int(0, 200000)); // Wait between 0 and 0.2 seconds before retrying
+                
 
                 $this->resetManager();

[NoCoverage] IncrementInteger
Application/Persistence/RetrySafeEntityManager.php:81:17
                     'EM closed. RetrySafeEntityManager::transactional rolling back from ' . get_class($ex) .
                     $ex->__tostring()
                 );
-                usleep(random_int(0, 200000)); // Wait between 0 and 0.2 seconds before retrying
+                usleep(random_int(0, 200001));
 
                 $this->resetManager();

[NoCoverage] MethodCallRemoval
Application/Persistence/RetrySafeEntityManager.php:83:17
                 );
                 usleep(random_int(0, 200000)); // Wait between 0 and 0.2 seconds before retrying
 
-                $this->resetManager();
+                
                 ++$retries;
             } catch (\Exception $ex) {

[NoCoverage] Increment
Application/Persistence/RetrySafeEntityManager.php:84:17
                 usleep(random_int(0, 200000)); // Wait between 0 and 0.2 seconds before retrying
 
                 $this->resetManager();
-                ++$retries;
+                --$retries;
             } catch (\Exception $ex) {
                 $this->rollback();

[NoCoverage] MethodCallRemoval
Application/Persistence/RetrySafeEntityManager.php:86:17
                 $this->resetManager();
                 ++$retries;
             } catch (\Exception $ex) {
-                $this->rollback();
+                
                 $this->logger->error(
                     'RetrySafeEntityManager bailing out having hit ' . get_class($ex) . ': ' . $ex->getMessage()

[NoCoverage] MethodCallRemoval
Application/Persistence/RetrySafeEntityManager.php:87:17
                 ++$retries;
             } catch (\Exception $ex) {
                 $this->rollback();
-                $this->logger->error(
-                    'RetrySafeEntityManager bailing out having hit ' . get_class($ex) . ': ' . $ex->getMessage()
-                );
+                
 
                 throw $ex;

[NoCoverage] Concat
Application/Persistence/RetrySafeEntityManager.php:88:21
             } catch (\Exception $ex) {
                 $this->rollback();
                 $this->logger->error(
-                    'RetrySafeEntityManager bailing out having hit ' . get_class($ex) . ': ' . $ex->getMessage()
+                    $this->logger->error('RetrySafeEntityManager bailing out having hit ' . get_class($ex) . $ex->getMessage() . ': ');
                 );
 

[NoCoverage] ConcatOperandRemoval
Application/Persistence/RetrySafeEntityManager.php:88:21
             } catch (\Exception $ex) {
                 $this->rollback();
                 $this->logger->error(
-                    'RetrySafeEntityManager bailing out having hit ' . get_class($ex) . ': ' . $ex->getMessage()
+                    $this->logger->error('RetrySafeEntityManager bailing out having hit ' . ': ' . $ex->getMessage());
                 );
 

[NoCoverage] Throw_
Application/Persistence/RetrySafeEntityManager.php:91:17
                     'RetrySafeEntityManager bailing out having hit ' . get_class($ex) . ': ' . $ex->getMessage()
                 );
 
-                throw $ex;
+                $ex;
             }
         } while ($retries < $this->maxLockRetries);

[NoCoverage] LessThanNegotiation
Application/Persistence/RetrySafeEntityManager.php:93:9
 
                 throw $ex;
             }
-        } while ($retries < $this->maxLockRetries);
+        } while ($retries >= $this->maxLockRetries);
 
         $this->logger->error('RetrySafeEntityManager bailing out after ' . $this->maxLockRetries . ' tries');

[NoCoverage] LessThan
Application/Persistence/RetrySafeEntityManager.php:93:9
 
                 throw $ex;
             }
-        } while ($retries < $this->maxLockRetries);
+        } while ($retries <= $this->maxLockRetries);
 
         $this->logger->error('RetrySafeEntityManager bailing out after ' . $this->maxLockRetries . ' tries');

[NoCoverage] ConcatOperandRemoval
Application/Persistence/RetrySafeEntityManager.php:95:9
             }
         } while ($retries < $this->maxLockRetries);
 
-        $this->logger->error('RetrySafeEntityManager bailing out after ' . $this->maxLockRetries . ' tries');
+        $this->logger->error('RetrySafeEntityManager bailing out after ' . ' tries');
 
         throw $ex;

[NoCoverage] MethodCallRemoval
Application/Persistence/RetrySafeEntityManager.php:95:9
             }
         } while ($retries < $this->maxLockRetries);
 
-        $this->logger->error('RetrySafeEntityManager bailing out after ' . $this->maxLockRetries . ' tries');
+        
 
         throw $ex;

[Killed] MethodCallRemoval
Application/Persistence/RetrySafeEntityManager.php:110:13
     public function persist($object): void
     {
         try {
-            $this->entityManager->persist($object);
+            
         } catch (EntityManagerClosed $closedException) {
             $this->logger->error(
killedBy: MatchBot\Tests\Application\Persistence\RetrySafeEntityManagerTest::testPersist
statusReason: 1) MatchBot\Tests\Application\Persistence\RetrySafeEntityManagerTest::testPersist
Some predictions failed:
Double\Doctrine\ORM\EntityManager\P5:
  Expected exactly 1 calls that match:
      Double\Doctrine\ORM\EntityManager\P5->persist(type(MatchBot\Domain\Donation))
    but none were made.

/home/barney/projects/matchbot/vendor/phpspec/prophecy-phpunit/src/ProphecyTrait.php:61

[Killed] MethodCallRemoval
Application/Persistence/RetrySafeEntityManager.php:112:13
         try {
             $this->entityManager->persist($object);
         } catch (EntityManagerClosed $closedException) {
-            $this->logger->error(
-                'EM closed. RetrySafeEntityManager::persist() trying with a new instance,' .
-                $closedException->__tostring()
-            );
+            
             $this->resetManager();
             $this->entityManager->persist($object);
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

........                                                            8 / 8 (100%)

Time: 00:00.053, Memory: 18.00 MB

OK (8 tests, 13 assertions)

[Killed] Concat
Application/Persistence/RetrySafeEntityManager.php:113:17
             $this->entityManager->persist($object);
         } catch (EntityManagerClosed $closedException) {
             $this->logger->error(
-                'EM closed. RetrySafeEntityManager::persist() trying with a new instance,' .
-                $closedException->__tostring()
+                $this->logger->error($closedException->__tostring() . 'EM closed. RetrySafeEntityManager::persist() trying with a new instance,');
             );
             $this->resetManager();
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

........                                                            8 / 8 (100%)

Time: 00:00.054, Memory: 18.00 MB

OK (8 tests, 13 assertions)

[Killed] ConcatOperandRemoval
Application/Persistence/RetrySafeEntityManager.php:113:17
             $this->entityManager->persist($object);
         } catch (EntityManagerClosed $closedException) {
             $this->logger->error(
-                'EM closed. RetrySafeEntityManager::persist() trying with a new instance,' .
-                $closedException->__tostring()
+                $this->logger->error('EM closed. RetrySafeEntityManager::persist() trying with a new instance,');
             );
             $this->resetManager();
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

........                                                            8 / 8 (100%)

Time: 00:00.059, Memory: 18.00 MB

OK (8 tests, 13 assertions)

[Killed] MethodCallRemoval
Application/Persistence/RetrySafeEntityManager.php:116:13
                 'EM closed. RetrySafeEntityManager::persist() trying with a new instance,' .
                 $closedException->__tostring()
             );
-            $this->resetManager();
+            
             $this->entityManager->persist($object);
         }
killedBy: MatchBot\Tests\Application\Persistence\RetrySafeEntityManagerTest::testPersistWithRetry
statusReason: 1) MatchBot\Tests\Application\Persistence\RetrySafeEntityManagerTest::testPersistWithRetry
Doctrine\ORM\Exception\EntityManagerClosed: 

/home/barney/projects/matchbot/tests/Application/Persistence/RetrySafeEntityManagerTest.php:84

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] MethodCallRemoval
Application/Persistence/RetrySafeEntityManager.php:117:13
                 $closedException->__tostring()
             );
             $this->resetManager();
-            $this->entityManager->persist($object);
+            
         }
     }
killedBy: MatchBot\Tests\Application\Persistence\RetrySafeEntityManagerTest::testPersistWithRetry
statusReason: 1) MatchBot\Tests\Application\Persistence\RetrySafeEntityManagerTest::testPersistWithRetry
Some predictions failed:
Double\Doctrine\ORM\EntityManager\P5:
  Expected exactly 1 calls that match:
      Double\Doctrine\ORM\EntityManager\P5->persist(type(MatchBot\Domain\Donation))
    but none were made.

/home/barney/projects/matchbot/vendor/phpspec/prophecy-phpunit/src/ProphecyTrait.php:61

[Killed] MethodCallRemoval
Application/Persistence/RetrySafeEntityManager.php:130:13
     public function refresh($object, ?int $lockMode = null): void
     {
         try {
-            $this->entityManager->refresh($object, $lockMode);
+            
         } catch (EntityManagerClosed $closedException) {
             $this->logger->error(
killedBy: MatchBot\Tests\Application\Persistence\RetrySafeEntityManagerTest::testRefreshWithSuccessFirstTime
statusReason: 1) MatchBot\Tests\Application\Persistence\RetrySafeEntityManagerTest::testRefreshWithSuccessFirstTime
Some predictions failed:
Double\Doctrine\ORM\EntityManager\P5:
  Expected exactly 1 calls that match:
      Double\Doctrine\ORM\EntityManager\P5->refresh(type(MatchBot\Domain\Donation), exact(4))
    but none were made.

/home/barney/projects/matchbot/vendor/phpspec/prophecy-phpunit/src/ProphecyTr

[Killed] MethodCallRemoval
Application/Persistence/RetrySafeEntityManager.php:132:13
         try {
             $this->entityManager->refresh($object, $lockMode);
         } catch (EntityManagerClosed $closedException) {
-            $this->logger->error(
-                'EM closed. RetrySafeEntityManager::refresh() trying with a new instance,' .
-                $closedException->__tostring()
-            );
+            
             $this->resetManager();
             $this->entityManager->refresh($object, $lockMode);
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

........                                                            8 / 8 (100%)

Time: 00:00.057, Memory: 18.00 MB

OK (8 tests, 13 assertions)

[Killed] ConcatOperandRemoval
Application/Persistence/RetrySafeEntityManager.php:133:17
             $this->entityManager->refresh($object, $lockMode);
         } catch (EntityManagerClosed $closedException) {
             $this->logger->error(
-                'EM closed. RetrySafeEntityManager::refresh() trying with a new instance,' .
-                $closedException->__tostring()
+                $this->logger->error('EM closed. RetrySafeEntityManager::refresh() trying with a new instance,');
             );
             $this->resetManager();
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

........                                                            8 / 8 (100%)

Time: 00:00.055, Memory: 18.00 MB

OK (8 tests, 13 assertions)

[Killed] ConcatOperandRemoval
Application/Persistence/RetrySafeEntityManager.php:133:17
             $this->entityManager->refresh($object, $lockMode);
         } catch (EntityManagerClosed $closedException) {
             $this->logger->error(
-                'EM closed. RetrySafeEntityManager::refresh() trying with a new instance,' .
-                $closedException->__tostring()
+                $this->logger->error($closedException->__tostring());
             );
             $this->resetManager();
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

........                                                            8 / 8 (100%)

Time: 00:00.055, Memory: 18.00 MB

OK (8 tests, 13 assertions)

[Killed] MethodCallRemoval
Application/Persistence/RetrySafeEntityManager.php:137:13
                 $closedException->__tostring()
             );
             $this->resetManager();
-            $this->entityManager->refresh($object, $lockMode);
+            
         }
     }
killedBy: MatchBot\Tests\Application\Persistence\RetrySafeEntityManagerTest::testRefreshRetriesOnEmClosed
statusReason: 1) MatchBot\Tests\Application\Persistence\RetrySafeEntityManagerTest::testRefreshRetriesOnEmClosed
Some predictions failed:
Double\Doctrine\ORM\EntityManager\P5:
  Expected exactly 1 calls that match:
      Double\Doctrine\ORM\EntityManager\P5->refresh(type(MatchBot\Domain\Donation), exact(4))
    but none were made.

/home/barney/projects/matchbot/vendor/phpspec/prophecy-phpunit/src/ProphecyTrait

[Killed] MethodCallRemoval
Application/Persistence/RetrySafeEntityManager.php:152:13
     public function flush($entity = null): void
     {
         try {
-            $this->entityManager->flush($entity);
+            
         } catch (EntityManagerClosed $closedException) {
             $this->logger->error(
killedBy: MatchBot\Tests\Application\Persistence\RetrySafeEntityManagerTest::testFlush
statusReason: 1) MatchBot\Tests\Application\Persistence\RetrySafeEntityManagerTest::testFlush
Some predictions failed:
Double\Doctrine\ORM\EntityManager\P5:
  Expected exactly 1 calls that match:
      Double\Doctrine\ORM\EntityManager\P5->flush(exact(null))
    but none were made.

/home/barney/projects/matchbot/vendor/phpspec/prophecy-phpunit/src/ProphecyTrait.php:61

[Killed] MethodCallRemoval
Application/Persistence/RetrySafeEntityManager.php:154:13
         try {
             $this->entityManager->flush($entity);
         } catch (EntityManagerClosed $closedException) {
-            $this->logger->error(
-                'EM closed. RetrySafeEntityManager::flush() trying with a new instance,' .
-                $closedException->__tostring()
-            );
+            
             $this->resetManager();
             $this->entityManager->flush($entity);
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

........                                                            8 / 8 (100%)

Time: 00:00.053, Memory: 18.00 MB

OK (8 tests, 13 assertions)

[Killed] ConcatOperandRemoval
Application/Persistence/RetrySafeEntityManager.php:155:17
             $this->entityManager->flush($entity);
         } catch (EntityManagerClosed $closedException) {
             $this->logger->error(
-                'EM closed. RetrySafeEntityManager::flush() trying with a new instance,' .
-                $closedException->__tostring()
+                $this->logger->error($closedException->__tostring());
             );
             $this->resetManager();
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

........                                                            8 / 8 (100%)

Time: 00:00.053, Memory: 18.00 MB

OK (8 tests, 13 assertions)

[Killed] ConcatOperandRemoval
Application/Persistence/RetrySafeEntityManager.php:155:17
             $this->entityManager->flush($entity);
         } catch (EntityManagerClosed $closedException) {
             $this->logger->error(
-                'EM closed. RetrySafeEntityManager::flush() trying with a new instance,' .
-                $closedException->__tostring()
+                $this->logger->error('EM closed. RetrySafeEntityManager::flush() trying with a new instance,');
             );
             $this->resetManager();
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

........                                                            8 / 8 (100%)

Time: 00:00.053, Memory: 18.00 MB

OK (8 tests, 13 assertions)

[Killed] MethodCallRemoval
Application/Persistence/RetrySafeEntityManager.php:159:13
                 $closedException->__tostring()
             );
             $this->resetManager();
-            $this->entityManager->flush($entity);
+            
         }
     }
killedBy: MatchBot\Tests\Application\Persistence\RetrySafeEntityManagerTest::testFlushWithRetry
statusReason: 1) MatchBot\Tests\Application\Persistence\RetrySafeEntityManagerTest::testFlushWithRetry
Some predictions failed:
Double\Doctrine\ORM\EntityManager\P5:
  Expected exactly 1 calls that match:
      Double\Doctrine\ORM\EntityManager\P5->flush(exact(null))
    but none were made.

/home/barney/projects/matchbot/vendor/phpspec/prophecy-phpunit/src/ProphecyTrait.php:61

[Killed] PublicVisibility
Application/Persistence/RetrySafeEntityManager.php:163:5
         }
     }
 
-    public function resetManager(): void
+    protected function resetManager() : void
     {
         $this->entityManager = $this->buildEntityManager();
killedBy: MatchBot\Tests\Application\Persistence\RetrySafeEntityManagerTest::testBuild
statusReason: 1) MatchBot\Tests\Application\Persistence\RetrySafeEntityManagerTest::testBuild
Error: Call to protected method MatchBot\Application\Persistence\RetrySafeEntityManager::resetManager() from scope MatchBot\Tests\Application\Persistence\RetrySafeEntityManagerTest

/home/barney/projects/matchbot/tests/Application/Persistence/RetrySafeEntityManagerTest.php:44

ERRORS!
Tests: 1, Assertions: 0, Errors: 1

[Killed] PublicVisibility
Application/Persistence/RetrySafeEntityManager.php:181:5
      * Currently just used for easier testing, to avoid needing a very complex mix of both reflection
      * and partial mocks.
      */
-    public function setEntityManager(EntityManager $entityManager): void
+    protected function setEntityManager(EntityManager $entityManager) : void
     {
         $this->entityManager = $entityManager;
killedBy: MatchBot\Tests\Application\Persistence\RetrySafeEntityManagerTest::testPersistWithRetry
statusReason: 1) MatchBot\Tests\Application\Persistence\RetrySafeEntityManagerTest::testPersistWithRetry
Error: Call to protected method MatchBot\Application\Persistence\RetrySafeEntityManager::setEntityManager() from scope MatchBot\Tests\Application\Persistence\RetrySafeEntityManagerTest

/home/barney/projects/matchbot/tests/Application/Persistence/RetrySafeEntityManagerTest.php:224
/home/barney/projects/match
