[Killed] PublicVisibility
Application/SlackChannelChatterFactory.php:18:5
         $this->apiToken = $apiToken;
     }
 
-    public function makeChatter(string $channelName): ChatterInterface
+    protected function makeChatter(string $channelName) : ChatterInterface
     {
         $transport = new SlackTransport(
killedBy: MatchBot\Tests\Application\Actions\Hooks\StripePaymentsUpdateTest::testUnsupportedAction
statusReason: 1) MatchBot\Tests\Application\Actions\Hooks\StripePaymentsUpdateTest::testUnsupportedAction
Error: Call to protected method MatchBot\Application\SlackChannelChatterFactory::makeChatter() from scope MatchBot\Tests\TestCase

/home/barney/projects/matchbot/app/dependencies.php:112
/home/barney/projects/matchbot/vendor/php-di/invoker/src/Invoker.php:74
/home/barney/projects/matchbot/vendor/php-di/php-
