[NoCoverage] ProtectedVisibility
Client/Common.php:22:5
         $this->clientSettings = $settings['apiClient'];
     }
 
-    protected function getSetting(string $service, string $property): string
+    private function getSetting(string $service, string $property) : string
     {
         return $this->clientSettings[$service][$property];

[NoCoverage] ProtectedVisibility
Client/Common.php:27:5
         return $this->clientSettings[$service][$property];
     }
 
-    protected function getHttpClient(): Client
+    private function getHttpClient() : Client
     {
         if (!isset($this->httpClient)) {

[NoCoverage] LogicalNot
Client/Common.php:29:9
 
     protected function getHttpClient(): Client
     {
-        if (!isset($this->httpClient)) {
+        if (isset($this->httpClient)) {
             $this->httpClient = new Client([
                 'timeout' => $this->clientSettings['global']['timeout'],
