[NoCoverage] PublicVisibility
Client/Fund.php:14:5
      * @return array Single Fund, as associative array
      * @throws NotFoundException if Fund with given ID not found
      */
-    public function getById(string $fundId): array
+    protected function getById(string $fundId) : array
     {
         $response = $this->getHttpClient()->get("{$this->getSetting('fund', 'baseUri')}/$fundId");

[NoCoverage] DecrementInteger
Client/Fund.php:18:9
     {
         $response = $this->getHttpClient()->get("{$this->getSetting('fund', 'baseUri')}/$fundId");
 
-        if ($response->getStatusCode() !== 200) {
+        if ($response->getStatusCode() !== 199) {
             throw new NotFoundException('Fund not found');
         }

[NoCoverage] IncrementInteger
Client/Fund.php:18:9
     {
         $response = $this->getHttpClient()->get("{$this->getSetting('fund', 'baseUri')}/$fundId");
 
-        if ($response->getStatusCode() !== 200) {
+        if ($response->getStatusCode() !== 201) {
             throw new NotFoundException('Fund not found');
         }

[NoCoverage] Throw_
Client/Fund.php:19:13
         $response = $this->getHttpClient()->get("{$this->getSetting('fund', 'baseUri')}/$fundId");
 
         if ($response->getStatusCode() !== 200) {
-            throw new NotFoundException('Fund not found');
+            new NotFoundException('Fund not found');
         }
 

[NoCoverage] PublicVisibility
Client/Fund.php:30:5
      * @return array Array of Funds, each as associative array
      * @throws NotFoundException if Campaign with given ID not found
      */
-    public function getForCampaign(string $campaignId): array
+    protected function getForCampaign(string $campaignId) : array
     {
         $response = $this->getHttpClient()->get("{$this->getSetting('campaign', 'baseUri')}/$campaignId/funds");

[NoCoverage] Throw_
Client/Fund.php:35:13
         $response = $this->getHttpClient()->get("{$this->getSetting('campaign', 'baseUri')}/$campaignId/funds");
 
         if ($response->getStatusCode() !== 200) {
-            throw new NotFoundException('Campaign not found');
+            new NotFoundException('Campaign not found');
         }
 
