[NoCoverage] PublicVisibility
Client/Mailer.php:17:5
     /**
      * @psalm-param array{templateKey: string, recipientEmailAddress: string, params: array, ...} $requestBody
      */
-    public function sendEmail(array $requestBody): void
+    protected function sendEmail(array $requestBody) : void
     {
         try {

[NoCoverage] ConcatOperandRemoval
Client/Mailer.php:21:13
     {
         try {
             $baseUri = $this->getSetting('mailer', 'baseUri');
-            $uri = $baseUri . '/v1/send';
+            $uri = '/v1/send';
             $response = $this->getHttpClient()->post(
                 $uri,

[NoCoverage] ConcatOperandRemoval
Client/Mailer.php:21:13
     {
         try {
             $baseUri = $this->getSetting('mailer', 'baseUri');
-            $uri = $baseUri . '/v1/send';
+            $uri = $baseUri;
             $response = $this->getHttpClient()->post(
                 $uri,

[NoCoverage] ArrayItemRemoval
Client/Mailer.php:24:17
             $uri = $baseUri . '/v1/send';
             $response = $this->getHttpClient()->post(
                 $uri,
-                [
-                    'json' => $requestBody,
-                    'headers' => [
-                        'x-send-verify-hash' => $this->hash(json_encode($requestBody)),
-                    ],
-                ]
+                $response = $this->getHttpClient()->post($uri, ['headers' => ['x-send-verify-hash' => $this->hash(json_encode($requestBody))]]);
             );
 

[NoCoverage] DecrementInteger
Client/Mailer.php:32:13
                 ]
             );
 
-            if ($response->getStatusCode() === 200) {
+            if ($response->getStatusCode() === 199) {
                 return;
             } else {

[NoCoverage] Identical
Client/Mailer.php:32:13
                 ]
             );
 
-            if ($response->getStatusCode() === 200) {
+            if ($response->getStatusCode() !== 200) {
                 return;
             } else {

[NoCoverage] MethodCallRemoval
Client/Mailer.php:35:17
             if ($response->getStatusCode() === 200) {
                 return;
             } else {
-                $this->logger->warning(sprintf(
-                    '%s email callout didn\'t return 200. It returned code: %s. Request body: %s. Response body: %s.',
-                    $requestBody['templateKey'],
-                    $response->getStatusCode(),
-                    json_encode($requestBody),
-                    $response->getBody()->getContents(),
-                ));
+                
                 return;
             }

[NoCoverage] MethodCallRemoval
Client/Mailer.php:47:13
         } catch (RequestException $ex) {
             $response = $ex->getResponse();
 
-            $this->logger->error(sprintf(
-                '%s email exception %s with error code %s: %s. Body: %s',
-                $requestBody['templateKey'],
-                get_class($ex),
-                $ex->getCode(),
-                $ex->getMessage(),
-                $response ? $response->getBody()->getContents() : 'N/A',
-            ));
+            
             return;
         } catch (GuzzleException $ex) {

[NoCoverage] MethodCallRemoval
Client/Mailer.php:57:13
             ));
             return;
         } catch (GuzzleException $ex) {
-            $this->logger->error(sprintf(
-                '%s email exception %s with error code %s: %s. Body: %s',
-                $requestBody['templateKey'],
-                get_class($ex),
-                $ex->getCode(),
-                $ex->getMessage(),
-                'N/A',
-            ));
+            
             return;
         }

[NoCoverage] UnwrapTrim
Client/Mailer.php:71:9
 
     private function hash(string $body): string
     {
-        return hash_hmac('sha256', trim($body), $this->getSetting('mailer', 'sendSecret'));
+        return hash_hmac('sha256', $body, $this->getSetting('mailer', 'sendSecret'));
     }
 }
