[Killed] IfNegation
Domain/Campaign.php:75:9
      */
     public function __construct(?Charity $charity)
     {
-        if ($charity) {
-            $this->charity = $charity;
-        }
+        if (!$charity) {
     }
 
killedBy: MatchBot\Tests\Application\Auth\PersonManagementAuthMiddlewareTest::testNoJwt
statusReason: 1) MatchBot\Tests\Application\Auth\PersonManagementAuthMiddlewareTest::testNoJwt
Failed asserting that exception of type "Error" matches expected exception "Slim\Exception\HttpUnauthorizedException". Message was: "Typed property MatchBot\Domain\Campaign::$charity must not be accessed before initialization" at
/home/barney/projects/matchbot/src/Domain/Campaign.php:141
/home/barney/projects/matchbot

[NoCoverage] PublicVisibility
Domain/Campaign.php:92:5
      * @ORM\PrePersist()
      * @psalm-suppress PossiblyUnusedMethod
      */
-    public function prePersistCheck(PrePersistEventArgs $_args): void
+    protected function prePersistCheck(PrePersistEventArgs $_args) : void
     {
         try {

[NoCoverage] Throw_
Domain/Campaign.php:104:13
 
             $_charity = $this->charity;
         } catch (\Error $e) {
-            throw new \Exception("Error on attempt to persist campaign #{$this->id}, sfID {$this->salesforceId}: \n{$e}");
+            new \Exception("Error on attempt to persist campaign #{$this->id}, sfID {$this->salesforceId}: \n{$e}");
         }
     }

[Killed] PublicVisibility
Domain/Campaign.php:111:5
     /**
      * @return bool
      */
-    public function isMatched(): bool
+    protected function isMatched() : bool
     {
         return $this->isMatched;
killedBy: MatchBot\Tests\Application\Auth\DonationRecaptchaMiddlewareTest::testFailure
statusReason: 1) MatchBot\Tests\Application\Auth\DonationRecaptchaMiddlewareTest::testFailure
Error: Call to protected method MatchBot\Domain\Campaign::isMatched() from scope MatchBot\Domain\Donation

/home/barney/projects/matchbot/src/Domain/Donation.php:474
/home/barney/projects/matchbot/tests/Application/Auth/DonationRecaptchaMiddlewareTest.php:27

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] PublicVisibility
Domain/Campaign.php:119:5
     /**
      * @param Charity $charity
      */
-    public function setCharity(Charity $charity): void
+    protected function setCharity(Charity $charity) : void
     {
         $this->charity = $charity;
killedBy: MatchBot\Tests\Application\Actions\Donations\CreateTest::testSuccessWithStripeAccountIDMissingInitiallyButFoundOnRefetch
statusReason: 1) MatchBot\Tests\Application\Actions\Donations\CreateTest::testSuccessWithStripeAccountIDMissingInitiallyButFoundOnRefetch
Error: Call to protected method MatchBot\Domain\Campaign::setCharity() from scope MatchBot\Tests\Application\Actions\Donations\CreateTest

/home/barney/projects/matchbot/tests/Application/Actions/Donations/CreateTest.php:303

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] PublicVisibility
Domain/Campaign.php:127:5
     /**
      * @param bool $isMatched
      */
-    public function setIsMatched(bool $isMatched): void
+    protected function setIsMatched(bool $isMatched) : void
     {
         $this->isMatched = $isMatched;
killedBy: MatchBot\Tests\Application\Commands\ClaimGiftAidTest::testNothingToSend
statusReason: 1) MatchBot\Tests\Application\Commands\ClaimGiftAidTest::testNothingToSend
Error: Call to protected method MatchBot\Domain\Campaign::setIsMatched() from scope MatchBot\Tests\Application\Commands\ClaimGiftAidTest

/home/barney/projects/matchbot/tests/Application/DonationTestDataTrait.php:39
/home/barney/projects/matchbot/tests/Application/Commands/ClaimGiftAidTest.php:40

ERRORS!
Tests: 1, Assertio

[Killed] PublicVisibility
Domain/Campaign.php:143:5
     /**
      * @param DateTime $startDate
      */
-    public function setStartDate(DateTime $startDate): void
+    protected function setStartDate(DateTime $startDate) : void
     {
         $this->startDate = $startDate;
killedBy: MatchBot\Tests\Application\Actions\Donations\CreateTest::testCampaignClosed
statusReason: 1) MatchBot\Tests\Application\Actions\Donations\CreateTest::testCampaignClosed
Error: Call to protected method MatchBot\Domain\Campaign::setStartDate() from scope MatchBot\Tests\Application\Actions\Donations\CreateTest

/home/barney/projects/matchbot/tests/Application/Actions/Donations/CreateTest.php:1101
/home/barney/projects/matchbot/tests/Application/Actions/Donations/CreateTest.php:76

ERRORS!

[Killed] PublicVisibility
Domain/Campaign.php:151:5
     /**
      * @param DateTime $endDate
      */
-    public function setEndDate(DateTime $endDate): void
+    protected function setEndDate(DateTime $endDate) : void
     {
         $this->endDate = $endDate;
killedBy: MatchBot\Tests\Application\Actions\Donations\CreateTest::testCampaignClosed
statusReason: 1) MatchBot\Tests\Application\Actions\Donations\CreateTest::testCampaignClosed
Error: Call to protected method MatchBot\Domain\Campaign::setEndDate() from scope MatchBot\Tests\Application\Actions\Donations\CreateTest

/home/barney/projects/matchbot/tests/Application/Actions/Donations/CreateTest.php:1105
/home/barney/projects/matchbot/tests/Application/Actions/Donations/CreateTest.php:76

ERRORS!
T

[Killed] PublicVisibility
Domain/Campaign.php:159:5
     /**
      * @return Charity
      */
-    public function getCharity(): Charity
+    protected function getCharity() : Charity
     {
         return $this->charity;
killedBy: MatchBot\Tests\Application\Commands\ClaimGiftAidTest::testNothingToSend
statusReason: 1) MatchBot\Tests\Application\Commands\ClaimGiftAidTest::testNothingToSend
Error: Call to protected method MatchBot\Domain\Campaign::getCharity() from scope MatchBot\Domain\Donation

/home/barney/projects/matchbot/src/Domain/Donation.php:1256
/home/barney/projects/matchbot/tests/Application/Commands/ClaimGiftAidTest.php:43

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] PublicVisibility
Domain/Campaign.php:167:5
     /**
      * @return string
      */
-    public function getCampaignName(): string
+    protected function getCampaignName() : string
     {
         return $this->name;
killedBy: MatchBot\Tests\Application\Actions\Donations\CreateTest::testSuccessWithStripeAccountIDMissingInitiallyButFoundOnRefetch
statusReason: 1) MatchBot\Tests\Application\Actions\Donations\CreateTest::testSuccessWithStripeAccountIDMissingInitiallyButFoundOnRefetch
Error: Call to protected method MatchBot\Domain\Campaign::getCampaignName() from scope MatchBot\Application\Actions\Donations\Create

/home/barney/projects/matchbot/src/Application/Actions/Donations/Create.php:183
/home/barney/projects/matchbot/src/Application/Actions/Action.

[Killed] PublicVisibility
Domain/Campaign.php:172:5
         return $this->name;
     }
 
-    public function isOpen(): bool
+    protected function isOpen() : bool
     {
         return ($this->startDate <= new DateTime('now') && $this->endDate > new DateTime('now'));
killedBy: MatchBot\Tests\Application\Actions\Donations\CreateTest::testCampaignClosed
statusReason: 1) MatchBot\Tests\Application\Actions\Donations\CreateTest::testCampaignClosed
Error: Call to protected method MatchBot\Domain\Campaign::isOpen() from scope MatchBot\Application\Actions\Donations\Create

/home/barney/projects/matchbot/src/Application/Actions/Donations/Create.php:120
/home/barney/projects/matchbot/src/Application/Actions/Action.php:34
/home/barney/projects/matchbot/vendor/slim/slim

[Killed] LogicalAndAllSubExprNegation
Domain/Campaign.php:174:9
 
     public function isOpen(): bool
     {
-        return ($this->startDate <= new DateTime('now') && $this->endDate > new DateTime('now'));
+        return !($this->startDate <= new DateTime('now')) && !($this->endDate > new DateTime('now'));
     }
 
killedBy: MatchBot\Tests\Application\Actions\Donations\CreateTest::testValidDataForMatchedCampaignWhenFundLockNotAcquired
statusReason: 1) MatchBot\Tests\Application\Actions\Donations\CreateTest::testValidDataForMatchedCampaignWhenFundLockNotAcquired
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
 '{\n
     "error": {\n
-        "type": "SERVER_ERROR",\n

[Killed] LogicalAndNegation
Domain/Campaign.php:174:9
 
     public function isOpen(): bool
     {
-        return ($this->startDate <= new DateTime('now') && $this->endDate > new DateTime('now'));
+        return !($this->startDate <= new DateTime('now') && $this->endDate > new DateTime('now'));
     }
 
killedBy: MatchBot\Tests\Application\Actions\Donations\CreateTest::testCampaignClosed
statusReason: 1) MatchBot\Tests\Application\Actions\Donations\CreateTest::testCampaignClosed
Doctrine\DBAL\Exception\ConnectionException: An exception occurred in the driver: SQLSTATE[HY000] [2002] php_network_getaddresses: getaddrinfo for dummy-mysql-hostname failed: Temporary failure in name resolution

/home/barney/projects/matchbot/vendor/doctrine/dbal/src/Driver/API/MySQL/ExceptionConverter.php:101
/home/b

[Killed] PublicVisibility
Domain/Campaign.php:177:5
         return ($this->startDate <= new DateTime('now') && $this->endDate > new DateTime('now'));
     }
 
-    public function getCurrencyCode(): ?string
+    protected function getCurrencyCode() : ?string
     {
         return $this->currencyCode;
killedBy: MatchBot\Tests\Domain\DonationRepositoryTest::testBuildFromApiRequestSuccess
statusReason: 1) MatchBot\Tests\Domain\DonationRepositoryTest::testBuildFromApiRequestSuccess
Error: Call to protected method MatchBot\Domain\Campaign::getCurrencyCode() from scope MatchBot\Domain\DonationRepository

/home/barney/projects/matchbot/src/Domain/DonationRepository.php:158
/home/barney/projects/matchbot/tests/Domain/DonationRepositoryTest.php:162

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] PublicVisibility
Domain/Campaign.php:182:5
         return $this->currencyCode;
     }
 
-    public function setCurrencyCode(string $currencyCode): void
+    protected function setCurrencyCode(string $currencyCode) : void
     {
         $this->currencyCode = $currencyCode;
killedBy: MatchBot\Tests\Domain\DonationRepositoryTest::testBuildFromApiRequestSuccess
statusReason: 1) MatchBot\Tests\Domain\DonationRepositoryTest::testBuildFromApiRequestSuccess
Error: Call to protected method MatchBot\Domain\Campaign::setCurrencyCode() from scope MatchBot\Tests\Domain\DonationRepositoryTest

/home/barney/projects/matchbot/tests/Domain/DonationRepositoryTest.php:146

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] PublicVisibility
Domain/Campaign.php:187:5
         $this->currencyCode = $currencyCode;
     }
 
-    public function getFeePercentage(): ?float
+    protected function getFeePercentage() : ?float
     {
         return $this->feePercentage;
killedBy: MatchBot\Tests\Domain\DonationRepositoryTest::testBuildFromApiRequestSuccess
statusReason: 1) MatchBot\Tests\Domain\DonationRepositoryTest::testBuildFromApiRequestSuccess
Error: Call to protected method MatchBot\Domain\Campaign::getFeePercentage() from scope MatchBot\Domain\DonationRepository

/home/barney/projects/matchbot/src/Domain/DonationRepository.php:554
/home/barney/projects/matchbot/src/Domain/DonationRepository.php:166
/home/barney/projects/matchbot/tests/Domain/DonationReposi

[Killed] PublicVisibility
Domain/Campaign.php:192:5
         return $this->feePercentage;
     }
 
-    public function setFeePercentage(?float $feePercentage): void
+    protected function setFeePercentage(?float $feePercentage) : void
     {
         $this->feePercentage = $feePercentage;
killedBy: MatchBot\Tests\Domain\DonationRepositoryTest::testStripeAmountForCharityWithFeeCover
statusReason: 1) MatchBot\Tests\Domain\DonationRepositoryTest::testStripeAmountForCharityWithFeeCover
Error: Call to protected method MatchBot\Domain\Campaign::setFeePercentage() from scope MatchBot\Tests\Domain\DonationRepositoryTest

/home/barney/projects/matchbot/tests/Domain/DonationRepositoryTest.php:256

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[NoCoverage] PublicVisibility
Domain/Campaign.php:200:5
     /**
      * @return DateTime
      */
-    public function getEndDate(): DateTime
+    protected function getEndDate() : DateTime
     {
         return $this->endDate;
