[NoCoverage] PublicVisibility
Domain/CampaignFunding.php:81:5
         return "CampaignFunding, ID #{$this->id}, created {$this->createdAt->format('c')} of fund SF ID {$this->fund->getSalesforceId()}";
     }
 
-    public function isShared(): bool
+    protected function isShared() : bool
     {
         return (count($this->campaigns) > 1);

[NoCoverage] GreaterThan
Domain/CampaignFunding.php:83:9
 
     public function isShared(): bool
     {
-        return (count($this->campaigns) > 1);
+        return count($this->campaigns) >= 1;
     }
 

[NoCoverage] GreaterThanNegotiation
Domain/CampaignFunding.php:83:9
 
     public function isShared(): bool
     {
-        return (count($this->campaigns) > 1);
+        return count($this->campaigns) <= 1;
     }
 

[Killed] PublicVisibility
Domain/CampaignFunding.php:89:5
     /**
      * @return string
      */
-    public function getAmount(): string
+    protected function getAmount() : string
     {
         return $this->amount;
killedBy: MatchBot\Tests\Domain\FundRepositoryTest::testPullForCampaignAllNew
statusReason: 1) MatchBot\Tests\Domain\FundRepositoryTest::testPullForCampaignAllNew
Some predictions failed:
Double\EntityManagerInterface\P1:
  Expected exactly 2 calls that match:
      Double\EntityManagerInterface\P1->persist(state(getAmount(), "500"))
    but 1 were made:
      - persist(MatchBot\Domain\ChampionFund#278 Object (
        'id' => null

[Killed] PublicVisibility
Domain/CampaignFunding.php:97:5
     /**
      * @param string $amount
      */
-    public function setAmount(string $amount): void
+    protected function setAmount(string $amount) : void
     {
         $this->amount = $amount;
killedBy: MatchBot\Tests\Application\Commands\ResetMatchingTest::testSinglePush
statusReason: 1) MatchBot\Tests\Application\Commands\ResetMatchingTest::testSinglePush
Error: Call to protected method MatchBot\Domain\CampaignFunding::setAmount() from scope MatchBot\Tests\Application\Commands\ResetMatchingTest

/home/barney/projects/matchbot/tests/Application/Commands/ResetMatchingTest.php:34

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] PublicVisibility
Domain/CampaignFunding.php:105:5
     /**
      * @return string
      */
-    public function getAmountAvailable(): string
+    protected function getAmountAvailable() : string
     {
         return $this->amountAvailable;
killedBy: MatchBot\Tests\Application\Commands\HandleOutOfSyncFundsTest::testCheck
statusReason: 1) MatchBot\Tests\Application\Commands\HandleOutOfSyncFundsTest::testCheck
Error: Call to protected method MatchBot\Domain\CampaignFunding::getAmountAvailable() from scope MatchBot\Tests\Application\Commands\HandleOutOfSyncFundsTest

/home/barney/projects/matchbot/tests/Application/Commands/HandleOutOfSyncFundsTest.php:150
/home/barney/projects/matchbot/tests/Application/Commands/HandleOutOfSyncFu

[Killed] PublicVisibility
Domain/CampaignFunding.php:113:5
     /**
      * @param string $amountAvailable
      */
-    public function setAmountAvailable(string $amountAvailable): void
+    protected function setAmountAvailable(string $amountAvailable) : void
     {
         $this->amountAvailable = $amountAvailable;
killedBy: MatchBot\Tests\Domain\FundRepositoryTest::testPullForCampaignAllNew
statusReason: 1) MatchBot\Tests\Domain\FundRepositoryTest::testPullForCampaignAllNew
Error: Call to protected method MatchBot\Domain\CampaignFunding::setAmountAvailable() from scope MatchBot\Domain\FundRepository

/home/barney/projects/matchbot/src/Domain/FundRepository.php:112
/home/barney/projects/matchbot/tests/Domain/FundRepositoryTest.php:97

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] PublicVisibility
Domain/CampaignFunding.php:121:5
     /**
      * @param Fund $fund
      */
-    public function setFund(Fund $fund): void
+    protected function setFund(Fund $fund) : void
     {
         $this->fund = $fund;
killedBy: MatchBot\Tests\Application\Commands\ResetMatchingTest::testSinglePush
statusReason: 1) MatchBot\Tests\Application\Commands\ResetMatchingTest::testSinglePush
Error: Call to protected method MatchBot\Domain\CampaignFunding::setFund() from scope MatchBot\Tests\Application\Commands\ResetMatchingTest

/home/barney/projects/matchbot/tests/Application/Commands/ResetMatchingTest.php:32

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] PublicVisibility
Domain/CampaignFunding.php:131:5
      *
      * @param Campaign $campaign
      */
-    public function addCampaign(Campaign $campaign): void
+    protected function addCampaign(Campaign $campaign) : void
     {
         if ($this->campaigns->contains($campaign)) {
killedBy: MatchBot\Tests\Domain\FundRepositoryTest::testPullForCampaignAllNew
statusReason: 1) MatchBot\Tests\Domain\FundRepositoryTest::testPullForCampaignAllNew
Error: Call to protected method MatchBot\Domain\CampaignFunding::addCampaign() from scope MatchBot\Domain\FundRepository

/home/barney/projects/matchbot/src/Domain/FundRepository.php:124
/home/barney/projects/matchbot/tests/Domain/FundRepositoryTest.php:97

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] IfNegation
Domain/CampaignFunding.php:133:9
      */
     public function addCampaign(Campaign $campaign): void
     {
-        if ($this->campaigns->contains($campaign)) {
-            return;
-        }
+        if (!$this->campaigns->contains($campaign)) {
 
         $this->campaigns->add($campaign);
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

.....                                                               5 / 5 (100%)

Time: 00:00.032, Memory: 14.00 MB

OK (5 tests, 30 assertions)

[Killed] MethodCallRemoval
Domain/CampaignFunding.php:137:9
             return;
         }
 
-        $this->campaigns->add($campaign);
+        
     }
 
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

.....                                                               5 / 5 (100%)

Time: 00:00.032, Memory: 14.00 MB

OK (5 tests, 30 assertions)

[Killed] PublicVisibility
Domain/CampaignFunding.php:143:5
     /**
      * @param int $allocationOrder
      */
-    public function setAllocationOrder(int $allocationOrder): void
+    protected function setAllocationOrder(int $allocationOrder) : void
     {
         $this->allocationOrder = $allocationOrder;
killedBy: MatchBot\Tests\Application\Commands\ResetMatchingTest::testSinglePush
statusReason: 1) MatchBot\Tests\Application\Commands\ResetMatchingTest::testSinglePush
Error: Call to protected method MatchBot\Domain\CampaignFunding::setAllocationOrder() from scope MatchBot\Tests\Application\Commands\ResetMatchingTest

/home/barney/projects/matchbot/tests/Application/Commands/ResetMatchingTest.php:35

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[NoCoverage] PublicVisibility
Domain/CampaignFunding.php:151:5
     /**
      * @return Fund
      */
-    public function getFund(): Fund
+    protected function getFund() : Fund
     {
         return $this->fund;

[NoCoverage] PublicVisibility
Domain/CampaignFunding.php:156:5
         return $this->fund;
     }
 
-    public function getCurrencyCode(): string
+    protected function getCurrencyCode() : string
     {
         return $this->currencyCode;
