[Killed] PublicVisibility
Domain/Donation.php:509:5
         return $this->donationStatus;
     }
 
-    public function setDonationStatus(DonationStatus $donationStatus): void
+    protected function setDonationStatus(DonationStatus $donationStatus) : void
     {
         if ($donationStatus === DonationStatus::Refunded) {
killedBy: MatchBot\Tests\Application\Commands\ClaimGiftAidTest::testNothingToSend
statusReason: 1) MatchBot\Tests\Application\Commands\ClaimGiftAidTest::testNothingToSend
Error: Call to protected method MatchBot\Domain\Donation::setDonationStatus() from scope MatchBot\Tests\Application\Commands\ClaimGiftAidTest

/home/barney/projects/matchbot/tests/Application/DonationTestDataTrait.php:49
/home/barney/projects/matchbot/tests/Application/Commands/ClaimGiftAidTest.php:40

ERRORS!
Tests: 1, Ass

[Killed] Identical
Domain/Donation.php:511:9
 
     public function setDonationStatus(DonationStatus $donationStatus): void
     {
-        if ($donationStatus === DonationStatus::Refunded) {
+        if ($donationStatus !== DonationStatus::Refunded) {
             throw new \Exception('Donation::recordRefundAt must be used to set refunded status');
         }
killedBy: MatchBot\Tests\Application\Commands\ClaimGiftAidTest::testNothingToSend
statusReason: 1) MatchBot\Tests\Application\Commands\ClaimGiftAidTest::testNothingToSend
Exception: Donation::recordRefundAt must be used to set refunded status

/home/barney/projects/matchbot/src/Domain/Donation.php:391
/home/barney/projects/matchbot/tests/Application/DonationTestDataTrait.php:49
/home/barney/projects/matchbot/tests/Application/Commands/ClaimGiftAidTest.php:40

ERRORS!

[NoCoverage] Throw_
Domain/Donation.php:512:13
     public function setDonationStatus(DonationStatus $donationStatus): void
     {
         if ($donationStatus === DonationStatus::Refunded) {
-            throw new \Exception('Donation::recordRefundAt must be used to set refunded status');
+            new \Exception('Donation::recordRefundAt must be used to set refunded status');
         }
 

[Killed] Identical
Domain/Donation.php:515:9
             throw new \Exception('Donation::recordRefundAt must be used to set refunded status');
         }
 
-        if ($donationStatus === DonationStatus::Cancelled) {
+        if ($donationStatus !== DonationStatus::Cancelled) {
             throw new \Exception('Donation::cancelled must be used to cancel');
         }
killedBy: MatchBot\Tests\Application\Commands\ClaimGiftAidTest::testNothingToSend
statusReason: 1) MatchBot\Tests\Application\Commands\ClaimGiftAidTest::testNothingToSend
Exception: Donation::cancelled must be used to cancel

/home/barney/projects/matchbot/src/Domain/Donation.php:394
/home/barney/projects/matchbot/tests/Application/DonationTestDataTrait.php:49
/home/barney/projects/matchbot/tests/Application/Commands/ClaimGiftAidTest.php:40

ERRORS!

[NoCoverage] Throw_
Domain/Donation.php:516:13
         }
 
         if ($donationStatus === DonationStatus::Cancelled) {
-            throw new \Exception('Donation::cancelled must be used to cancel');
+            new \Exception('Donation::cancelled must be used to cancel');
         }
 

[Killed] PublicVisibility
Domain/Donation.php:522:5
         $this->donationStatus = $donationStatus;
     }
 
-    public function getCollectedAt(): ?DateTimeImmutable
+    protected function getCollectedAt() : ?DateTimeImmutable
     {
         return $this->collectedAt;
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

................................................................. 65 / 92 ( 70%)
...........................                                       92 / 92 (100%)

Time: 00:03.368, Memory: 36.00 MB

OK (92 tests, 676 assertions)

[Killed] PublicVisibility
Domain/Donation.php:527:5
         return $this->collectedAt;
     }
 
-    public function setCollectedAt(?DateTimeImmutable $collectedAt): void
+    protected function setCollectedAt(?DateTimeImmutable $collectedAt) : void
     {
         $this->collectedAt = $collectedAt;
killedBy: MatchBot\Tests\Application\Commands\ClaimGiftAidTest::testNothingToSend
statusReason: 1) MatchBot\Tests\Application\Commands\ClaimGiftAidTest::testNothingToSend
Error: Call to protected method MatchBot\Domain\Donation::setCollectedAt() from scope MatchBot\Tests\Application\Commands\ClaimGiftAidTest

/home/barney/projects/matchbot/tests/Application/DonationTestDataTrait.php:50
/home/barney/projects/matchbot/tests/Application/Commands/ClaimGiftAidTest.php:40

ERRORS!
Tests: 1, Assert

[Killed] PublicVisibility
Domain/Donation.php:535:5
     /**
      * @return Campaign
      */
-    public function getCampaign(): Campaign
+    protected function getCampaign() : Campaign
     {
         return $this->campaign;
killedBy: MatchBot\Tests\Domain\DonationTest::testToClaimBotModelUK
statusReason: 1) MatchBot\Tests\Domain\DonationTest::testToClaimBotModelUK
Error: Call to protected method MatchBot\Domain\Donation::getCampaign() from scope MatchBot\Tests\Domain\DonationTest

/home/barney/projects/matchbot/tests/Domain/DonationTest.php:231

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] PublicVisibility
Domain/Donation.php:543:5
     /**
      * @param Campaign $campaign
      */
-    public function setCampaign(Campaign $campaign): void
+    protected function setCampaign(Campaign $campaign) : void
     {
         $this->campaign = $campaign;
killedBy: MatchBot\Tests\Application\Commands\ClaimGiftAidTest::testNothingToSend
statusReason: 1) MatchBot\Tests\Application\Commands\ClaimGiftAidTest::testNothingToSend
Error: Call to protected method MatchBot\Domain\Donation::setCampaign() from scope MatchBot\Tests\Application\Commands\ClaimGiftAidTest

/home/barney/projects/matchbot/tests/Application/DonationTestDataTrait.php:46
/home/barney/projects/matchbot/tests/Application/Commands/ClaimGiftAidTest.php:40

ERRORS!
Tests: 1, Assertion

[Killed] PublicVisibility
Domain/Donation.php:548:5
         $this->campaign = $campaign;
     }
 
-    public function getDonorEmailAddress(): ?string
+    protected function getDonorEmailAddress() : ?string
     {
         return $this->donorEmailAddress;
killedBy: MatchBot\Tests\Domain\DonationTest::testCreateDonationModelWithDonorFields
statusReason: 1) MatchBot\Tests\Domain\DonationTest::testCreateDonationModelWithDonorFields
Error: Call to protected method MatchBot\Domain\Donation::getDonorEmailAddress() from scope MatchBot\Tests\Domain\DonationTest

/home/barney/projects/matchbot/tests/Domain/DonationTest.php:369

ERRORS!
Tests: 1, Assertions: 2, Errors: 1.

[Killed] PublicVisibility
Domain/Donation.php:553:5
         return $this->donorEmailAddress;
     }
 
-    public function setDonorEmailAddress(?string $donorEmailAddress): void
+    protected function setDonorEmailAddress(?string $donorEmailAddress) : void
     {
         $this->donorEmailAddress = $donorEmailAddress;
killedBy: MatchBot\Tests\Application\Commands\ClaimGiftAidTest::testNothingToSend
statusReason: 1) MatchBot\Tests\Application\Commands\ClaimGiftAidTest::testNothingToSend
Error: Call to protected method MatchBot\Domain\Donation::setDonorEmailAddress() from scope MatchBot\Tests\Application\Commands\ClaimGiftAidTest

/home/barney/projects/matchbot/tests/Application/DonationTestDataTrait.php:52
/home/barney/projects/matchbot/tests/Application/Commands/ClaimGiftAidTest.php:40

ERRORS!
Tests: 1,

[Killed] PublicVisibility
Domain/Donation.php:558:5
         $this->donorEmailAddress = $donorEmailAddress;
     }
 
-    public function getCharityComms(): ?bool
+    protected function getCharityComms() : ?bool
     {
         return $this->charityComms;
killedBy: MatchBot\Tests\Domain\DonationTest::testBasicsAsExpectedOnInstantion
statusReason: 1) MatchBot\Tests\Domain\DonationTest::testBasicsAsExpectedOnInstantion
Error: Call to protected method MatchBot\Domain\Donation::getCharityComms() from scope MatchBot\Tests\Domain\DonationTest

/home/barney/projects/matchbot/tests/Domain/DonationTest.php:31

ERRORS!
Tests: 1, Assertions: 5, Errors: 1.

[Killed] PublicVisibility
Domain/Donation.php:563:5
         return $this->charityComms;
     }
 
-    public function setCharityComms(?bool $charityComms): void
+    protected function setCharityComms(?bool $charityComms) : void
     {
         $this->charityComms = $charityComms;
killedBy: MatchBot\Tests\Application\Commands\ClaimGiftAidTest::testNothingToSend
statusReason: 1) MatchBot\Tests\Application\Commands\ClaimGiftAidTest::testNothingToSend
Error: Call to protected method MatchBot\Domain\Donation::setCharityComms() from scope MatchBot\Tests\Application\Commands\ClaimGiftAidTest

/home/barney/projects/matchbot/tests/Application/DonationTestDataTrait.php:47
/home/barney/projects/matchbot/tests/Application/Commands/ClaimGiftAidTest.php:40

ERRORS!
Tests: 1, Asser

[Killed] PublicVisibility
Domain/Donation.php:568:5
         $this->charityComms = $charityComms;
     }
 
-    public function getChampionComms(): ?bool
+    protected function getChampionComms() : ?bool
     {
         return $this->championComms;
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

................................................................. 65 / 86 ( 75%)
.....................                                             86 / 86 (100%)

Time: 00:03.361, Memory: 34.00 MB

OK (86 tests, 634 assertions)

[Killed] PublicVisibility
Domain/Donation.php:573:5
         return $this->championComms;
     }
 
-    public function setChampionComms(?bool $championComms): void
+    protected function setChampionComms(?bool $championComms) : void
     {
         $this->championComms = $championComms;
killedBy: MatchBot\Tests\Application\Commands\ClaimGiftAidTest::testNothingToSend
statusReason: 1) MatchBot\Tests\Application\Commands\ClaimGiftAidTest::testNothingToSend
Error: Call to protected method MatchBot\Domain\Donation::setChampionComms() from scope MatchBot\Tests\Application\Commands\ClaimGiftAidTest

/home/barney/projects/matchbot/tests/Application/DonationTestDataTrait.php:48
/home/barney/projects/matchbot/tests/Application/Commands/ClaimGiftAidTest.php:40

ERRORS!
Tests: 1, Asse

[Killed] FalseValue
Domain/Donation.php:578:5
         $this->championComms = $championComms;
     }
 
-    public function getDonorFirstName(bool $salesforceSafe = false): ?string
+    public function getDonorFirstName(bool $salesforceSafe = true) : ?string
     {
         $firstName = $this->donorFirstName;
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

................................................................. 65 / 86 ( 75%)
.....................                                             86 / 86 (100%)

Time: 00:03.358, Memory: 34.00 MB

OK (86 tests, 634 assertions)

[Killed] PublicVisibility
Domain/Donation.php:578:5
         $this->championComms = $championComms;
     }
 
-    public function getDonorFirstName(bool $salesforceSafe = false): ?string
+    protected function getDonorFirstName(bool $salesforceSafe = false) : ?string
     {
         $firstName = $this->donorFirstName;
killedBy: MatchBot\Tests\Domain\DonationTest::testCreateDonationModelWithDonorFields
statusReason: 1) MatchBot\Tests\Domain\DonationTest::testCreateDonationModelWithDonorFields
Error: Call to protected method MatchBot\Domain\Donation::getDonorFirstName() from scope MatchBot\Tests\Domain\DonationTest

/home/barney/projects/matchbot/tests/Domain/DonationTest.php:367

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] IfNegation
Domain/Donation.php:582:9
     {
         $firstName = $this->donorFirstName;
 
-        if ($salesforceSafe) {
-            $firstName = $this->makeSalesforceSafe($firstName, false);
-        }
+        if (!$salesforceSafe) {
 
         return $firstName;
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

................................................................. 65 / 86 ( 75%)
.....................                                             86 / 86 (100%)

Time: 00:03.357, Memory: 34.00 MB

OK (86 tests, 634 assertions)

[Killed] FalseValue
Domain/Donation.php:583:13
         $firstName = $this->donorFirstName;
 
         if ($salesforceSafe) {
-            $firstName = $this->makeSalesforceSafe($firstName, false);
+            $firstName = $this->makeSalesforceSafe($firstName, true);
         }
 
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

................................................................. 65 / 86 ( 75%)
.....................                                             86 / 86 (100%)

Time: 00:03.367, Memory: 34.00 MB

OK (86 tests, 634 assertions)

[Killed] PublicVisibility
Domain/Donation.php:589:5
         return $firstName;
     }
 
-    public function setDonorFirstName(?string $donorFirstName): void
+    protected function setDonorFirstName(?string $donorFirstName) : void
     {
         $this->donorFirstName = $donorFirstName;
killedBy: MatchBot\Tests\Application\Commands\ClaimGiftAidTest::testNothingToSend
statusReason: 1) MatchBot\Tests\Application\Commands\ClaimGiftAidTest::testNothingToSend
Error: Call to protected method MatchBot\Domain\Donation::setDonorFirstName() from scope MatchBot\Tests\Application\Commands\ClaimGiftAidTest

/home/barney/projects/matchbot/tests/Application/DonationTestDataTrait.php:53
/home/barney/projects/matchbot/tests/Application/Commands/ClaimGiftAidTest.php:40

ERRORS!
Tests: 1, Ass

[Killed] FalseValue
Domain/Donation.php:594:5
         $this->donorFirstName = $donorFirstName;
     }
 
-    public function getDonorLastName(bool $salesforceSafe = false): ?string
+    public function getDonorLastName(bool $salesforceSafe = true) : ?string
     {
         $lastName = $this->donorLastName;
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

................................................................. 65 / 86 ( 75%)
.....................                                             86 / 86 (100%)

Time: 00:03.368, Memory: 34.00 MB

OK (86 tests, 634 assertions)

[Killed] PublicVisibility
Domain/Donation.php:594:5
         $this->donorFirstName = $donorFirstName;
     }
 
-    public function getDonorLastName(bool $salesforceSafe = false): ?string
+    protected function getDonorLastName(bool $salesforceSafe = false) : ?string
     {
         $lastName = $this->donorLastName;
killedBy: MatchBot\Tests\Domain\DonationTest::testCreateDonationModelWithDonorFields
statusReason: 1) MatchBot\Tests\Domain\DonationTest::testCreateDonationModelWithDonorFields
Error: Call to protected method MatchBot\Domain\Donation::getDonorLastName() from scope MatchBot\Tests\Domain\DonationTest

/home/barney/projects/matchbot/tests/Domain/DonationTest.php:368

ERRORS!
Tests: 1, Assertions: 1, Errors: 1.

[Killed] IfNegation
Domain/Donation.php:598:9
     {
         $lastName = $this->donorLastName;
 
-        if ($salesforceSafe) {
-            $lastName = $this->makeSalesforceSafe($lastName, true);
-        }
+        if (!$salesforceSafe) {
 
         return $lastName;
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

................................................................. 65 / 86 ( 75%)
.....................                                             86 / 86 (100%)

Time: 00:03.358, Memory: 34.00 MB

OK (86 tests, 634 assertions)

[Killed] TrueValue
Domain/Donation.php:599:13
         $lastName = $this->donorLastName;
 
         if ($salesforceSafe) {
-            $lastName = $this->makeSalesforceSafe($lastName, true);
+            $lastName = $this->makeSalesforceSafe($lastName, false);
         }
 
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

................................................................. 65 / 86 ( 75%)
.....................                                             86 / 86 (100%)

Time: 00:03.368, Memory: 34.00 MB

OK (86 tests, 634 assertions)

[Killed] PublicVisibility
Domain/Donation.php:605:5
         return $lastName;
     }
 
-    public function setDonorLastName(?string $donorLastName): void
+    protected function setDonorLastName(?string $donorLastName) : void
     {
         $this->donorLastName = $donorLastName;
killedBy: MatchBot\Tests\Application\Commands\ClaimGiftAidTest::testNothingToSend
statusReason: 1) MatchBot\Tests\Application\Commands\ClaimGiftAidTest::testNothingToSend
Error: Call to protected method MatchBot\Domain\Donation::setDonorLastName() from scope MatchBot\Tests\Application\Commands\ClaimGiftAidTest

/home/barney/projects/matchbot/tests/Application/DonationTestDataTrait.php:54
/home/barney/projects/matchbot/tests/Application/Commands/ClaimGiftAidTest.php:40

ERRORS!
Tests: 1, Asse

[Killed] PublicVisibility
Domain/Donation.php:610:5
         $this->donorLastName = $donorLastName;
     }
 
-    public function getDonorBillingAddress(): ?string
+    protected function getDonorBillingAddress() : ?string
     {
         return $this->donorPostalAddress;
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

................................................................. 65 / 86 ( 75%)
.....................                                             86 / 86 (100%)

Time: 00:03.372, Memory: 34.00 MB

OK (86 tests, 634 assertions)

[Killed] PublicVisibility
Domain/Donation.php:615:5
         return $this->donorPostalAddress;
     }
 
-    public function setDonorBillingAddress(?string $donorPostalAddress): void
+    protected function setDonorBillingAddress(?string $donorPostalAddress) : void
     {
         $this->donorPostalAddress = $donorPostalAddress;
killedBy: MatchBot\Tests\Application\Commands\ClaimGiftAidTest::testNothingToSend
statusReason: 1) MatchBot\Tests\Application\Commands\ClaimGiftAidTest::testNothingToSend
Error: Call to protected method MatchBot\Domain\Donation::setDonorBillingAddress() from scope MatchBot\Tests\Application\Commands\ClaimGiftAidTest

/home/barney/projects/matchbot/tests/Application/DonationTestDataTrait.php:55
/home/barney/projects/matchbot/tests/Application/Commands/ClaimGiftAidTest.php:40

ERRORS!
Tests: 1

[Killed] PublicVisibility
Domain/Donation.php:620:5
         $this->donorPostalAddress = $donorPostalAddress;
     }
 
-    public function hasGiftAid(): ?bool
+    protected function hasGiftAid() : ?bool
     {
         return $this->giftAid;
killedBy: MatchBot\Tests\Domain\DonationTest::testBasicsAsExpectedOnInstantion
statusReason: 1) MatchBot\Tests\Domain\DonationTest::testBasicsAsExpectedOnInstantion
Error: Call to protected method MatchBot\Domain\Donation::hasGiftAid() from scope MatchBot\Tests\Domain\DonationTest

/home/barney/projects/matchbot/tests/Domain/DonationTest.php:30

ERRORS!
Tests: 1, Assertions: 4, Errors: 1.

[Killed] PublicVisibility
Domain/Donation.php:625:5
         return $this->giftAid;
     }
 
-    public function setGiftAid(?bool $giftAid): void
+    protected function setGiftAid(?bool $giftAid) : void
     {
         $this->giftAid = $giftAid;
killedBy: MatchBot\Tests\Application\Commands\ClaimGiftAidTest::testNothingToSend
statusReason: 1) MatchBot\Tests\Application\Commands\ClaimGiftAidTest::testNothingToSend
Error: Call to protected method MatchBot\Domain\Donation::setGiftAid() from scope MatchBot\Tests\Application\Commands\ClaimGiftAidTest

/home/barney/projects/matchbot/tests/Application/DonationTestDataTrait.php:58
/home/barney/projects/matchbot/tests/Application/Commands/ClaimGiftAidTest.php:40

ERRORS!
Tests: 1, Assertions

[Killed] Identical
Domain/Donation.php:632:9
         // Default tip Gift Aid to main Gift Aid value. If it is set explicitly
         // first this will be skipped. If set explicitly after, the later call
         // will persist.
-        if ($this->tipGiftAid === null) {
+        if ($this->tipGiftAid !== null) {
             $this->tipGiftAid = $giftAid;
         }
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

...............................................................  63 / 139 ( 45%)
............................................................... 126 / 139 ( 90%)
.............                                                   139 / 139 (100%)

Time: 00:03.426, Memory: 46.00 MB

[Killed] PublicVisibility
Domain/Donation.php:637:5
         }
     }
 
-    public function getTbgComms(): ?bool
+    protected function getTbgComms() : ?bool
     {
         return $this->tbgComms;
killedBy: MatchBot\Tests\Domain\DonationTest::testBasicsAsExpectedOnInstantion
statusReason: 1) MatchBot\Tests\Domain\DonationTest::testBasicsAsExpectedOnInstantion
Error: Call to protected method MatchBot\Domain\Donation::getTbgComms() from scope MatchBot\Tests\Domain\DonationTest

/home/barney/projects/matchbot/tests/Domain/DonationTest.php:32

ERRORS!
Tests: 1, Assertions: 6, Errors: 1.

[Killed] PublicVisibility
Domain/Donation.php:642:5
         return $this->tbgComms;
     }
 
-    public function setTbgComms(?bool $tbgComms): void
+    protected function setTbgComms(?bool $tbgComms) : void
     {
         $this->tbgComms = $tbgComms;
killedBy: MatchBot\Tests\Application\Commands\ClaimGiftAidTest::testNothingToSend
statusReason: 1) MatchBot\Tests\Application\Commands\ClaimGiftAidTest::testNothingToSend
Error: Call to protected method MatchBot\Domain\Donation::setTbgComms() from scope MatchBot\Tests\Application\Commands\ClaimGiftAidTest

/home/barney/projects/matchbot/tests/Application/DonationTestDataTrait.php:62
/home/barney/projects/matchbot/tests/Application/Commands/ClaimGiftAidTest.php:40

ERRORS!
Tests: 1, Assertion

[Killed] PublicVisibility
Domain/Donation.php:660:5
     /**
      * @return string   In full pounds GBP. Net fee if VAT is added.
      */
-    public function getCharityFee(): string
+    protected function getCharityFee() : string
     {
         return $this->charityFee;
killedBy: MatchBot\Tests\Application\Actions\Donations\ConfirmTest::test_it_confirms_a_card_donation
statusReason: 1) MatchBot\Tests\Application\Actions\Donations\ConfirmTest::test_it_confirms_a_card_donation
Error: Call to protected method MatchBot\Domain\Donation::getCharityFee() from scope MatchBot\Application\Actions\Donations\Confirm

/home/barney/projects/matchbot/src/Application/Actions/Donations/Confirm.php:113
/home/barney/projects/matchbot/src/Application/Actions/Action.php:34
/home/barney/projects/m

[Killed] PublicVisibility
Domain/Donation.php:665:5
         return $this->charityFee;
     }
 
-    #[Pure] public function getCharityFeeGross(): string
+    protected function getCharityFeeGross() : string
     {
         return bcadd($this->getCharityFee(), $this->getCharityFeeVat(), 2);
killedBy: MatchBot\Tests\Application\Actions\Donations\ConfirmTest::test_it_confirms_a_card_donation
statusReason: 1) MatchBot\Tests\Application\Actions\Donations\ConfirmTest::test_it_confirms_a_card_donation
Error: Call to protected method MatchBot\Domain\Donation::getCharityFeeGross() from scope MatchBot\Application\Actions\Donations\Confirm

/home/barney/projects/matchbot/src/Application/Actions/Donations/Confirm.php:112
/home/barney/projects/matchbot/src/Application/Actions/Action.php:34
/home/barney/proje

[Killed] DecrementInteger
Domain/Donation.php:667:9
 
     #[Pure] public function getCharityFeeGross(): string
     {
-        return bcadd($this->getCharityFee(), $this->getCharityFeeVat(), 2);
+        return bcadd($this->getCharityFee(), $this->getCharityFeeVat(), 1);
     }
 
killedBy: MatchBot\Tests\Domain\DonationRepositoryTest::testStripeAmountForCharityWithFeeCover
statusReason: 1) MatchBot\Tests\Domain\DonationRepositoryTest::testStripeAmountForCharityWithFeeCover
Failed asserting that 4440 matches expected 4444.

/home/barney/projects/matchbot/tests/Domain/DonationRepositoryTest.php:265

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] IncrementInteger
Domain/Donation.php:667:9
 
     #[Pure] public function getCharityFeeGross(): string
     {
-        return bcadd($this->getCharityFee(), $this->getCharityFeeVat(), 2);
+        return bcadd($this->getCharityFee(), $this->getCharityFeeVat(), 3);
     }
 
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

................................................................. 65 / 72 ( 90%)
.......                                                           72 / 72 (100%)

Time: 00:03.387, Memory: 38.00 MB

OK (72 tests, 626 assertions)

[Killed] PublicVisibility
Domain/Donation.php:670:5
         return bcadd($this->getCharityFee(), $this->getCharityFeeVat(), 2);
     }
 
-    public function setCharityFee(string $charityFee): void
+    protected function setCharityFee(string $charityFee) : void
     {
         $this->charityFee = $charityFee;
killedBy: MatchBot\Tests\Application\Commands\ClaimGiftAidTest::testNothingToSend
statusReason: 1) MatchBot\Tests\Application\Commands\ClaimGiftAidTest::testNothingToSend
Error: Call to protected method MatchBot\Domain\Donation::setCharityFee() from scope MatchBot\Tests\Application\Commands\ClaimGiftAidTest

/home/barney/projects/matchbot/tests/Application/DonationTestDataTrait.php:45
/home/barney/projects/matchbot/tests/Application/Commands/ClaimGiftAidTest.php:40

ERRORS!
Tests: 1, Asserti

[Killed] PublicVisibility
Domain/Donation.php:675:5
         $this->charityFee = $charityFee;
     }
 
-    public function setTransactionId(string $transactionId): void
+    protected function setTransactionId(string $transactionId) : void
     {
         $this->transactionId = $transactionId;
killedBy: MatchBot\Tests\Application\Commands\ClaimGiftAidTest::testNothingToSend
statusReason: 1) MatchBot\Tests\Application\Commands\ClaimGiftAidTest::testNothingToSend
Error: Call to protected method MatchBot\Domain\Donation::setTransactionId() from scope MatchBot\Tests\Application\Commands\ClaimGiftAidTest

/home/barney/projects/matchbot/tests/Application/DonationTestDataTrait.php:65
/home/barney/projects/matchbot/tests/Application/Commands/ClaimGiftAidTest.php:40

ERRORS!
Tests: 1, Asse

[Killed] PublicVisibility
Domain/Donation.php:680:5
         $this->transactionId = $transactionId;
     }
 
-    public function setChargeId(string $chargeId): void
+    protected function setChargeId(string $chargeId) : void
     {
         $this->chargeId = $chargeId;
killedBy: MatchBot\Tests\Application\Commands\ClaimGiftAidTest::testNothingToSend
statusReason: 1) MatchBot\Tests\Application\Commands\ClaimGiftAidTest::testNothingToSend
Error: Call to protected method MatchBot\Domain\Donation::setChargeId() from scope MatchBot\Tests\Application\Commands\ClaimGiftAidTest

/home/barney/projects/matchbot/tests/Application/DonationTestDataTrait.php:66
/home/barney/projects/matchbot/tests/Application/Commands/ClaimGiftAidTest.php:40

ERRORS!
Tests: 1, Assertion

[Killed] PublicVisibility
Domain/Donation.php:688:5
     /**
      * @return string|null
      */
-    public function getTransferId(): ?string
+    protected function getTransferId() : ?string
     {
         return $this->transferId;
killedBy: MatchBot\Tests\Application\Actions\Hooks\StripePaymentsUpdateTest::testSuccessfulPayment
statusReason: 1) MatchBot\Tests\Application\Actions\Hooks\StripePaymentsUpdateTest::testSuccessfulPayment
Error: Call to protected method MatchBot\Domain\Donation::getTransferId() from scope MatchBot\Tests\Application\Actions\Hooks\StripePaymentsUpdateTest

/home/barney/projects/matchbot/tests/Application/Actions/Hooks/StripePaymentsUpdateTest.php:148

ERRORS!
Tests: 1, Assertions: 1, Errors: 1.

[Killed] PublicVisibility
Domain/Donation.php:696:5
     /**
      * @param string|null $transferId
      */
-    public function setTransferId(?string $transferId): void
+    protected function setTransferId(?string $transferId) : void
     {
         $this->transferId = $transferId;
killedBy: MatchBot\Tests\Application\Commands\ClaimGiftAidTest::testNothingToSend
statusReason: 1) MatchBot\Tests\Application\Commands\ClaimGiftAidTest::testNothingToSend
Error: Call to protected method MatchBot\Domain\Donation::setTransferId() from scope MatchBot\Tests\Application\Commands\ClaimGiftAidTest

/home/barney/projects/matchbot/tests/Application/DonationTestDataTrait.php:64
/home/barney/projects/matchbot/tests/Application/Commands/ClaimGiftAidTest.php:40

ERRORS!
Tests: 1, Asserti

[Killed] PublicVisibility
Domain/Donation.php:701:5
         $this->transferId = $transferId;
     }
 
-    public function getDonorCountryCode(): ?string
+    protected function getDonorCountryCode() : ?string
     {
         return $this->donorCountryCode;
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

................................................................. 65 / 86 ( 75%)
.....................                                             86 / 86 (100%)

Time: 00:03.372, Memory: 34.00 MB

OK (86 tests, 634 assertions)

[Killed] PublicVisibility
Domain/Donation.php:709:5
     /**
      * @return string   Total amount in withdrawals - not necessarily finalised.
      */
-    public function getFundingWithdrawalTotal(): string
+    protected function getFundingWithdrawalTotal() : string
     {
         $withdrawalTotal = '0.0';
killedBy: MatchBot\Tests\Application\Actions\Donations\CreateTest::testSuccessWithStripeAccountIDMissingInitiallyButFoundOnRefetch
statusReason: 1) MatchBot\Tests\Application\Actions\Donations\CreateTest::testSuccessWithStripeAccountIDMissingInitiallyButFoundOnRefetch
Error: Call to protected method MatchBot\Domain\Donation::getFundingWithdrawalTotal() from scope MatchBot\Application\Actions\Donations\Create

/home/barney/projects/matchbot/src/Application/Actions/Donations/Create.php:189
/home/barney/projects/matchbot/src/Application/Actio
