[Killed] Foreach_
Domain/Donation.php:712:9
     public function getFundingWithdrawalTotal(): string
     {
         $withdrawalTotal = '0.0';
-        foreach ($this->fundingWithdrawals as $fundingWithdrawal) {
-            $withdrawalTotal = bcadd($withdrawalTotal, $fundingWithdrawal->getAmount(), 2);
-        }
+        foreach (array() as $fundingWithdrawal) {
 
         return $withdrawalTotal;
killedBy: MatchBot\Tests\Domain\DonationTest::testToApiModel
statusReason: 1) MatchBot\Tests\Domain\DonationTest::testToApiModel
Failed asserting that 0.0 matches expected '1.23'.

/home/barney/projects/matchbot/tests/Domain/DonationTest.php:180

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.

[Killed] IncrementInteger
Domain/Donation.php:713:13
     {
         $withdrawalTotal = '0.0';
         foreach ($this->fundingWithdrawals as $fundingWithdrawal) {
-            $withdrawalTotal = bcadd($withdrawalTotal, $fundingWithdrawal->getAmount(), 2);
+            $withdrawalTotal = bcadd($withdrawalTotal, $fundingWithdrawal->getAmount(), 3);
         }
 
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

............................................                      44 / 44 (100%)

Time: 00:00.078, Memory: 22.00 MB

OK (44 tests, 282 assertions)

[Killed] BCMath
Domain/Donation.php:713:13
     {
         $withdrawalTotal = '0.0';
         foreach ($this->fundingWithdrawals as $fundingWithdrawal) {
-            $withdrawalTotal = bcadd($withdrawalTotal, $fundingWithdrawal->getAmount(), 2);
+            $withdrawalTotal = (string) ($withdrawalTotal + $fundingWithdrawal->getAmount());
         }
 
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

............................................                      44 / 44 (100%)

Time: 00:00.076, Memory: 22.00 MB

OK (44 tests, 282 assertions)

[Killed] PublicVisibility
Domain/Donation.php:722:5
     /**
      * @return string Total amount *finalised*, matched by `Fund`s of type "championFund"
      */
-    public function getConfirmedChampionWithdrawalTotal(): string
+    protected function getConfirmedChampionWithdrawalTotal() : string
     {
         if (!$this->getDonationStatus()->isSuccessful()) {
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

............................................................      60 / 60 (100%)

Time: 00:03.098, Memory: 26.00 MB

OK (60 tests, 382 assertions)

[Killed] LogicalNot
Domain/Donation.php:724:9
      */
     public function getConfirmedChampionWithdrawalTotal(): string
     {
-        if (!$this->getDonationStatus()->isSuccessful()) {
+        if ($this->getDonationStatus()->isSuccessful()) {
             return '0.0';
         }
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

............................................................      60 / 60 (100%)

Time: 00:03.092, Memory: 26.00 MB

OK (60 tests, 382 assertions)

[Killed] Foreach_
Domain/Donation.php:729:9
         }
 
         $withdrawalTotal = '0.0';
-        foreach ($this->fundingWithdrawals as $fundingWithdrawal) {
-            // Rely on Doctrine `SINGLE_TABLE` inheritance structure to derive the type from the concrete class.
-            if ($fundingWithdrawal->getCampaignFunding()->getFund() instanceof ChampionFund) {
-                $withdrawalTotal = bcadd($withdrawalTotal, $fundingWithdrawal->getAmount(), 2);
-            }
-        }
+        foreach (array() as $fundingWithdrawal) {
 
         return $withdrawalTotal;
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

............................................................      60 / 60 (100%)

Time: 00:03.101, Memory: 26.00 MB

OK (60 tests, 382 assertions)

[NoCoverage] InstanceOf_
Domain/Donation.php:731:13
         $withdrawalTotal = '0.0';
         foreach ($this->fundingWithdrawals as $fundingWithdrawal) {
             // Rely on Doctrine `SINGLE_TABLE` inheritance structure to derive the type from the concrete class.
-            if ($fundingWithdrawal->getCampaignFunding()->getFund() instanceof ChampionFund) {
+            if (true) {
                 $withdrawalTotal = bcadd($withdrawalTotal, $fundingWithdrawal->getAmount(), 2);
             }

[NoCoverage] InstanceOf_
Domain/Donation.php:731:13
         $withdrawalTotal = '0.0';
         foreach ($this->fundingWithdrawals as $fundingWithdrawal) {
             // Rely on Doctrine `SINGLE_TABLE` inheritance structure to derive the type from the concrete class.
-            if ($fundingWithdrawal->getCampaignFunding()->getFund() instanceof ChampionFund) {
+            if (false) {
                 $withdrawalTotal = bcadd($withdrawalTotal, $fundingWithdrawal->getAmount(), 2);
             }

[NoCoverage] IncrementInteger
Domain/Donation.php:732:17
         foreach ($this->fundingWithdrawals as $fundingWithdrawal) {
             // Rely on Doctrine `SINGLE_TABLE` inheritance structure to derive the type from the concrete class.
             if ($fundingWithdrawal->getCampaignFunding()->getFund() instanceof ChampionFund) {
-                $withdrawalTotal = bcadd($withdrawalTotal, $fundingWithdrawal->getAmount(), 2);
+                $withdrawalTotal = bcadd($withdrawalTotal, $fundingWithdrawal->getAmount(), 3);
             }
         }

[NoCoverage] DecrementInteger
Domain/Donation.php:732:17
         foreach ($this->fundingWithdrawals as $fundingWithdrawal) {
             // Rely on Doctrine `SINGLE_TABLE` inheritance structure to derive the type from the concrete class.
             if ($fundingWithdrawal->getCampaignFunding()->getFund() instanceof ChampionFund) {
-                $withdrawalTotal = bcadd($withdrawalTotal, $fundingWithdrawal->getAmount(), 2);
+                $withdrawalTotal = bcadd($withdrawalTotal, $fundingWithdrawal->getAmount(), 1);
             }
         }

[Killed] PublicVisibility
Domain/Donation.php:742:5
     /**
      * @return string Total amount *finalised*, matched by `Fund`s of type "pledge"
      */
-    public function getConfirmedPledgeWithdrawalTotal(): string
+    protected function getConfirmedPledgeWithdrawalTotal() : string
     {
         if (!$this->getDonationStatus()->isSuccessful()) {
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

............................................................      60 / 60 (100%)

Time: 00:03.098, Memory: 26.00 MB

OK (60 tests, 382 assertions)

[Killed] Foreach_
Domain/Donation.php:749:9
         }
 
         $withdrawalTotal = '0.0';
-        foreach ($this->fundingWithdrawals as $fundingWithdrawal) {
-            // Rely on Doctrine `SINGLE_TABLE` inheritance structure to derive the type from the concrete class.
-            if ($fundingWithdrawal->getCampaignFunding()->getFund() instanceof Pledge) {
-                $withdrawalTotal = bcadd($withdrawalTotal, $fundingWithdrawal->getAmount(), 2);
-            }
-        }
+        foreach (array() as $fundingWithdrawal) {
 
         return $withdrawalTotal;
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

............................................................      60 / 60 (100%)

Time: 00:03.092, Memory: 26.00 MB

OK (60 tests, 382 assertions)

[NoCoverage] InstanceOf_
Domain/Donation.php:751:13
         $withdrawalTotal = '0.0';
         foreach ($this->fundingWithdrawals as $fundingWithdrawal) {
             // Rely on Doctrine `SINGLE_TABLE` inheritance structure to derive the type from the concrete class.
-            if ($fundingWithdrawal->getCampaignFunding()->getFund() instanceof Pledge) {
+            if (true) {
                 $withdrawalTotal = bcadd($withdrawalTotal, $fundingWithdrawal->getAmount(), 2);
             }

[NoCoverage] InstanceOf_
Domain/Donation.php:751:13
         $withdrawalTotal = '0.0';
         foreach ($this->fundingWithdrawals as $fundingWithdrawal) {
             // Rely on Doctrine `SINGLE_TABLE` inheritance structure to derive the type from the concrete class.
-            if ($fundingWithdrawal->getCampaignFunding()->getFund() instanceof Pledge) {
+            if (false) {
                 $withdrawalTotal = bcadd($withdrawalTotal, $fundingWithdrawal->getAmount(), 2);
             }

[NoCoverage] DecrementInteger
Domain/Donation.php:752:17
         foreach ($this->fundingWithdrawals as $fundingWithdrawal) {
             // Rely on Doctrine `SINGLE_TABLE` inheritance structure to derive the type from the concrete class.
             if ($fundingWithdrawal->getCampaignFunding()->getFund() instanceof Pledge) {
-                $withdrawalTotal = bcadd($withdrawalTotal, $fundingWithdrawal->getAmount(), 2);
+                $withdrawalTotal = bcadd($withdrawalTotal, $fundingWithdrawal->getAmount(), 1);
             }
         }

[NoCoverage] BCMath
Domain/Donation.php:752:17
         foreach ($this->fundingWithdrawals as $fundingWithdrawal) {
             // Rely on Doctrine `SINGLE_TABLE` inheritance structure to derive the type from the concrete class.
             if ($fundingWithdrawal->getCampaignFunding()->getFund() instanceof Pledge) {
-                $withdrawalTotal = bcadd($withdrawalTotal, $fundingWithdrawal->getAmount(), 2);
+                $withdrawalTotal = (string) ($withdrawalTotal + $fundingWithdrawal->getAmount());
             }
         }

[Killed] PublicVisibility
Domain/Donation.php:766:5
      *
      * @throws \LogicException if the transaction ID is not set
      */
-    public function getTransactionId(): string
+    protected function getTransactionId() : string
     {
         if (!$this->transactionId) {
killedBy: MatchBot\Tests\Application\Actions\Donations\ConfirmTest::test_it_confirms_a_card_donation
statusReason: 1) MatchBot\Tests\Application\Actions\Donations\ConfirmTest::test_it_confirms_a_card_donation
Error: Call to protected method MatchBot\Domain\Donation::getTransactionId() from scope MatchBot\Application\Actions\Donations\Confirm

/home/barney/projects/matchbot/src/Application/Actions/Donations/Confirm.php:84
/home/barney/projects/matchbot/src/Application/Actions/Action.php:34
/home/barney/projects

[Killed] LogicalNot
Domain/Donation.php:768:9
      */
     public function getTransactionId(): string
     {
-        if (!$this->transactionId) {
+        if ($this->transactionId) {
             throw new \LogicException('Transaction ID not set');
         }
killedBy: MatchBot\Tests\Application\Auth\DonationRecaptchaMiddlewareTest::testFailure
statusReason: 1) MatchBot\Tests\Application\Auth\DonationRecaptchaMiddlewareTest::testFailure
LogicException: Transaction ID not set

/home/barney/projects/matchbot/src/Domain/Donation.php:604
/home/barney/projects/matchbot/src/Domain/Donation.php:378
/home/barney/projects/matchbot/tests/Application/Auth/DonationRecaptchaMiddlewareTest.php:27

ERRORS!

[NoCoverage] Throw_
Domain/Donation.php:769:13
     public function getTransactionId(): string
     {
         if (!$this->transactionId) {
-            throw new \LogicException('Transaction ID not set');
+            new \LogicException('Transaction ID not set');
         }
 

[Killed] PublicVisibility
Domain/Donation.php:775:5
         return $this->transactionId;
     }
 
-    public function getChargeId(): ?string
+    protected function getChargeId() : ?string
     {
         return $this->chargeId;
killedBy: MatchBot\Tests\Application\Messenger\Handler\StripePayoutHandlerTest::testUnrecognisedChargeId
statusReason: 1) MatchBot\Tests\Application\Messenger\Handler\StripePayoutHandlerTest::testUnrecognisedChargeId
Error: Call to protected method MatchBot\Domain\Donation::getChargeId() from scope MatchBot\Application\Messenger\Handler\StripePayoutHandler

/home/barney/projects/matchbot/src/Application/Messenger/Handler/StripePayoutHandler.php:233
/home/barney/projects/matchbot/src/Application/Messenger/Handler/S

[Killed] PublicVisibility
Domain/Donation.php:783:5
     /**
      * @return string
      */
-    public function getUuid(): string
+    protected function getUuid() : string
     {
         return $this->uuid->toString();
killedBy: MatchBot\Tests\Application\Commands\ClaimGiftAidTest::testNothingToSend
statusReason: 1) MatchBot\Tests\Application\Commands\ClaimGiftAidTest::testNothingToSend
Error: Call to protected method MatchBot\Domain\Donation::getUuid() from scope MatchBot\Tests\Application\Commands\ClaimGiftAidTest

/home/barney/projects/matchbot/tests/Application/Commands/ClaimGiftAidTest.php:44

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] PublicVisibility
Domain/Donation.php:791:5
     /**
      * @param UuidInterface $uuid
      */
-    public function setUuid(UuidInterface $uuid): void
+    protected function setUuid(UuidInterface $uuid) : void
     {
         $this->uuid = $uuid;
killedBy: MatchBot\Tests\Application\Commands\ClaimGiftAidTest::testNothingToSend
statusReason: 1) MatchBot\Tests\Application\Commands\ClaimGiftAidTest::testNothingToSend
Error: Call to protected method MatchBot\Domain\Donation::setUuid() from scope MatchBot\Tests\Application\Commands\ClaimGiftAidTest

/home/barney/projects/matchbot/tests/Application/DonationTestDataTrait.php:67
/home/barney/projects/matchbot/tests/Application/Commands/ClaimGiftAidTest.php:40

ERRORS!
Tests: 1, Assertions: 0

[Killed] PublicVisibility
Domain/Donation.php:796:5
         $this->uuid = $uuid;
     }
 
-    public function addFundingWithdrawal(FundingWithdrawal $fundingWithdrawal): void
+    protected function addFundingWithdrawal(FundingWithdrawal $fundingWithdrawal) : void
     {
         $this->fundingWithdrawals->add($fundingWithdrawal);
killedBy: MatchBot\Tests\Domain\DonationTest::testToApiModel
statusReason: 1) MatchBot\Tests\Domain\DonationTest::testToApiModel
Error: Call to protected method MatchBot\Domain\Donation::addFundingWithdrawal() from scope MatchBot\Tests\Domain\DonationTest

/home/barney/projects/matchbot/tests/Domain/DonationTest.php:175

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] MethodCallRemoval
Domain/Donation.php:798:9
 
     public function addFundingWithdrawal(FundingWithdrawal $fundingWithdrawal): void
     {
-        $this->fundingWithdrawals->add($fundingWithdrawal);
+        
     }
 
killedBy: MatchBot\Tests\Domain\DonationTest::testToApiModel
statusReason: 1) MatchBot\Tests\Domain\DonationTest::testToApiModel
Failed asserting that 0.0 matches expected '1.23'.

/home/barney/projects/matchbot/tests/Domain/DonationTest.php:180

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.

[NoCoverage] PublicVisibility
Domain/Donation.php:804:5
     /**
      * @return ArrayCollection|FundingWithdrawal[]
      */
-    public function getFundingWithdrawals()
+    protected function getFundingWithdrawals()
     {
         return $this->fundingWithdrawals;

[Killed] PublicVisibility
Domain/Donation.php:812:5
     /**
      * @param string $donorCountryCode
      */
-    public function setDonorCountryCode(string $donorCountryCode): void
+    protected function setDonorCountryCode(string $donorCountryCode) : void
     {
         $this->donorCountryCode = $donorCountryCode;
killedBy: MatchBot\Tests\Application\Commands\ClaimGiftAidTest::testNothingToSend
statusReason: 1) MatchBot\Tests\Application\Commands\ClaimGiftAidTest::testNothingToSend
Error: Call to protected method MatchBot\Domain\Donation::setDonorCountryCode() from scope MatchBot\Tests\Application\Commands\ClaimGiftAidTest

/home/barney/projects/matchbot/tests/Application/DonationTestDataTrait.php:51
/home/barney/projects/matchbot/tests/Application/Commands/ClaimGiftAidTest.php:40

ERRORS!
Tests: 1, A

[Killed] PublicVisibility
Domain/Donation.php:820:5
     /**
      * @return string   Payment Service Provider short identifier, e.g. 'stripe'.
      */
-    public function getPsp(): string
+    protected function getPsp() : string
     {
         return $this->psp;
killedBy: MatchBot\Tests\Domain\DonationRepositoryTest::testBuildFromApiRequestSuccess
statusReason: 1) MatchBot\Tests\Domain\DonationRepositoryTest::testBuildFromApiRequestSuccess
Error: Call to protected method MatchBot\Domain\Donation::getPsp() from scope MatchBot\Domain\DonationRepository

/home/barney/projects/matchbot/src/Domain/DonationRepository.php:548
/home/barney/projects/matchbot/src/Domain/DonationRepository.php:166
/home/barney/projects/matchbot/tests/Domain/DonationRepositoryTest.p

[Killed] PublicVisibility
Domain/Donation.php:829:5
      * @psalm-param 'stripe' $psp
      * @param string $psp   Payment Service Provider short identifier, e.g. 'stripe'.
      */
-    public function setPsp(string $psp): void
+    protected function setPsp(string $psp) : void
     {
         if (!in_array($psp, $this->possiblePSPs, true)) {
killedBy: MatchBot\Tests\Application\Commands\ClaimGiftAidTest::testNothingToSend
statusReason: 1) MatchBot\Tests\Application\Commands\ClaimGiftAidTest::testNothingToSend
Error: Call to protected method MatchBot\Domain\Donation::setPsp() from scope MatchBot\Tests\Application\Commands\ClaimGiftAidTest

/home/barney/projects/matchbot/tests/Application/DonationTestDataTrait.php:59
/home/barney/projects/matchbot/tests/Application/Commands/ClaimGiftAidTest.php:40

ERRORS!
Tests: 1, Assertions: 0,

[Killed] LogicalNot
Domain/Donation.php:831:9
      */
     public function setPsp(string $psp): void
     {
-        if (!in_array($psp, $this->possiblePSPs, true)) {
+        if (in_array($psp, $this->possiblePSPs, true)) {
             throw new \UnexpectedValueException("Unexpected PSP '$psp'");
         }
killedBy: MatchBot\Tests\Application\Commands\ClaimGiftAidTest::testNothingToSend
statusReason: 1) MatchBot\Tests\Application\Commands\ClaimGiftAidTest::testNothingToSend
UnexpectedValueException: Unexpected PSP 'stripe'

/home/barney/projects/matchbot/src/Domain/Donation.php:658
/home/barney/projects/matchbot/tests/Application/DonationTestDataTrait.php:59
/home/barney/projects/matchbot/tests/Application/Commands/ClaimGiftAidTest.php:40

ERRORS!

[Killed] Throw_
Domain/Donation.php:832:13
     public function setPsp(string $psp): void
     {
         if (!in_array($psp, $this->possiblePSPs, true)) {
-            throw new \UnexpectedValueException("Unexpected PSP '$psp'");
+            new \UnexpectedValueException("Unexpected PSP '{$psp}'");
         }
 
killedBy: MatchBot\Tests\Domain\DonationTest::testInvalidPspRejected
statusReason: 1) MatchBot\Tests\Domain\DonationTest::testInvalidPspRejected
Failed asserting that exception of type "UnexpectedValueException" is thrown.

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] PublicVisibility
Domain/Donation.php:841:5
     /**
      * @return string
      */
-    public function getFeeCoverAmount(): string
+    protected function getFeeCoverAmount() : string
     {
         return $this->feeCoverAmount;
killedBy: MatchBot\Tests\Application\Actions\Donations\CreateTest::testSuccessWithStripeAccountIDMissingInitiallyButFoundOnRefetch
statusReason: 1) MatchBot\Tests\Application\Actions\Donations\CreateTest::testSuccessWithStripeAccountIDMissingInitiallyButFoundOnRefetch
Error: Call to protected method MatchBot\Domain\Donation::getFeeCoverAmount() from scope MatchBot\Application\Actions\Donations\Create

/home/barney/projects/matchbot/src/Application/Actions/Donations/Create.php:188
/home/barney/projects/matchbot/src/Application/Actions/Actio

[Killed] PublicVisibility
Domain/Donation.php:849:5
     /**
      * @param string $feeCoverAmount
      */
-    public function setFeeCoverAmount(string $feeCoverAmount): void
+    protected function setFeeCoverAmount(string $feeCoverAmount) : void
     {
         $this->feeCoverAmount = $feeCoverAmount;
killedBy: MatchBot\Tests\Domain\DonationRepositoryTest::testStripeAmountForCharityWithFeeCover
statusReason: 1) MatchBot\Tests\Domain\DonationRepositoryTest::testStripeAmountForCharityWithFeeCover
Error: Call to protected method MatchBot\Domain\Donation::setFeeCoverAmount() from scope MatchBot\Tests\Domain\DonationRepositoryTest

/home/barney/projects/matchbot/tests/Domain/DonationRepositoryTest.php:255

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] PublicVisibility
Domain/Donation.php:857:5
     /**
      * @return string
      */
-    public function getTipAmount(): string
+    protected function getTipAmount() : string
     {
         return $this->tipAmount;
killedBy: MatchBot\Tests\Domain\DonationTest::testValidDataPersisted
statusReason: 1) MatchBot\Tests\Domain\DonationTest::testValidDataPersisted
Error: Call to protected method MatchBot\Domain\Donation::getTipAmount() from scope MatchBot\Tests\Domain\DonationTest

/home/barney/projects/matchbot/tests/Domain/DonationTest.php:57

ERRORS!
Tests: 1, Assertions: 1, Errors: 1.

[Killed] PublicVisibility
Domain/Donation.php:862:5
         return $this->tipAmount;
     }
 
-    public function setTipAmount(string $tipAmount): void
+    protected function setTipAmount(string $tipAmount) : void
     {
         /** @psalm-var numeric-string $tipAmount */
killedBy: MatchBot\Tests\Application\Commands\ClaimGiftAidTest::testNothingToSend
statusReason: 1) MatchBot\Tests\Application\Commands\ClaimGiftAidTest::testNothingToSend
Error: Call to protected method MatchBot\Domain\Donation::setTipAmount() from scope MatchBot\Tests\Application\Commands\ClaimGiftAidTest

/home/barney/projects/matchbot/tests/Application/DonationTestDataTrait.php:63
/home/barney/projects/matchbot/tests/Application/Commands/ClaimGiftAidTest.php:40

ERRORS!
Tests: 1, Assertio

[Killed] Identical
Domain/Donation.php:866:13
     {
         /** @psalm-var numeric-string $tipAmount */
         if (
-            $this->paymentMethodType === PaymentMethodType::CustomerBalance &&
+            if ($this->paymentMethodType !== PaymentMethodType::CustomerBalance && bccomp($tipAmount, '0', 2) !== 0) {
             bccomp($tipAmount, '0', 2) !== 0
         ) {
killedBy: MatchBot\Tests\Application\Commands\ClaimGiftAidTest::testNothingToSend
statusReason: 1) MatchBot\Tests\Application\Commands\ClaimGiftAidTest::testNothingToSend
UnexpectedValueException: A Customer Balance Donation may not include a tip

/home/barney/projects/matchbot/src/Domain/Donation.php:689
/home/barney/projects/matchbot/tests/Application/DonationTestDataTrait.php:63
/home/barney/projects/matchbot/tests/Application/Commands/ClaimGiftAidTest.php:40

ERRORS!

[Killed] LogicalAndAllSubExprNegation
Domain/Donation.php:866:13
     {
         /** @psalm-var numeric-string $tipAmount */
         if (
-            $this->paymentMethodType === PaymentMethodType::CustomerBalance &&
-            bccomp($tipAmount, '0', 2) !== 0
+            if (!($this->paymentMethodType === PaymentMethodType::CustomerBalance) && !(bccomp($tipAmount, '0', 2) !== 0)) {
         ) {
             // We would have accepted a tip at the time the customer balance was created, so we don't take a second
killedBy: MatchBot\Tests\Application\Actions\Donations\ConfirmTest::test_it_confirms_a_card_donation
statusReason: 1) MatchBot\Tests\Application\Actions\Donations\ConfirmTest::test_it_confirms_a_card_donation
UnexpectedValueException: A Customer Balance Donation may not include a tip

/home/barney/projects/matchbot/src/Domain/Donation.php:689
/home/barney/projects/matchbot/src/Domain/Donation.php:304
/home/barney/projects/matchbot/tests/Application/Actions/Donations/ConfirmTest.php:316
/home/barney/projects/ma

[Killed] NotIdentical
Domain/Donation.php:867:13
         /** @psalm-var numeric-string $tipAmount */
         if (
             $this->paymentMethodType === PaymentMethodType::CustomerBalance &&
-            bccomp($tipAmount, '0', 2) !== 0
+            if ($this->paymentMethodType === PaymentMethodType::CustomerBalance && bccomp($tipAmount, '0', 2) === 0) {
         ) {
             // We would have accepted a tip at the time the customer balance was created, so we don't take a second
killedBy: MatchBot\Tests\Domain\DonationTest::test200kCustomerBalanceDonationIsAllowed
statusReason: 1) MatchBot\Tests\Domain\DonationTest::test200kCustomerBalanceDonationIsAllowed
UnexpectedValueException: A Customer Balance Donation may not include a tip

/home/barney/projects/matchbot/src/Domain/Donation.php:689
/home/barney/projects/matchbot/src/Domain/Donation.php:304
/home/barney/projects/matchbot/tests/Domain/DonationTest.php:100

ERRORS!

[Killed] DecrementInteger
Domain/Donation.php:867:13
         /** @psalm-var numeric-string $tipAmount */
         if (
             $this->paymentMethodType === PaymentMethodType::CustomerBalance &&
-            bccomp($tipAmount, '0', 2) !== 0
+            if ($this->paymentMethodType === PaymentMethodType::CustomerBalance && bccomp($tipAmount, '0', 1) !== 0) {
         ) {
             // We would have accepted a tip at the time the customer balance was created, so we don't take a second
killedBy: MatchBot\Tests\Domain\DonationTest::testCustomerBalananceDonationsDoNotAcceptTips
statusReason: 1) MatchBot\Tests\Domain\DonationTest::testCustomerBalananceDonationsDoNotAcceptTips
Failed asserting that exception of type "UnexpectedValueException" is thrown.

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] Throw_
Domain/Donation.php:871:13
         ) {
             // We would have accepted a tip at the time the customer balance was created, so we don't take a second
             // tip as part of the donation.
-            throw new \UnexpectedValueException('A Customer Balance Donation may not include a tip');
+            new \UnexpectedValueException('A Customer Balance Donation may not include a tip');
         }
 
killedBy: MatchBot\Tests\Domain\DonationTest::testCustomerBalananceDonationsDoNotAcceptTips
statusReason: 1) MatchBot\Tests\Domain\DonationTest::testCustomerBalananceDonationsDoNotAcceptTips
Failed asserting that exception of type "UnexpectedValueException" is thrown.

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] IncrementInteger
Domain/Donation.php:876:9
 
         $max = self::MAXIMUM_CARD_DONATION;
 
-        if (bccomp($tipAmount, (string)(self::MAXIMUM_CARD_DONATION), 2) === 1) {
+        if (bccomp($tipAmount, (string) self::MAXIMUM_CARD_DONATION, 2) === 2) {
             throw new \UnexpectedValueException(sprintf(
                 'Tip amount must not exceed %d %s',
killedBy: MatchBot\Tests\Domain\DonationTest::testTipAmountTooHighNotPersisted
statusReason: 1) MatchBot\Tests\Domain\DonationTest::testTipAmountTooHighNotPersisted
Failed asserting that exception of type "UnexpectedValueException" is thrown.

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] DecrementInteger
Domain/Donation.php:876:9
 
         $max = self::MAXIMUM_CARD_DONATION;
 
-        if (bccomp($tipAmount, (string)(self::MAXIMUM_CARD_DONATION), 2) === 1) {
+        if (bccomp($tipAmount, (string) self::MAXIMUM_CARD_DONATION, 1) === 1) {
             throw new \UnexpectedValueException(sprintf(
                 'Tip amount must not exceed %d %s',
killedBy: MatchBot\Tests\Domain\DonationTest::testTipAmountTooHighNotPersisted
statusReason: 1) MatchBot\Tests\Domain\DonationTest::testTipAmountTooHighNotPersisted
Failed asserting that exception of type "UnexpectedValueException" is thrown.

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] Throw_
Domain/Donation.php:877:13
         $max = self::MAXIMUM_CARD_DONATION;
 
         if (bccomp($tipAmount, (string)(self::MAXIMUM_CARD_DONATION), 2) === 1) {
-            throw new \UnexpectedValueException(sprintf(
-                'Tip amount must not exceed %d %s',
-                $max,
-                $this->currencyCode,
-            ));
+            new \UnexpectedValueException(sprintf('Tip amount must not exceed %d %s', $max, $this->currencyCode));
         }
 
killedBy: MatchBot\Tests\Domain\DonationTest::testTipAmountTooHighNotPersisted
statusReason: 1) MatchBot\Tests\Domain\DonationTest::testTipAmountTooHighNotPersisted
Failed asserting that exception of type "UnexpectedValueException" is thrown.

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] Identical
Domain/Donation.php:884:9
             ));
         }
 
-        if (bccomp($tipAmount, '0', 2) === -1) {
+        if (bccomp($tipAmount, '0', 2) !== -1) {
             throw new \UnexpectedValueException('Tip amount must not be negative');
         }
killedBy: MatchBot\Tests\Application\Commands\ClaimGiftAidTest::testNothingToSend
statusReason: 1) MatchBot\Tests\Application\Commands\ClaimGiftAidTest::testNothingToSend
UnexpectedValueException: Tip amount must not be negative

/home/barney/projects/matchbot/src/Domain/Donation.php:696
/home/barney/projects/matchbot/tests/Application/DonationTestDataTrait.php:63
/home/barney/projects/matchbot/tests/Application/Commands/ClaimGiftAidTest.php:40

ERRORS!

[Killed] IncrementInteger
Domain/Donation.php:884:9
             ));
         }
 
-        if (bccomp($tipAmount, '0', 2) === -1) {
+        if (bccomp($tipAmount, '0', 3) === -1) {
             throw new \UnexpectedValueException('Tip amount must not be negative');
         }
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

...............................................................  63 / 137 ( 45%)
............................................................... 126 / 137 ( 91%)
...........                                                     137 / 137 (100%)

Time: 00:03.216, Memory: 46.00 MB

[Killed] Throw_
Domain/Donation.php:885:13
         }
 
         if (bccomp($tipAmount, '0', 2) === -1) {
-            throw new \UnexpectedValueException('Tip amount must not be negative');
+            new \UnexpectedValueException('Tip amount must not be negative');
         }
 
killedBy: MatchBot\Tests\Domain\DonationTest::testCannotCreateDonationWithNegativeTip
statusReason: 1) MatchBot\Tests\Domain\DonationTest::testCannotCreateDonationWithNegativeTip
Failed asserting that exception of type "UnexpectedValueException" is thrown.

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.
