[Killed] PublicVisibility
Domain/Donation.php:891:5
         $this->tipAmount = $tipAmount;
     }
 
-    public function hasTipGiftAid(): ?bool
+    protected function hasTipGiftAid() : ?bool
     {
         return $this->tipGiftAid;
killedBy: MatchBot\Tests\Application\Actions\Donations\UpdateHandlesLockExceptionTest::testRetriesOnUpdateStillPendingLockException
statusReason: 1) MatchBot\Tests\Application\Actions\Donations\UpdateHandlesLockExceptionTest::testRetriesOnUpdateStillPendingLockException
Error: Call to protected method MatchBot\Domain\Donation::hasTipGiftAid() from scope MatchBot\Application\Actions\Donations\Update

/home/barney/projects/matchbot/src/Application/Actions/Donations/Update.php:495
/home/barney/projects/matchbot/src/Application/Actions/Donation

[Killed] PublicVisibility
Domain/Donation.php:896:5
         return $this->tipGiftAid;
     }
 
-    public function setTipGiftAid(?bool $tipGiftAid): void
+    protected function setTipGiftAid(?bool $tipGiftAid) : void
     {
         $this->tipGiftAid = $tipGiftAid;
killedBy: MatchBot\Tests\Application\Actions\Donations\UpdateHandlesLockExceptionTest::testRetriesOnUpdateStillPendingLockException
statusReason: 1) MatchBot\Tests\Application\Actions\Donations\UpdateHandlesLockExceptionTest::testRetriesOnUpdateStillPendingLockException
Error: Call to protected method MatchBot\Domain\Donation::setTipGiftAid() from scope MatchBot\Application\Actions\Donations\Update

/home/barney/projects/matchbot/src/Application/Actions/Donations/Update.php:276
/home/barney/projects/matchbot/src/Application/Actions/Donation

[Killed] PublicVisibility
Domain/Donation.php:901:5
         $this->tipGiftAid = $tipGiftAid;
     }
 
-    public function getDonorHomeAddressLine1(): ?string
+    protected function getDonorHomeAddressLine1() : ?string
     {
         return $this->donorHomeAddressLine1;
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

................................................................. 65 / 86 ( 75%)
.....................                                             86 / 86 (100%)

Time: 00:03.357, Memory: 34.00 MB

OK (86 tests, 634 assertions)

[Killed] PublicVisibility
Domain/Donation.php:906:5
         return $this->donorHomeAddressLine1;
     }
 
-    public function setDonorHomeAddressLine1(?string $donorHomeAddressLine1): void
+    protected function setDonorHomeAddressLine1(?string $donorHomeAddressLine1) : void
     {
         $this->donorHomeAddressLine1 = $donorHomeAddressLine1;
killedBy: MatchBot\Tests\Application\Commands\ClaimGiftAidTest::testNothingToSend
statusReason: 1) MatchBot\Tests\Application\Commands\ClaimGiftAidTest::testNothingToSend
Error: Call to protected method MatchBot\Domain\Donation::setDonorHomeAddressLine1() from scope MatchBot\Tests\Application\Commands\ClaimGiftAidTest

/home/barney/projects/matchbot/tests/Application/DonationTestDataTrait.php:56
/home/barney/projects/matchbot/tests/Application/Commands/ClaimGiftAidTest.php:40

ERRORS!
Tests:

[Killed] PublicVisibility
Domain/Donation.php:911:5
         $this->donorHomeAddressLine1 = $donorHomeAddressLine1;
     }
 
-    public function getDonorHomePostcode(): ?string
+    protected function getDonorHomePostcode() : ?string
     {
         return $this->donorHomePostcode;
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

................................................................. 65 / 86 ( 75%)
.....................                                             86 / 86 (100%)

Time: 00:03.363, Memory: 34.00 MB

OK (86 tests, 634 assertions)

[Killed] PublicVisibility
Domain/Donation.php:916:5
         return $this->donorHomePostcode;
     }
 
-    public function setDonorHomePostcode(?string $donorHomePostcode): void
+    protected function setDonorHomePostcode(?string $donorHomePostcode) : void
     {
         $this->donorHomePostcode = $donorHomePostcode;
killedBy: MatchBot\Tests\Application\Commands\ClaimGiftAidTest::testNothingToSend
statusReason: 1) MatchBot\Tests\Application\Commands\ClaimGiftAidTest::testNothingToSend
Error: Call to protected method MatchBot\Domain\Donation::setDonorHomePostcode() from scope MatchBot\Tests\Application\Commands\ClaimGiftAidTest

/home/barney/projects/matchbot/tests/Application/DonationTestDataTrait.php:57
/home/barney/projects/matchbot/tests/Application/Commands/ClaimGiftAidTest.php:40

ERRORS!
Tests: 1,

[Killed] PublicVisibility
Domain/Donation.php:924:5
     /**
      * @return string
      */
-    public function getCharityFeeVat(): string
+    protected function getCharityFeeVat() : string
     {
         return $this->charityFeeVat;
killedBy: MatchBot\Tests\Application\Actions\Donations\ConfirmTest::test_it_confirms_a_card_donation
statusReason: 1) MatchBot\Tests\Application\Actions\Donations\ConfirmTest::test_it_confirms_a_card_donation
Error: Call to protected method MatchBot\Domain\Donation::getCharityFeeVat() from scope MatchBot\Application\Actions\Donations\Confirm

/home/barney/projects/matchbot/src/Application/Actions/Donations/Confirm.php:114
/home/barney/projects/matchbot/src/Application/Actions/Action.php:34
/home/barney/project

[Killed] PublicVisibility
Domain/Donation.php:932:5
     /**
      * @param string $charityFeeVat
      */
-    public function setCharityFeeVat(string $charityFeeVat): void
+    protected function setCharityFeeVat(string $charityFeeVat) : void
     {
         $this->charityFeeVat = $charityFeeVat;
killedBy: MatchBot\Tests\Domain\DonationRepositoryTest::testBuildFromApiRequestSuccess
statusReason: 1) MatchBot\Tests\Domain\DonationRepositoryTest::testBuildFromApiRequestSuccess
Error: Call to protected method MatchBot\Domain\Donation::setCharityFeeVat() from scope MatchBot\Domain\DonationRepository

/home/barney/projects/matchbot/src/Domain/DonationRepository.php:557
/home/barney/projects/matchbot/src/Domain/DonationRepository.php:166
/home/barney/projects/matchbot/tests/Domain/DonationReposi

[Killed] NotIdentical
Domain/Donation.php:943:9
      */
     public function hasPostCreateUpdates(): bool
     {
-        return $this->getDonationStatus() !== DonationStatus::Pending;
+        return $this->getDonationStatus() === DonationStatus::Pending;
     }
 
killedBy: MatchBot\Tests\Domain\DonationTest::testPendingDonationDoesNotHavePostCreateUpdates
statusReason: 1) MatchBot\Tests\Domain\DonationTest::testPendingDonationDoesNotHavePostCreateUpdates
Failed asserting that true is false.

/home/barney/projects/matchbot/tests/Domain/DonationTest.php:40

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] PublicVisibility
Domain/Donation.php:955:5
      *                  It does not include separately sourced funds like matching or
      *                  Gift Aid.
      */
-    public function getAmountToDeductFractional(): int
+    protected function getAmountToDeductFractional() : int
     {
         $amountToDeduct = bcadd($this->getTipAmount(), $this->getCharityFeeGross(), 2);
killedBy: MatchBot\Tests\Application\Actions\Donations\ConfirmTest::test_it_confirms_a_card_donation
statusReason: 1) MatchBot\Tests\Application\Actions\Donations\ConfirmTest::test_it_confirms_a_card_donation
Error: Call to protected method MatchBot\Domain\Donation::getAmountToDeductFractional() from scope MatchBot\Application\Actions\Donations\Confirm

/home/barney/projects/matchbot/src/Application/Actions/Donations/Confirm.php:119
/home/barney/projects/matchbot/src/Application/Actions/Action.php:34
/home/bar

[Killed] DecrementInteger
Domain/Donation.php:957:9
      */
     public function getAmountToDeductFractional(): int
     {
-        $amountToDeduct = bcadd($this->getTipAmount(), $this->getCharityFeeGross(), 2);
+        $amountToDeduct = bcadd($this->getTipAmount(), $this->getCharityFeeGross(), 1);
 
         return (int) bcmul('100', $amountToDeduct, 2);
killedBy: MatchBot\Tests\Domain\DonationRepositoryTest::testStripeAmountForCharityWithFeeCover
statusReason: 1) MatchBot\Tests\Domain\DonationRepositoryTest::testStripeAmountForCharityWithFeeCover
Failed asserting that 4440 matches expected 4444.

/home/barney/projects/matchbot/tests/Domain/DonationRepositoryTest.php:265

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] IncrementInteger
Domain/Donation.php:957:9
      */
     public function getAmountToDeductFractional(): int
     {
-        $amountToDeduct = bcadd($this->getTipAmount(), $this->getCharityFeeGross(), 2);
+        $amountToDeduct = bcadd($this->getTipAmount(), $this->getCharityFeeGross(), 3);
 
         return (int) bcmul('100', $amountToDeduct, 2);
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

................................................................. 65 / 72 ( 90%)
.......                                                           72 / 72 (100%)

Time: 00:03.387, Memory: 38.00 MB

OK (72 tests, 626 assertions)

[Killed] DecrementInteger
Domain/Donation.php:959:9
     {
         $amountToDeduct = bcadd($this->getTipAmount(), $this->getCharityFeeGross(), 2);
 
-        return (int) bcmul('100', $amountToDeduct, 2);
+        return (int) bcmul('100', $amountToDeduct, 1);
     }
 
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

................................................................. 65 / 72 ( 90%)
.......                                                           72 / 72 (100%)

Time: 00:03.383, Memory: 38.00 MB

OK (72 tests, 626 assertions)

[Killed] IncrementInteger
Domain/Donation.php:959:9
     {
         $amountToDeduct = bcadd($this->getTipAmount(), $this->getCharityFeeGross(), 2);
 
-        return (int) bcmul('100', $amountToDeduct, 2);
+        return (int) bcmul('100', $amountToDeduct, 3);
     }
 
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

................................................................. 65 / 72 ( 90%)
.......                                                           72 / 72 (100%)

Time: 00:03.374, Memory: 38.00 MB

OK (72 tests, 626 assertions)

[Killed] PublicVisibility
Domain/Donation.php:976:5
      *                  `getAmount()` relates to core amount, we must re-add the tip here to get a
      *                  correct answer.
      */
-    public function getAmountForCharityFractional(): int
+    protected function getAmountForCharityFractional() : int
     {
         $amountFractional = (int) bcmul('100', $this->getAmount(), 2);
killedBy: MatchBot\Tests\Domain\DonationRepositoryTest::testStripeAmountForCharityWithTipUsingAmex
statusReason: 1) MatchBot\Tests\Domain\DonationRepositoryTest::testStripeAmountForCharityWithTipUsingAmex
Error: Call to protected method MatchBot\Domain\Donation::getAmountForCharityFractional() from scope MatchBot\Tests\Domain\DonationRepositoryTest

/home/barney/projects/matchbot/tests/Domain/DonationRepositoryTest.php:223

ERRORS!
Tests: 1, Assertions: 1, Errors: 1.

[Killed] CastInt
Domain/Donation.php:978:9
      */
     public function getAmountForCharityFractional(): int
     {
-        $amountFractional = (int) bcmul('100', $this->getAmount(), 2);
+        $amountFractional = bcmul('100', $this->getAmount(), 2);
         return $amountFractional +
             $this->getFeeCoverAmountFractional() +
killedBy: MatchBot\Tests\Domain\DonationRepositoryTest::testStripeAmountForCharityWithTipUsingAmex
statusReason: 1) MatchBot\Tests\Domain\DonationRepositoryTest::testStripeAmountForCharityWithTipUsingAmex
TypeError: MatchBot\Domain\Donation::getAmountForCharityFractional(): Return value must be of type int, float returned

/home/barney/projects/matchbot/src/Domain/Donation.php:777
/home/barney/projects/matchbot/tests/Domain/DonationRepositoryTest.php:223

ERRORS!
Tests: 1, Assertions: 1, Errors: 1.

[Killed] BCMath
Domain/Donation.php:978:9
      */
     public function getAmountForCharityFractional(): int
     {
-        $amountFractional = (int) bcmul('100', $this->getAmount(), 2);
+        $amountFractional = (int) (string) ('100' * $this->getAmount());
         return $amountFractional +
             $this->getFeeCoverAmountFractional() +
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

......................                                            22 / 22 (100%)

Time: 00:00.057, Memory: 20.00 MB

OK (22 tests, 85 assertions)

[Killed] Plus
Domain/Donation.php:979:9
     public function getAmountForCharityFractional(): int
     {
         $amountFractional = (int) bcmul('100', $this->getAmount(), 2);
-        return $amountFractional +
-            $this->getFeeCoverAmountFractional() +
+        return $amountFractional - $this->getFeeCoverAmountFractional() + $this->getTipAmountFractional() - $this->getAmountToDeductFractional();ntFractional() +
             $this->getTipAmountFractional() -
             $this->getAmountToDeductFractional();
killedBy: MatchBot\Tests\Domain\DonationRepositoryTest::testStripeAmountForCharityWithFeeCover
statusReason: 1) MatchBot\Tests\Domain\DonationRepositoryTest::testStripeAmountForCharityWithFeeCover
Failed asserting that 89877 matches expected 98765.

/home/barney/projects/matchbot/tests/Domain/DonationRepositoryTest.php:266

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.

[Killed] Plus
Domain/Donation.php:979:9
     public function getAmountForCharityFractional(): int
     {
         $amountFractional = (int) bcmul('100', $this->getAmount(), 2);
-        return $amountFractional +
-            $this->getFeeCoverAmountFractional() +
-            $this->getTipAmountFractional() -
+        return $amountFractional + $this->getFeeCoverAmountFractional() - $this->getTipAmountFractional() - $this->getAmountToDeductFractional();ctional() -
             $this->getAmountToDeductFractional();
     }
killedBy: MatchBot\Tests\Domain\DonationRepositoryTest::testStripeAmountForCharityWithTipUsingAmex
statusReason: 1) MatchBot\Tests\Domain\DonationRepositoryTest::testStripeAmountForCharityWithTipUsingAmex
Failed asserting that 93585 matches expected 95585.

/home/barney/projects/matchbot/tests/Domain/DonationRepositoryTest.php:223

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.

[Killed] PublicVisibility
Domain/Donation.php:988:5
     /**
      * @return int  Full amount, including any tip or fee cover, in pence/cents/...
      */
-    public function getAmountFractionalIncTip(): int
+    protected function getAmountFractionalIncTip() : int
     {
         $coreAmountFractional = (int) bcmul('100', $this->getAmount(), 2);
killedBy: MatchBot\Tests\Domain\DonationTest::testValidDataPersisted
statusReason: 1) MatchBot\Tests\Domain\DonationTest::testValidDataPersisted
Error: Call to protected method MatchBot\Domain\Donation::getAmountFractionalIncTip() from scope MatchBot\Tests\Domain\DonationTest

/home/barney/projects/matchbot/tests/Domain/DonationTest.php:59

ERRORS!
Tests: 1, Assertions: 3, Errors: 1.

[Killed] IncrementInteger
Domain/Donation.php:990:9
      */
     public function getAmountFractionalIncTip(): int
     {
-        $coreAmountFractional = (int) bcmul('100', $this->getAmount(), 2);
+        $coreAmountFractional = (int) bcmul('100', $this->getAmount(), 3);
 
         return
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

...............................................................  63 / 113 ( 55%)
..................................................              113 / 113 (100%)

Time: 00:03.409, Memory: 42.00 MB

OK (113 tests, 775 assertions)

[Killed] CastInt
Domain/Donation.php:990:9
      */
     public function getAmountFractionalIncTip(): int
     {
-        $coreAmountFractional = (int) bcmul('100', $this->getAmount(), 2);
+        $coreAmountFractional = bcmul('100', $this->getAmount(), 2);
 
         return
killedBy: MatchBot\Tests\Domain\DonationTest::testValidDataPersisted
statusReason: 1) MatchBot\Tests\Domain\DonationTest::testValidDataPersisted
TypeError: MatchBot\Domain\Donation::getAmountFractionalIncTip(): Return value must be of type int, float returned

/home/barney/projects/matchbot/src/Domain/Donation.php:785
/home/barney/projects/matchbot/tests/Domain/DonationTest.php:59

ERRORS!
Tests: 1, Assertions: 3, Errors: 1.

[Killed] Plus
Domain/Donation.php:993:13
         $coreAmountFractional = (int) bcmul('100', $this->getAmount(), 2);
 
         return
-            $coreAmountFractional +
-            $this->getFeeCoverAmountFractional() +
-            $this->getTipAmountFractional();
+            return $coreAmountFractional + $this->getFeeCoverAmountFractional() - $this->getTipAmountFractional();tional();
     }
 
killedBy: MatchBot\Tests\Domain\DonationTest::testValidDataPersisted
statusReason: 1) MatchBot\Tests\Domain\DonationTest::testValidDataPersisted
Failed asserting that 9887 matches expected 10113.

/home/barney/projects/matchbot/tests/Domain/DonationTest.php:59

FAILURES!
Tests: 1, Assertions: 4, Failures: 1.

[Killed] Plus
Domain/Donation.php:993:13
         $coreAmountFractional = (int) bcmul('100', $this->getAmount(), 2);
 
         return
-            $coreAmountFractional +
-            $this->getFeeCoverAmountFractional() +
+            return $coreAmountFractional - $this->getFeeCoverAmountFractional() + $this->getTipAmountFractional();tFractional() +
             $this->getTipAmountFractional();
     }
killedBy: MatchBot\Tests\Domain\DonationRepositoryTest::testStripeAmountForCharityWithFeeCover
statusReason: 1) MatchBot\Tests\Domain\DonationRepositoryTest::testStripeAmountForCharityWithFeeCover
Failed asserting that 94321 matches expected 103209.

/home/barney/projects/matchbot/tests/Domain/DonationRepositoryTest.php:268

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.

[Killed] PublicVisibility
Domain/Donation.php:1001:5
     /**
      * @return int  In e.g. pence/cents/...
      */
-    #[Pure] public function getFeeCoverAmountFractional(): int
+    protected function getFeeCoverAmountFractional() : int
     {
         return (int) bcmul('100', $this->getFeeCoverAmount(), 2);
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

...............................................................  63 / 113 ( 55%)
..................................................              113 / 113 (100%)

Time: 00:03.397, Memory: 42.00 MB

OK (113 tests, 775 assertions)

[Killed] BCMath
Domain/Donation.php:1003:9
      */
     #[Pure] public function getFeeCoverAmountFractional(): int
     {
-        return (int) bcmul('100', $this->getFeeCoverAmount(), 2);
+        return (int) (string) ('100' * $this->getFeeCoverAmount());
     }
 
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

...............................................................  63 / 113 ( 55%)
..................................................              113 / 113 (100%)

Time: 00:03.406, Memory: 42.00 MB

OK (113 tests, 775 assertions)

[Killed] DecrementInteger
Domain/Donation.php:1003:9
      */
     #[Pure] public function getFeeCoverAmountFractional(): int
     {
-        return (int) bcmul('100', $this->getFeeCoverAmount(), 2);
+        return (int) bcmul('100', $this->getFeeCoverAmount(), 1);
     }
 
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

...............................................................  63 / 113 ( 55%)
..................................................              113 / 113 (100%)

Time: 00:03.419, Memory: 42.00 MB

OK (113 tests, 775 assertions)

[Killed] PublicVisibility
Domain/Donation.php:1009:5
     /**
      * @return int  In e.g. pence/cents/...
      */
-    public function getTipAmountFractional(): int
+    protected function getTipAmountFractional() : int
     {
         return (int) bcmul('100', $this->getTipAmount(), 2);
killedBy: MatchBot\Tests\Domain\DonationTest::testValidDataPersisted
statusReason: 1) MatchBot\Tests\Domain\DonationTest::testValidDataPersisted
Error: Call to protected method MatchBot\Domain\Donation::getTipAmountFractional() from scope MatchBot\Tests\Domain\DonationTest

/home/barney/projects/matchbot/tests/Domain/DonationTest.php:58

ERRORS!
Tests: 1, Assertions: 2, Errors: 1.

[Killed] BCMath
Domain/Donation.php:1011:9
      */
     public function getTipAmountFractional(): int
     {
-        return (int) bcmul('100', $this->getTipAmount(), 2);
+        return (int) (string) ('100' * $this->getTipAmount());
     }
 
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

...............................................................  63 / 113 ( 55%)
..................................................              113 / 113 (100%)

Time: 00:03.414, Memory: 42.00 MB

OK (113 tests, 775 assertions)

[Killed] DecrementInteger
Domain/Donation.php:1011:9
      */
     public function getTipAmountFractional(): int
     {
-        return (int) bcmul('100', $this->getTipAmount(), 2);
+        return (int) bcmul('100', $this->getTipAmount(), 1);
     }
 
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

...............................................................  63 / 113 ( 55%)
..................................................              113 / 113 (100%)

Time: 00:03.392, Memory: 42.00 MB

OK (113 tests, 775 assertions)

[Killed] PublicVisibility
Domain/Donation.php:1017:5
     /**
      * @return string
      */
-    public function getOriginalPspFee(): string
+    protected function getOriginalPspFee() : string
     {
         return $this->originalPspFee;
killedBy: MatchBot\Tests\Domain\DonationTest::testSetAndGetOriginalFee
statusReason: 1) MatchBot\Tests\Domain\DonationTest::testSetAndGetOriginalFee
Error: Call to protected method MatchBot\Domain\Donation::getOriginalPspFee() from scope MatchBot\Tests\Domain\DonationTest

/home/barney/projects/matchbot/tests/Domain/DonationTest.php:167

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] PublicVisibility
Domain/Donation.php:1022:5
         return $this->originalPspFee;
     }
 
-    public function setOriginalPspFeeFractional(int $originalPspFeeFractional): void
+    protected function setOriginalPspFeeFractional(int $originalPspFeeFractional) : void
     {
         $this->originalPspFee = bcdiv((string) $originalPspFeeFractional, '100', 2);
killedBy: MatchBot\Tests\Domain\DonationTest::testSetAndGetOriginalFee
statusReason: 1) MatchBot\Tests\Domain\DonationTest::testSetAndGetOriginalFee
Error: Call to protected method MatchBot\Domain\Donation::setOriginalPspFeeFractional() from scope MatchBot\Tests\Domain\DonationTest

/home/barney/projects/matchbot/tests/Domain/DonationTest.php:165

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] IncrementInteger
Domain/Donation.php:1024:9
 
     public function setOriginalPspFeeFractional(int $originalPspFeeFractional): void
     {
-        $this->originalPspFee = bcdiv((string) $originalPspFeeFractional, '100', 2);
+        $this->originalPspFee = bcdiv((string) $originalPspFeeFractional, '100', 3);
     }
 
killedBy: MatchBot\Tests\Domain\DonationTest::testSetAndGetOriginalFee
statusReason: 1) MatchBot\Tests\Domain\DonationTest::testSetAndGetOriginalFee
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
-'1.23'
+'1.230'

[Killed] BCMath
Domain/Donation.php:1024:9
 
     public function setOriginalPspFeeFractional(int $originalPspFeeFractional): void
     {
-        $this->originalPspFee = bcdiv((string) $originalPspFeeFractional, '100', 2);
+        $this->originalPspFee = (string) ((string) $originalPspFeeFractional / '100');
     }
 
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

.............................................                     45 / 45 (100%)

Time: 00:00.065, Memory: 24.00 MB

OK (45 tests, 165 assertions)

[Killed] PublicVisibility
Domain/Donation.php:1035:5
     /**
      * @return bool
      */
-    public function hasTbgShouldProcessGiftAid(): ?bool
+    protected function hasTbgShouldProcessGiftAid() : ?bool
     {
         return $this->tbgShouldProcessGiftAid;
killedBy: MatchBot\Tests\Domain\DonationRepositoryTest::testStripeAmountForCharityWithTipUsingAmex
statusReason: 1) MatchBot\Tests\Domain\DonationRepositoryTest::testStripeAmountForCharityWithTipUsingAmex
Error: Call to protected method MatchBot\Domain\Donation::hasTbgShouldProcessGiftAid() from scope MatchBot\Domain\DonationRepository

/home/barney/projects/matchbot/src/Domain/DonationRepository.php:544
/home/barney/projects/matchbot/tests/Domain/DonationRepositoryTest.php:214

ERRORS!
Tests: 1, Assertions:

[Killed] PublicVisibility
Domain/Donation.php:1043:5
     /**
      * @param bool $tbgShouldProcessGiftAid
      */
-    public function setTbgShouldProcessGiftAid(?bool $tbgShouldProcessGiftAid): void
+    protected function setTbgShouldProcessGiftAid(?bool $tbgShouldProcessGiftAid) : void
     {
         $this->tbgShouldProcessGiftAid = $tbgShouldProcessGiftAid;
killedBy: MatchBot\Tests\Application\Commands\ClaimGiftAidTest::testNothingToSend
statusReason: 1) MatchBot\Tests\Application\Commands\ClaimGiftAidTest::testNothingToSend
Error: Call to protected method MatchBot\Domain\Donation::setTbgShouldProcessGiftAid() from scope MatchBot\Tests\Application\Commands\ClaimGiftAidTest

/home/barney/projects/matchbot/tests/Application/Commands/ClaimGiftAidTest.php:41

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[NoCoverage] PublicVisibility
Domain/Donation.php:1051:5
     /**
      * @return DateTime|null
      */
-    public function getTbgGiftAidRequestQueuedAt(): ?DateTime
+    protected function getTbgGiftAidRequestQueuedAt() : ?DateTime
     {
         return $this->tbgGiftAidRequestQueuedAt;

[Killed] PublicVisibility
Domain/Donation.php:1059:5
     /**
      * @param DateTime|null $tbgGiftAidRequestQueuedAt
      */
-    public function setTbgGiftAidRequestQueuedAt(?DateTime $tbgGiftAidRequestQueuedAt): void
+    protected function setTbgGiftAidRequestQueuedAt(?DateTime $tbgGiftAidRequestQueuedAt) : void
     {
         $this->tbgGiftAidRequestQueuedAt = $tbgGiftAidRequestQueuedAt;
killedBy: MatchBot\Tests\Application\Commands\ClaimGiftAidTest::testSend
statusReason: 1) MatchBot\Tests\Application\Commands\ClaimGiftAidTest::testSend
Error: Call to protected method MatchBot\Domain\Donation::setTbgGiftAidRequestQueuedAt() from scope MatchBot\Application\Commands\ClaimGiftAid

/home/barney/projects/matchbot/src/Application/Commands/ClaimGiftAid.php:57
/home/barney/projects/matchbot/src/Application/Commands/LockingCommand.php:37
/home/barney/projects/matchbot/vendo

[Killed] PublicVisibility
Domain/Donation.php:1067:5
     /**
      * @return DateTime|null
      */
-    public function getTbgGiftAidRequestFailedAt(): ?DateTime
+    protected function getTbgGiftAidRequestFailedAt() : ?DateTime
     {
         return $this->tbgGiftAidRequestFailedAt;
killedBy: MatchBot\Tests\Application\Messenger\Handler\GiftAidResultHandlerTest::testNoOpProcessing
statusReason: 1) MatchBot\Tests\Application\Messenger\Handler\GiftAidResultHandlerTest::testNoOpProcessing
Error: Call to protected method MatchBot\Domain\Donation::getTbgGiftAidRequestFailedAt() from scope MatchBot\Tests\Application\Messenger\Handler\GiftAidResultHandlerTest

/home/barney/projects/matchbot/tests/Application/Messenger/Handler/GiftAidResultHandlerTest.php:36

ERRORS!
Tests: 1, Assertions: 0, Err

[Killed] PublicVisibility
Domain/Donation.php:1075:5
     /**
      * @param DateTime|null $tbgGiftAidRequestFailedAt
      */
-    public function setTbgGiftAidRequestFailedAt(?DateTime $tbgGiftAidRequestFailedAt): void
+    protected function setTbgGiftAidRequestFailedAt(?DateTime $tbgGiftAidRequestFailedAt) : void
     {
         $this->tbgGiftAidRequestFailedAt = $tbgGiftAidRequestFailedAt;
killedBy: MatchBot\Tests\Application\Messenger\Handler\GiftAidResultHandlerTest::testErrorProcessing
statusReason: 1) MatchBot\Tests\Application\Messenger\Handler\GiftAidResultHandlerTest::testErrorProcessing
Error: Call to protected method MatchBot\Domain\Donation::setTbgGiftAidRequestFailedAt() from scope MatchBot\Application\Messenger\Handler\GiftAidResultHandler

/home/barney/projects/matchbot/src/Application/Messenger/Handler/GiftAidResultHandler.php:31
/home/barney/projects/matchbot/tests/Application/Mes

[Killed] PublicVisibility
Domain/Donation.php:1080:5
         $this->tbgGiftAidRequestFailedAt = $tbgGiftAidRequestFailedAt;
     }
 
-    public function getTbgGiftAidRequestConfirmedCompleteAt(): ?DateTime
+    protected function getTbgGiftAidRequestConfirmedCompleteAt() : ?DateTime
     {
         return $this->tbgGiftAidRequestConfirmedCompleteAt;
killedBy: MatchBot\Tests\Application\Messenger\Handler\GiftAidResultHandlerTest::testNoOpProcessing
statusReason: 1) MatchBot\Tests\Application\Messenger\Handler\GiftAidResultHandlerTest::testNoOpProcessing
Error: Call to protected method MatchBot\Domain\Donation::getTbgGiftAidRequestConfirmedCompleteAt() from scope MatchBot\Tests\Application\Messenger\Handler\GiftAidResultHandlerTest

/home/barney/projects/matchbot/tests/Application/Messenger/Handler/GiftAidResultHandlerTest.php:59

ERRORS!
Tests: 1, Asserti
