[Killed] LogicalOrAllSubExprNegation
Domain/Donation.php:1273:9
      */
     private function makeSalesforceSafe(?string $text, bool $required): ?string
     {
-        if ($text === null || trim($text) === '') {
+        if (!($text === null) || !(trim($text) === '')) {
             if ($required) {
                 return 'N/A';
killedBy: MatchBot\Tests\Domain\DonationTest::testCreateDonationModelWithDonorFields
statusReason: 1) MatchBot\Tests\Domain\DonationTest::testCreateDonationModelWithDonorFields
Failed asserting that null is identical to 'Test First Name'.

/home/barney/projects/matchbot/tests/Domain/DonationTest.php:367

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] IfNegation
Domain/Donation.php:1274:13
     private function makeSalesforceSafe(?string $text, bool $required): ?string
     {
         if ($text === null || trim($text) === '') {
-            if ($required) {
-                return 'N/A';
-            }
+            if (!$required) {
 
             return null;
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

..............................................                    46 / 46 (100%)

Time: 00:03.348, Memory: 32.00 MB

OK (46 tests, 525 assertions)

[Killed] IncrementInteger
Domain/Donation.php:1281:9
             return null;
         }
 
-        return mb_substr($text, 0, 40);
+        return mb_substr($text, 1, 40);
     }
 
killedBy: MatchBot\Tests\Domain\DonationTest::testCreateDonationModelWithDonorFields
statusReason: 1) MatchBot\Tests\Domain\DonationTest::testCreateDonationModelWithDonorFields
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'Test First Name'
+'est First Name'

[Killed] DecrementInteger
Domain/Donation.php:1281:9
             return null;
         }
 
-        return mb_substr($text, 0, 40);
+        return mb_substr($text, -1, 40);
     }
 
killedBy: MatchBot\Tests\Domain\DonationTest::testCreateDonationModelWithDonorFields
statusReason: 1) MatchBot\Tests\Domain\DonationTest::testCreateDonationModelWithDonorFields
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'Test First Name'
+'e'

[Killed] PublicVisibility
Domain/Donation.php:1284:5
         return mb_substr($text, 0, 40);
     }
 
-    public function recordRefundAt(\DateTimeImmutable $refundDate): void
+    protected function recordRefundAt(\DateTimeImmutable $refundDate) : void
     {
         if ($this->donationStatus === DonationStatus::Refunded) {
killedBy: MatchBot\Tests\Domain\DonationTest::testToHookModelWhenRefunded
statusReason: 1) MatchBot\Tests\Domain\DonationTest::testToHookModelWhenRefunded
Error: Call to protected method MatchBot\Domain\Donation::recordRefundAt() from scope MatchBot\Tests\Domain\DonationTest

/home/barney/projects/matchbot/tests/Domain/DonationTest.php:209

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] Identical
Domain/Donation.php:1286:9
 
     public function recordRefundAt(\DateTimeImmutable $refundDate): void
     {
-        if ($this->donationStatus === DonationStatus::Refunded) {
+        if ($this->donationStatus !== DonationStatus::Refunded) {
             return;
         }
killedBy: MatchBot\Tests\Domain\DonationTest::testToHookModelWhenRefunded
statusReason: 1) MatchBot\Tests\Domain\DonationTest::testToHookModelWhenRefunded
Failed asserting that null is of type "string".

/home/barney/projects/matchbot/tests/Domain/DonationTest.php:214

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.

[Killed] PublicVisibility
Domain/Donation.php:1297:5
      * When a donation has been partially refunded (e.g. a tip-only refund) we record the refund date but we
      * don't change the status.
      */
-    public function setPartialRefundDate(\DateTimeImmutable $datetime): void
+    protected function setPartialRefundDate(\DateTimeImmutable $datetime) : void
     {
         $this->refundedAt = $datetime;
killedBy: MatchBot\Tests\Application\Actions\Hooks\StripePaymentsUpdateTest::testSuccessfulTipRefund
statusReason: 1) MatchBot\Tests\Application\Actions\Hooks\StripePaymentsUpdateTest::testSuccessfulTipRefund
Error: Call to protected method MatchBot\Domain\Donation::setPartialRefundDate() from scope MatchBot\Application\Actions\Hooks\StripePaymentsUpdate

/home/barney/projects/matchbot/src/Application/Actions/Hooks/StripePaymentsUpdate.php:292
/home/barney/projects/matchbot/src/Application/Actions/Hooks/Stripe

[Killed] PublicVisibility
Domain/Donation.php:1302:5
         $this->refundedAt = $datetime;
     }
 
-    public function cancel(): void
+    protected function cancel() : void
     {
         if (
killedBy: MatchBot\Tests\Domain\DonationTest::testCanCancelPendingDonation
statusReason: 1) MatchBot\Tests\Domain\DonationTest::testCanCancelPendingDonation
Error: Call to protected method MatchBot\Domain\Donation::cancel() from scope MatchBot\Tests\Domain\DonationTest

/home/barney/projects/matchbot/tests/Domain/DonationTest.php:375

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] LogicalNot
Domain/Donation.php:1305:13
     public function cancel(): void
     {
         if (
-            !in_array(
-                $this->donationStatus,
-                [
-                    DonationStatus::Pending,
-                    DonationStatus::Cancelled,
-                    DonationStatus::Collected, // doesn't really make sense to cancel a collected donation but we have
-                                               // existing unit tests doing that, not changing now.
-                ],
-                true
-            )
+            if (in_array($this->donationStatus, [DonationStatus::Pending, DonationStatus::Cancelled, DonationStatus::Collected], true)) {
         ) {
             throw new \UnexpectedValueException("Cannot cancel {$this->donationStatus->value} donation");
killedBy: MatchBot\Tests\Domain\DonationTest::testCanCancelPendingDonation
statusReason: 1) MatchBot\Tests\Domain\DonationTest::testCanCancelPendingDonation
UnexpectedValueException: Cannot cancel Pending donation

/home/barney/projects/matchbot/src/Domain/Donation.php:1038
/home/barney/projects/matchbot/tests/Domain/DonationTest.php:375

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] Throw_
Domain/Donation.php:1316:13
                 true
             )
         ) {
-            throw new \UnexpectedValueException("Cannot cancel {$this->donationStatus->value} donation");
+            new \UnexpectedValueException("Cannot cancel {$this->donationStatus->value} donation");
         }
 
killedBy: MatchBot\Tests\Domain\DonationTest::testCantCancelPaidDonation
statusReason: 1) MatchBot\Tests\Domain\DonationTest::testCantCancelPaidDonation
Failed asserting that exception with message "Cannot cancel Paid donation" is thrown

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.
