[Killed] PublicVisibility
Domain/DonationFundsNotifier.php:13:5
     {
     }
 
-    public function notifyRecieptOfAccountFunds(DonorAccount $donorAccount, Money $transferAmount, Money $newBalance): void
+    protected function notifyRecieptOfAccountFunds(DonorAccount $donorAccount, Money $transferAmount, Money $newBalance) : void
     {
         $this->mailer->sendEmail([
killedBy: MatchBot\Tests\Domain\DonationFundsNotifierTest::testItSendsAnEmailAboutNewDonationFunds
statusReason: 1) MatchBot\Tests\Domain\DonationFundsNotifierTest::testItSendsAnEmailAboutNewDonationFunds
Error: Call to protected method MatchBot\Domain\DonationFundsNotifier::notifyRecieptOfAccountFunds() from scope MatchBot\Tests\Domain\DonationFundsNotifierTest

/home/barney/projects/matchbot/tests/Domain/DonationFundsNotifierTest.php:48

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] MethodCallRemoval
Domain/DonationFundsNotifier.php:15:9
 
     public function notifyRecieptOfAccountFunds(DonorAccount $donorAccount, Money $transferAmount, Money $newBalance): void
     {
-        $this->mailer->sendEmail([
-            'templateKey' => 'donor-funds-thanks',
-            'recipientEmailAddress' => $donorAccount->emailAddress->email,
-            'params' => [
-                'donorFirstName' => $donorAccount->donorName->first,
-                'transferAmount' => $transferAmount->format(),
-                'newBalance' => $newBalance->format(),
-            ],
-        ]);
+        
     }
 }
killedBy: MatchBot\Tests\Domain\DonationFundsNotifierTest::testItSendsAnEmailAboutNewDonationFunds
statusReason: 1) MatchBot\Tests\Domain\DonationFundsNotifierTest::testItSendsAnEmailAboutNewDonationFunds
Some predictions failed:
Double\MatchBot\Client\Mailer\P1:
  Expected exactly 1 calls that match:
      Double\MatchBot\Client\Mailer\P1->sendEmail(exact(["templateKey" => "donor-funds-thanks", "recipientEmailAddress" => "foo@example.com", "params" => ["donorFirstName" => "Fred", "transferAmount" => "£52.35
