[Killed] PublicVisibility
Domain/DonationRepository.php:44:5
     private array $queuedForPersist;
     private array $settings;
 
-    public function setMatchingAdapter(Matching\Adapter $adapter): void
+    protected function setMatchingAdapter(Matching\Adapter $adapter) : void
     {
         $this->matchingAdapter = $adapter;
killedBy: MatchBot\Tests\Domain\DonationRepositoryTest::testReleaseMatchFundsSuccess
statusReason: 1) MatchBot\Tests\Domain\DonationRepositoryTest::testReleaseMatchFundsSuccess
BadMethodCallException: Undefined method "setMatchingAdapter". The method name must start with either findBy, findOneBy or countBy!

/home/barney/projects/matchbot/vendor/doctrine/orm/lib/Doctrine/ORM/EntityRepository.php:283
/home/barney/projects/matchbot/tests/Domain/DonationRepositoryTest.php:627
/home/barney/projects

[Killed] CatchBlockRemoval
Domain/DonationRepository.php:55:9
      */
     public function doCreate(SalesforceWriteProxy $donation): bool
     {
-        try {
-            $salesforceDonationId = $this->getClient()->create($donation);
-            $donation->setSalesforceId($salesforceDonationId);
-        } catch (NotFoundException $ex) {
-            // Thrown only for *sandbox* 404s -> quietly stop trying to push donation to a removed campaign.
-            $this->logInfo(
-                "Marking Salesforce donation {$donation->getUuid()} as campaign removed; will not try to push again."
-            );
-            $donation->setSalesforcePushStatus(SalesforceWriteProxy::PUSH_STATUS_REMOVED);
-            $this->getEntityManager()->persist($donation);
-
-            return true; // Report 'success' for simpler summaries and spotting of real errors.
-        } catch (BadRequestException $exception) {
-            return false;
-        }
+        
 
         return true;
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

......................                                            22 / 22 (100%)

Time: 00:00.049, Memory: 20.00 MB

OK (22 tests, 85 assertions)

[Killed] MethodCallRemoval
Domain/DonationRepository.php:57:13
     {
         try {
             $salesforceDonationId = $this->getClient()->create($donation);
-            $donation->setSalesforceId($salesforceDonationId);
+            
         } catch (NotFoundException $ex) {
             // Thrown only for *sandbox* 404s -> quietly stop trying to push donation to a removed campaign.
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

......................                                            22 / 22 (100%)

Time: 00:00.048, Memory: 20.00 MB

OK (22 tests, 85 assertions)

[NoCoverage] MethodCallRemoval
Domain/DonationRepository.php:60:13
             $donation->setSalesforceId($salesforceDonationId);
         } catch (NotFoundException $ex) {
             // Thrown only for *sandbox* 404s -> quietly stop trying to push donation to a removed campaign.
-            $this->logInfo(
-                "Marking Salesforce donation {$donation->getUuid()} as campaign removed; will not try to push again."
-            );
+            
             $donation->setSalesforcePushStatus(SalesforceWriteProxy::PUSH_STATUS_REMOVED);
             $this->getEntityManager()->persist($donation);

[NoCoverage] MethodCallRemoval
Domain/DonationRepository.php:63:13
             $this->logInfo(
                 "Marking Salesforce donation {$donation->getUuid()} as campaign removed; will not try to push again."
             );
-            $donation->setSalesforcePushStatus(SalesforceWriteProxy::PUSH_STATUS_REMOVED);
+            
             $this->getEntityManager()->persist($donation);
 

[NoCoverage] MethodCallRemoval
Domain/DonationRepository.php:64:13
                 "Marking Salesforce donation {$donation->getUuid()} as campaign removed; will not try to push again."
             );
             $donation->setSalesforcePushStatus(SalesforceWriteProxy::PUSH_STATUS_REMOVED);
-            $this->getEntityManager()->persist($donation);
+            
 
             return true; // Report 'success' for simpler summaries and spotting of real errors.

[NoCoverage] TrueValue
Domain/DonationRepository.php:66:13
             $donation->setSalesforcePushStatus(SalesforceWriteProxy::PUSH_STATUS_REMOVED);
             $this->getEntityManager()->persist($donation);
 
-            return true; // Report 'success' for simpler summaries and spotting of real errors.
+            return false;
         } catch (BadRequestException $exception) {
             return false;

[NoCoverage] FalseValue
Domain/DonationRepository.php:68:13
 
             return true; // Report 'success' for simpler summaries and spotting of real errors.
         } catch (BadRequestException $exception) {
-            return false;
+            return true;
         }
 

[Killed] Identical
Domain/DonationRepository.php:80:9
      */
     public function doUpdate(SalesforceWriteProxy $donation): bool
     {
-        if ($donation->getPaymentMethodType() === null) {
+        if ($donation->getPaymentMethodType() !== null) {
             $donation->replaceNullPaymentMethodTypeWithCard();
             $this->getEntityManager()->persist($donation);
killedBy: MatchBot\Tests\Domain\DonationRepositoryTest::testExistingPushOK
statusReason: 1) MatchBot\Tests\Domain\DonationRepositoryTest::testExistingPushOK
Exception: Should only be called when payment method type is null

/home/barney/projects/matchbot/src/Domain/Donation.php:425
/home/barney/projects/matchbot/src/Domain/DonationRepository.php:73
/home/barney/projects/matchbot/src/Domain/SalesforceWriteProxyRepository.php:87
/home/barney/projects/matchbot/tests/Domain/DonationReposi

[NoCoverage] MethodCallRemoval
Domain/DonationRepository.php:81:13
     public function doUpdate(SalesforceWriteProxy $donation): bool
     {
         if ($donation->getPaymentMethodType() === null) {
-            $donation->replaceNullPaymentMethodTypeWithCard();
+            
             $this->getEntityManager()->persist($donation);
         }

[NoCoverage] MethodCallRemoval
Domain/DonationRepository.php:82:13
     {
         if ($donation->getPaymentMethodType() === null) {
             $donation->replaceNullPaymentMethodTypeWithCard();
-            $this->getEntityManager()->persist($donation);
+            
         }
 

[Killed] Identical
Domain/DonationRepository.php:86:13
         }
 
         try {
-            if ($donation->getDonationStatus() === DonationStatus::Pending) {
+            if ($donation->getDonationStatus() !== DonationStatus::Pending) {
                 // A pending status but an existing Salesforce ID suggests pushes might have ended up out
                 // of order due to race conditions pushing to Salesforce, variable and quite slow
killedBy: MatchBot\Tests\Domain\DonationRepositoryTest::testExistingPushOK
statusReason: 1) MatchBot\Tests\Domain\DonationRepositoryTest::testExistingPushOK
Some predictions failed:
Double\MatchBot\Client\Donation\P1:
  Expected exactly 1 calls that match:
      Double\MatchBot\Client\Donation\P1->put(type(MatchBot\Domain\Donation))
    but none were made.

/home/barney/projects/matchbot/vendor/phpspec/prophecy-phpunit/src/ProphecyTrait.php:61

[Killed] MethodCallRemoval
Domain/DonationRepository.php:94:17
                 // time, and just leave updates later in the process to get additional data there. As
                 // far as calling processes and retry logic goes, this should act like a[nother] successful
                 // push.
-                $this->logInfo(sprintf(
-                    'Skipping possible re-push of new-status donation %d, UUID %s, Salesforce ID %s',
-                    $donation->getId(),
-                    $donation->getUuid(),
-                    $donation->getSalesforceId(),
-                ));
+                
                 return true;
             }
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

......................                                            22 / 22 (100%)

Time: 00:00.048, Memory: 20.00 MB

OK (22 tests, 85 assertions)

[Killed] TrueValue
Domain/DonationRepository.php:100:17
                     $donation->getUuid(),
                     $donation->getSalesforceId(),
                 ));
-                return true;
+                return false;
             }
 
killedBy: MatchBot\Tests\Domain\DonationRepositoryTest::testExistingButPendingNotRePushed
statusReason: 1) MatchBot\Tests\Domain\DonationRepositoryTest::testExistingButPendingNotRePushed
Failed asserting that false is true.

/home/barney/projects/matchbot/tests/Domain/DonationRepositoryTest.php:63

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] MethodCallRemoval
Domain/DonationRepository.php:106:13
             $result = $this->getClient()->put($donation);
         } catch (NotFoundException $ex) {
             // Thrown only for *sandbox* 404s -> quietly stop trying to push the removed donation.
-            $this->logInfo(
-                "Marking old Salesforce donation {$donation->getUuid()} as removed; will not try to push again."
-            );
+            
             $donation->setSalesforcePushStatus(SalesforceWriteProxy::PUSH_STATUS_REMOVED);
             $this->getEntityManager()->persist($donation);
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

......................                                            22 / 22 (100%)

Time: 00:00.051, Memory: 20.00 MB

OK (22 tests, 85 assertions)

[Killed] PublicVisibility
Domain/DonationRepository.php:123:5
      * @return Donation
      * @throws \UnexpectedValueException if inputs invalid, including projectId being unrecognised
      */
-    public function buildFromApiRequest(DonationCreate $donationData): Donation
+    protected function buildFromApiRequest(DonationCreate $donationData) : Donation
     {
         if (!in_array($donationData->psp, ['stripe'], true)) {
killedBy: MatchBot\Tests\Domain\DonationRepositoryTest::testBuildFromApiRequestSuccess
statusReason: 1) MatchBot\Tests\Domain\DonationRepositoryTest::testBuildFromApiRequestSuccess
BadMethodCallException: Undefined method "buildFromApiRequest". The method name must start with either findBy, findOneBy or countBy!

/home/barney/projects/matchbot/vendor/doctrine/orm/lib/Doctrine/ORM/EntityRepository.php:283
/home/barney/projects/matchbot/tests/Domain/DonationRepositoryTest.php:162

ERRORS!
Tests: 1,

[Killed] LogicalNot
Domain/DonationRepository.php:125:9
      */
     public function buildFromApiRequest(DonationCreate $donationData): Donation
     {
-        if (!in_array($donationData->psp, ['stripe'], true)) {
+        if (in_array($donationData->psp, ['stripe'], true)) {
             throw new \UnexpectedValueException(sprintf(
                 'PSP %s is invalid',
killedBy: MatchBot\Tests\Domain\DonationRepositoryTest::testBuildFromApiRequestSuccess
statusReason: 1) MatchBot\Tests\Domain\DonationRepositoryTest::testBuildFromApiRequestSuccess
UnexpectedValueException: PSP stripe is invalid

/home/barney/projects/matchbot/src/Domain/DonationRepository.php:107
/home/barney/projects/matchbot/tests/Domain/DonationRepositoryTest.php:162

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[NoCoverage] Throw_
Domain/DonationRepository.php:126:13
     public function buildFromApiRequest(DonationCreate $donationData): Donation
     {
         if (!in_array($donationData->psp, ['stripe'], true)) {
-            throw new \UnexpectedValueException(sprintf(
-                'PSP %s is invalid',
-                $donationData->psp,
-            ));
+            new \UnexpectedValueException(sprintf('PSP %s is invalid', $donationData->psp));
         }
 

[Killed] ArrayItemRemoval
Domain/DonationRepository.php:132:9
             ));
         }
 
-        $campaign = $this->campaignRepository->findOneBy(['salesforceId' => $donationData->projectId]);
+        $campaign = $this->campaignRepository->findOneBy([]);
 
         if (!$campaign) {
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

......................                                            22 / 22 (100%)

Time: 00:00.048, Memory: 20.00 MB

OK (22 tests, 85 assertions)

[Killed] ArrayItem
Domain/DonationRepository.php:132:9
             ));
         }
 
-        $campaign = $this->campaignRepository->findOneBy(['salesforceId' => $donationData->projectId]);
+        $campaign = $this->campaignRepository->findOneBy(['salesforceId' > $donationData->projectId]);
 
         if (!$campaign) {
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

......................                                            22 / 22 (100%)

Time: 00:00.049, Memory: 20.00 MB

OK (22 tests, 85 assertions)

[Killed] LogicalNot
Domain/DonationRepository.php:134:9
 
         $campaign = $this->campaignRepository->findOneBy(['salesforceId' => $donationData->projectId]);
 
-        if (!$campaign) {
+        if ($campaign) {
             // Fetch data for as-yet-unknown campaigns on-demand
             $this->logInfo("Loading unknown campaign ID {$donationData->projectId} on-demand");
killedBy: MatchBot\Tests\Domain\DonationRepositoryTest::testBuildFromApiRequestSuccess
statusReason: 1) MatchBot\Tests\Domain\DonationRepositoryTest::testBuildFromApiRequestSuccess
TypeError: Double\MatchBot\Domain\CampaignRepository\P1::pull(): Return value must be of type MatchBot\Domain\SalesforceReadProxy, null returned

/home/barney/projects/matchbot/src/Domain/DonationRepository.php:116
/home/barney/projects/matchbot/tests/Domain/DonationRepositoryTest.php:162

ERRORS!
Tests: 1, Assertions:

[NoCoverage] MethodCallRemoval
Domain/DonationRepository.php:136:13
 
         if (!$campaign) {
             // Fetch data for as-yet-unknown campaigns on-demand
-            $this->logInfo("Loading unknown campaign ID {$donationData->projectId} on-demand");
+            
             $campaign = new Campaign(charity: null);
             $campaign->setSalesforceId($donationData->projectId);

[NoCoverage] MethodCallRemoval
Domain/DonationRepository.php:138:13
             // Fetch data for as-yet-unknown campaigns on-demand
             $this->logInfo("Loading unknown campaign ID {$donationData->projectId} on-demand");
             $campaign = new Campaign(charity: null);
-            $campaign->setSalesforceId($donationData->projectId);
+            
             try {
                 $campaign = $this->campaignRepository->pull($campaign);

[NoCoverage] MethodCallRemoval
Domain/DonationRepository.php:142:17
             try {
                 $campaign = $this->campaignRepository->pull($campaign);
             } catch (ClientException $exception) {
-                $this->logError("Pull error for campaign ID {$donationData->projectId}: {$exception->getMessage()}");
+                
                 throw new \UnexpectedValueException('Campaign does not exist');
             }

[NoCoverage] Throw_
Domain/DonationRepository.php:143:17
                 $campaign = $this->campaignRepository->pull($campaign);
             } catch (ClientException $exception) {
                 $this->logError("Pull error for campaign ID {$donationData->projectId}: {$exception->getMessage()}");
-                throw new \UnexpectedValueException('Campaign does not exist');
+                new \UnexpectedValueException('Campaign does not exist');
             }
             $this->fundRepository->pullForCampaign($campaign);

[NoCoverage] MethodCallRemoval
Domain/DonationRepository.php:145:13
                 $this->logError("Pull error for campaign ID {$donationData->projectId}: {$exception->getMessage()}");
                 throw new \UnexpectedValueException('Campaign does not exist');
             }
-            $this->fundRepository->pullForCampaign($campaign);
+            
 
             $this->getEntityManager()->flush();

[NoCoverage] MethodCallRemoval
Domain/DonationRepository.php:147:13
             }
             $this->fundRepository->pullForCampaign($campaign);
 
-            $this->getEntityManager()->flush();
+            
 
             // Because this case of campaigns being set up individually is relatively rare,

[NoCoverage] MethodCallRemoval
Domain/DonationRepository.php:155:13
             // we do so.
             /** @var CacheProvider $cacheDriver */
             $cacheDriver = $this->getEntityManager()->getConfiguration()->getResultCacheImpl();
-            $cacheDriver->deleteAll();
+            
         }
 

[Killed] NotIdentical
Domain/DonationRepository.php:158:9
             $cacheDriver->deleteAll();
         }
 
-        if ($donationData->currencyCode !== $campaign->getCurrencyCode()) {
+        if ($donationData->currencyCode === $campaign->getCurrencyCode()) {
             throw new \UnexpectedValueException(sprintf(
                 'Currency %s is invalid for campaign',
killedBy: MatchBot\Tests\Domain\DonationRepositoryTest::testBuildFromApiRequestSuccess
statusReason: 1) MatchBot\Tests\Domain\DonationRepositoryTest::testBuildFromApiRequestSuccess
UnexpectedValueException: Currency USD is invalid for campaign

/home/barney/projects/matchbot/src/Domain/DonationRepository.php:132
/home/barney/projects/matchbot/tests/Domain/DonationRepositoryTest.php:162

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] Throw_
Domain/DonationRepository.php:159:13
         }
 
         if ($donationData->currencyCode !== $campaign->getCurrencyCode()) {
-            throw new \UnexpectedValueException(sprintf(
-                'Currency %s is invalid for campaign',
-                $donationData->currencyCode,
-            ));
+            new \UnexpectedValueException(sprintf('Currency %s is invalid for campaign', $donationData->currencyCode));
         }
 
killedBy: MatchBot\Tests\Domain\DonationRepositoryTest::testBuildFromApiRequestWithCurrencyMismatch
statusReason: 1) MatchBot\Tests\Domain\DonationRepositoryTest::testBuildFromApiRequestWithCurrencyMismatch
Failed asserting that exception of type "Error" matches expected exception "UnexpectedValueException". Message was: "Typed property MatchBot\Domain\Campaign::$charity must not be accessed before initialization" at
/home/barney/projects/matchbot/src/Domain/Campaign.php:161
/home/barney/projects/matchbot/src

[Killed] MethodCallRemoval
Domain/DonationRepository.php:166:9
         }
 
         $donation = Donation::fromApiModel($donationData, $campaign);
-        $this->deriveFees($donation, null, null);
+        
 
         return $donation;
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

......................                                            22 / 22 (100%)

Time: 00:00.048, Memory: 20.00 MB

OK (22 tests, 85 assertions)

[NoCoverage] PublicVisibility
Domain/DonationRepository.php:180:5
      *  return value is only used in retrospective mathcing command - Donation::create does not take return value.
      * @see CampaignFundingRepository::getAvailableFundings() for lock acquisition detail
      */
-    public function allocateMatchFunds(Donation $donation): string
+    protected function allocateMatchFunds(Donation $donation) : string
     {
         $allocationDone = false;

[NoCoverage] FalseValue
Domain/DonationRepository.php:182:9
      */
     public function allocateMatchFunds(Donation $donation): string
     {
-        $allocationDone = false;
+        $allocationDone = true;
         $allocationTries = 0;
         // We look up matching withdrawals to allow for the case where retrospective matching was required

[NoCoverage] DecrementInteger
Domain/DonationRepository.php:183:9
     public function allocateMatchFunds(Donation $donation): string
     {
         $allocationDone = false;
-        $allocationTries = 0;
+        $allocationTries = -1;
         // We look up matching withdrawals to allow for the case where retrospective matching was required
         // and the donation is not new, and *some* (or full) matching already occurred. The collection of withdrawals

[NoCoverage] LogicalNot
Domain/DonationRepository.php:192:9
         /** @var FundingWithdrawal[] $newWithdrawals */
         $newWithdrawals = [];
 
-        while (!$allocationDone && $allocationTries < $this->maxLockTries) {
+        while ($allocationDone && $allocationTries < $this->maxLockTries) {
             try {
                 $likelyAvailableFunds = $this->getEntityManager()

[NoCoverage] LogicalAndAllSubExprNegation
Domain/DonationRepository.php:192:9
         /** @var FundingWithdrawal[] $newWithdrawals */
         $newWithdrawals = [];
 
-        while (!$allocationDone && $allocationTries < $this->maxLockTries) {
+        while ($allocationDone && !($allocationTries < $this->maxLockTries)) {
             try {
                 $likelyAvailableFunds = $this->getEntityManager()

[NoCoverage] Foreach_
Domain/DonationRepository.php:198:17
                     ->getRepository(CampaignFunding::class)
                     ->getAvailableFundings($donation->getCampaign());
 
-                foreach ($likelyAvailableFunds as $funding) {
-                    if ($funding->getCurrencyCode() !== $donation->getCurrencyCode()) {
-                        throw new \UnexpectedValueException('Currency mismatch');
-                    }
-                }
+                foreach (array() as $funding) {
 
                 $lockStartTime = microtime(true);

[NoCoverage] NotIdentical
Domain/DonationRepository.php:199:21
                     ->getAvailableFundings($donation->getCampaign());
 
                 foreach ($likelyAvailableFunds as $funding) {
-                    if ($funding->getCurrencyCode() !== $donation->getCurrencyCode()) {
+                    if ($funding->getCurrencyCode() === $donation->getCurrencyCode()) {
                         throw new \UnexpectedValueException('Currency mismatch');
                     }

[NoCoverage] Throw_
Domain/DonationRepository.php:200:25
 
                 foreach ($likelyAvailableFunds as $funding) {
                     if ($funding->getCurrencyCode() !== $donation->getCurrencyCode()) {
-                        throw new \UnexpectedValueException('Currency mismatch');
+                        new \UnexpectedValueException('Currency mismatch');
                     }
                 }

[NoCoverage] TrueValue
Domain/DonationRepository.php:210:17
                 );
                 $lockEndTime = microtime(true);
 
-                $allocationDone = true;
+                $allocationDone = false;
                 $this->persistQueuedDonations();
             } catch (Matching\TerminalLockException $exception) { // Includes non-retryable `DBALException`s

[NoCoverage] MethodCallRemoval
Domain/DonationRepository.php:211:17
                 $lockEndTime = microtime(true);
 
                 $allocationDone = true;
-                $this->persistQueuedDonations();
+                
             } catch (Matching\TerminalLockException $exception) { // Includes non-retryable `DBALException`s
                 $waitTime = round(microtime(true) - $lockStartTime, 6);

[NoCoverage] DecrementInteger
Domain/DonationRepository.php:213:17
                 $allocationDone = true;
                 $this->persistQueuedDonations();
             } catch (Matching\TerminalLockException $exception) { // Includes non-retryable `DBALException`s
-                $waitTime = round(microtime(true) - $lockStartTime, 6);
+                $waitTime = round(microtime(true) - $lockStartTime, 5);
                 $this->logError(
                     "Match allocate FINAL error: ID {$donation->getUuid()} got " . get_class($exception) .

[NoCoverage] RoundingFamily
Domain/DonationRepository.php:213:17
                 $allocationDone = true;
                 $this->persistQueuedDonations();
             } catch (Matching\TerminalLockException $exception) { // Includes non-retryable `DBALException`s
-                $waitTime = round(microtime(true) - $lockStartTime, 6);
+                $waitTime = floor(microtime(true) - $lockStartTime);
                 $this->logError(
                     "Match allocate FINAL error: ID {$donation->getUuid()} got " . get_class($exception) .

[NoCoverage] MethodCallRemoval
Domain/DonationRepository.php:214:17
                 $this->persistQueuedDonations();
             } catch (Matching\TerminalLockException $exception) { // Includes non-retryable `DBALException`s
                 $waitTime = round(microtime(true) - $lockStartTime, 6);
-                $this->logError(
-                    "Match allocate FINAL error: ID {$donation->getUuid()} got " . get_class($exception) .
-                    " after {$waitTime}s on try #$allocationTries: {$exception->getMessage()}"
-                );
+                
                 throw $exception; // Re-throw exception after logging the details if not recoverable
             }

[NoCoverage] ConcatOperandRemoval
Domain/DonationRepository.php:215:21
             } catch (Matching\TerminalLockException $exception) { // Includes non-retryable `DBALException`s
                 $waitTime = round(microtime(true) - $lockStartTime, 6);
                 $this->logError(
-                    "Match allocate FINAL error: ID {$donation->getUuid()} got " . get_class($exception) .
+                    $this->logError("Match allocate FINAL error: ID {$donation->getUuid()} got " . " after {$waitTime}s on try #{$allocationTries}: {$exception->getMessage()}");
                     " after {$waitTime}s on try #$allocationTries: {$exception->getMessage()}"
                 );

[NoCoverage] ConcatOperandRemoval
Domain/DonationRepository.php:215:21
             } catch (Matching\TerminalLockException $exception) { // Includes non-retryable `DBALException`s
                 $waitTime = round(microtime(true) - $lockStartTime, 6);
                 $this->logError(
-                    "Match allocate FINAL error: ID {$donation->getUuid()} got " . get_class($exception) .
+                    $this->logError(get_class($exception) . " after {$waitTime}s on try #{$allocationTries}: {$exception->getMessage()}");
                     " after {$waitTime}s on try #$allocationTries: {$exception->getMessage()}"
                 );

[NoCoverage] Throw_
Domain/DonationRepository.php:218:17
                     "Match allocate FINAL error: ID {$donation->getUuid()} got " . get_class($exception) .
                     " after {$waitTime}s on try #$allocationTries: {$exception->getMessage()}"
                 );
-                throw $exception; // Re-throw exception after logging the details if not recoverable
+                $exception;
             }
         }

[NoCoverage] LogicalNot
Domain/DonationRepository.php:222:9
             }
         }
 
-        if (!$allocationDone) {
+        if ($allocationDone) {
             $this->logger->error(
                 "Match allocate FINAL error: ID {$donation->getUuid()} failed matching after $allocationTries tries"

[NoCoverage] MethodCallRemoval
Domain/DonationRepository.php:223:13
         }
 
         if (!$allocationDone) {
-            $this->logger->error(
-                "Match allocate FINAL error: ID {$donation->getUuid()} failed matching after $allocationTries tries"
-            );
+            
 
             throw new DomainLockContentionException();

[NoCoverage] Throw_
Domain/DonationRepository.php:227:13
                 "Match allocate FINAL error: ID {$donation->getUuid()} failed matching after $allocationTries tries"
             );
 
-            throw new DomainLockContentionException();
+            new DomainLockContentionException();
         }
 

[NoCoverage] Foreach_
Domain/DonationRepository.php:235:9
         // immediately match the amount deducted from the fund.
         $amountNewlyMatched = '0.0';
 
-        foreach ($newWithdrawals as $newWithdrawal) {
-            $this->getEntityManager()->persist($newWithdrawal);
-            $donation->addFundingWithdrawal($newWithdrawal);
-            $amountNewlyMatched = bcadd($amountNewlyMatched, $newWithdrawal->getAmount(), 2);
-        }
+        foreach (array() as $newWithdrawal) {
 
         $this->logInfo('ID ' . $donation->getUuid() . ' allocated new match funds totalling ' . $amountNewlyMatched);

[NoCoverage] MethodCallRemoval
Domain/DonationRepository.php:236:13
         $amountNewlyMatched = '0.0';
 
         foreach ($newWithdrawals as $newWithdrawal) {
-            $this->getEntityManager()->persist($newWithdrawal);
+            
             $donation->addFundingWithdrawal($newWithdrawal);
             $amountNewlyMatched = bcadd($amountNewlyMatched, $newWithdrawal->getAmount(), 2);

[NoCoverage] MethodCallRemoval
Domain/DonationRepository.php:237:13
 
         foreach ($newWithdrawals as $newWithdrawal) {
             $this->getEntityManager()->persist($newWithdrawal);
-            $donation->addFundingWithdrawal($newWithdrawal);
+            
             $amountNewlyMatched = bcadd($amountNewlyMatched, $newWithdrawal->getAmount(), 2);
         }

[NoCoverage] BCMath
Domain/DonationRepository.php:238:13
         foreach ($newWithdrawals as $newWithdrawal) {
             $this->getEntityManager()->persist($newWithdrawal);
             $donation->addFundingWithdrawal($newWithdrawal);
-            $amountNewlyMatched = bcadd($amountNewlyMatched, $newWithdrawal->getAmount(), 2);
+            $amountNewlyMatched = (string) ($amountNewlyMatched + $newWithdrawal->getAmount());
         }
 

[NoCoverage] IncrementInteger
Domain/DonationRepository.php:238:13
         foreach ($newWithdrawals as $newWithdrawal) {
             $this->getEntityManager()->persist($newWithdrawal);
             $donation->addFundingWithdrawal($newWithdrawal);
-            $amountNewlyMatched = bcadd($amountNewlyMatched, $newWithdrawal->getAmount(), 2);
+            $amountNewlyMatched = bcadd($amountNewlyMatched, $newWithdrawal->getAmount(), 3);
         }
 
