[NoCoverage] MethodCallRemoval
Domain/DonationRepository.php:241:9
             $amountNewlyMatched = bcadd($amountNewlyMatched, $newWithdrawal->getAmount(), 2);
         }
 
-        $this->logInfo('ID ' . $donation->getUuid() . ' allocated new match funds totalling ' . $amountNewlyMatched);
+        
         $this->logInfo('Allocation took ' . round($lockEndTime - $lockStartTime, 6) . ' seconds');
 

[NoCoverage] ConcatOperandRemoval
Domain/DonationRepository.php:241:9
             $amountNewlyMatched = bcadd($amountNewlyMatched, $newWithdrawal->getAmount(), 2);
         }
 
-        $this->logInfo('ID ' . $donation->getUuid() . ' allocated new match funds totalling ' . $amountNewlyMatched);
+        $this->logInfo('ID ' . $donation->getUuid() . $amountNewlyMatched);
         $this->logInfo('Allocation took ' . round($lockEndTime - $lockStartTime, 6) . ' seconds');
 

[NoCoverage] MethodCallRemoval
Domain/DonationRepository.php:242:9
         }
 
         $this->logInfo('ID ' . $donation->getUuid() . ' allocated new match funds totalling ' . $amountNewlyMatched);
-        $this->logInfo('Allocation took ' . round($lockEndTime - $lockStartTime, 6) . ' seconds');
+        
 
         $this->getEntityManager()->flush();

[NoCoverage] Minus
Domain/DonationRepository.php:242:9
         }
 
         $this->logInfo('ID ' . $donation->getUuid() . ' allocated new match funds totalling ' . $amountNewlyMatched);
-        $this->logInfo('Allocation took ' . round($lockEndTime - $lockStartTime, 6) . ' seconds');
+        $this->logInfo('Allocation took ' . round($lockEndTime + $lockStartTime, 6) . ' seconds');
 
         $this->getEntityManager()->flush();

[Killed] PublicVisibility
Domain/DonationRepository.php:260:5
      * @throws DomainLockContentionException
      * @throws Matching\TerminalLockException
      */
-    public function releaseMatchFunds(Donation $donation): void
+    protected function releaseMatchFunds(Donation $donation) : void
     {
         // Release match funds only having acquired a lock to ensure another thread
killedBy: MatchBot\Tests\Domain\DonationRepositoryTest::testReleaseMatchFundsSuccess
statusReason: 1) MatchBot\Tests\Domain\DonationRepositoryTest::testReleaseMatchFundsSuccess
BadMethodCallException: Undefined method "releaseMatchFunds". The method name must start with either findBy, findOneBy or countBy!

/home/barney/projects/matchbot/vendor/doctrine/orm/lib/Doctrine/ORM/EntityRepository.php:283
/home/barney/projects/matchbot/tests/Domain/DonationRepositoryTest.php:388

ERRORS!
Tests: 1, Ass

[Killed] FalseValue
Domain/DonationRepository.php:277:13
         $fundsReleaseLock = $this->lockFactory->createLock("release-funds-{$donation->getUuid()}");
 
         try {
-            $gotLock = $fundsReleaseLock->acquire(false);
+            $gotLock = $fundsReleaseLock->acquire(true);
         } catch (LockAcquiringException $exception) {
             // According to the method (but not the exception) docs, `LockConflictedException` is thrown only
killedBy: MatchBot\Tests\Domain\DonationRepositoryTest::testReleaseMatchFundsSuccess
statusReason: 1) MatchBot\Tests\Domain\DonationRepositoryTest::testReleaseMatchFundsSuccess
TypeError: Double\LockInterface\P1::acquire(): Return value must be of type bool, null returned

/home/barney/projects/matchbot/src/Domain/DonationRepository.php:222
/home/barney/projects/matchbot/tests/Domain/DonationRepositoryTest.php:388

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] MethodCallRemoval
Domain/DonationRepository.php:282:13
             // According to the method (but not the exception) docs, `LockConflictedException` is thrown only
             // "If the lock is acquired by someone else in blocking mode", and so should not be expected for
             // our use case or caught here.
-            $this->logger->warning(sprintf(
-                'Skipped releasing match funds for donation ID %s due to %s acquiring lock',
-                $donation->getUuid(),
-                get_class($exception),
-            ));
+            
 
             return;
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

......................                                            22 / 22 (100%)

Time: 00:00.049, Memory: 20.00 MB

OK (22 tests, 85 assertions)

[Killed] LogicalNot
Domain/DonationRepository.php:291:9
             return;
         }
 
-        if (!$gotLock) {
+        if ($gotLock) {
             $this->logger->warning(sprintf(
                 'Skipped releasing match funds for donation ID %s as lock was not acquired',
killedBy: MatchBot\Tests\Domain\DonationRepositoryTest::testReleaseMatchFundsSuccess
statusReason: 1) MatchBot\Tests\Domain\DonationRepositoryTest::testReleaseMatchFundsSuccess
Some predictions failed:
Double\LockInterface\P1:
  Expected exactly 1 calls that match:
      Double\LockInterface\P1->release()
    but none were made.
Double\MatchBot\Application\Matching\Adapter\P3:
  Expected exactly 1 calls that match:

[Killed] MethodCallRemoval
Domain/DonationRepository.php:292:13
         }
 
         if (!$gotLock) {
-            $this->logger->warning(sprintf(
-                'Skipped releasing match funds for donation ID %s as lock was not acquired',
-                $donation->getUuid(),
-            ));
+            
 
             return;
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

......................                                            22 / 22 (100%)

Time: 00:00.048, Memory: 20.00 MB

OK (22 tests, 85 assertions)

[Killed] DecrementInteger
Domain/DonationRepository.php:300:9
             return;
         }
 
-        $releaseTries = 0;
+        $releaseTries = -1;
         $releaseDone = false;
 
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

......................                                            22 / 22 (100%)

Time: 00:00.048, Memory: 20.00 MB

OK (22 tests, 85 assertions)

[Killed] FalseValue
Domain/DonationRepository.php:301:9
         }
 
         $releaseTries = 0;
-        $releaseDone = false;
+        $releaseDone = true;
 
         while (!$releaseDone && $releaseTries < $this->maxLockTries) {
killedBy: MatchBot\Tests\Domain\DonationRepositoryTest::testReleaseMatchFundsSuccess
statusReason: 1) MatchBot\Tests\Domain\DonationRepositoryTest::testReleaseMatchFundsSuccess
Undefined variable $totalAmountReleased

/home/barney/projects/matchbot/src/Domain/DonationRepository.php:268
/home/barney/projects/matchbot/tests/Domain/DonationRepositoryTest.php:388

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] LogicalAndAllSubExprNegation
Domain/DonationRepository.php:303:9
         $releaseTries = 0;
         $releaseDone = false;
 
-        while (!$releaseDone && $releaseTries < $this->maxLockTries) {
+        while ($releaseDone && !($releaseTries < $this->maxLockTries)) {
             $totalAmountReleased = '0.00';
             try {
killedBy: MatchBot\Tests\Domain\DonationRepositoryTest::testReleaseMatchFundsSuccess
statusReason: 1) MatchBot\Tests\Domain\DonationRepositoryTest::testReleaseMatchFundsSuccess
MatchBot\Domain\DomainException\DomainLockContentionException: 

/home/barney/projects/matchbot/src/Domain/DonationRepository.php:266
/home/barney/projects/matchbot/tests/Domain/DonationRepositoryTest.php:388

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] LessThan
Domain/DonationRepository.php:303:9
         $releaseTries = 0;
         $releaseDone = false;
 
-        while (!$releaseDone && $releaseTries < $this->maxLockTries) {
+        while (!$releaseDone && $releaseTries <= $this->maxLockTries) {
             $totalAmountReleased = '0.00';
             try {
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

......................                                            22 / 22 (100%)

Time: 00:00.049, Memory: 20.00 MB

OK (22 tests, 85 assertions)

[NoCoverage] Foreach_
Domain/DonationRepository.php:309:25
                 $lockStartTime = microtime(true);
                 $totalAmountReleased = $this->matchingAdapter->runTransactionally(
                     function () use ($donation, $totalAmountReleased) {
-                        foreach ($donation->getFundingWithdrawals() as $fundingWithdrawal) {
-                            $funding = $fundingWithdrawal->getCampaignFunding();
-                            $newTotal = $this->matchingAdapter->addAmount($funding, $fundingWithdrawal->getAmount());
-                            $totalAmountReleased = bcadd($totalAmountReleased, $fundingWithdrawal->getAmount(), 2);
-                            $this->logInfo("Released {$fundingWithdrawal->getAmount()} to funding {$funding->getId()}");
-                            $this->logInfo("New fund total for {$funding->getId()}: $newTotal");
-                        }
+                        foreach (array() as $fundingWithdrawal) {
 
                         return $totalAmountReleased;

[NoCoverage] IncrementInteger
Domain/DonationRepository.php:312:29
                         foreach ($donation->getFundingWithdrawals() as $fundingWithdrawal) {
                             $funding = $fundingWithdrawal->getCampaignFunding();
                             $newTotal = $this->matchingAdapter->addAmount($funding, $fundingWithdrawal->getAmount());
-                            $totalAmountReleased = bcadd($totalAmountReleased, $fundingWithdrawal->getAmount(), 2);
+                            $totalAmountReleased = bcadd($totalAmountReleased, $fundingWithdrawal->getAmount(), 3);
                             $this->logInfo("Released {$fundingWithdrawal->getAmount()} to funding {$funding->getId()}");
                             $this->logInfo("New fund total for {$funding->getId()}: $newTotal");

[NoCoverage] BCMath
Domain/DonationRepository.php:312:29
                         foreach ($donation->getFundingWithdrawals() as $fundingWithdrawal) {
                             $funding = $fundingWithdrawal->getCampaignFunding();
                             $newTotal = $this->matchingAdapter->addAmount($funding, $fundingWithdrawal->getAmount());
-                            $totalAmountReleased = bcadd($totalAmountReleased, $fundingWithdrawal->getAmount(), 2);
+                            $totalAmountReleased = (string) ($totalAmountReleased + $fundingWithdrawal->getAmount());
                             $this->logInfo("Released {$fundingWithdrawal->getAmount()} to funding {$funding->getId()}");
                             $this->logInfo("New fund total for {$funding->getId()}: $newTotal");

[NoCoverage] MethodCallRemoval
Domain/DonationRepository.php:313:29
                             $funding = $fundingWithdrawal->getCampaignFunding();
                             $newTotal = $this->matchingAdapter->addAmount($funding, $fundingWithdrawal->getAmount());
                             $totalAmountReleased = bcadd($totalAmountReleased, $fundingWithdrawal->getAmount(), 2);
-                            $this->logInfo("Released {$fundingWithdrawal->getAmount()} to funding {$funding->getId()}");
+                            
                             $this->logInfo("New fund total for {$funding->getId()}: $newTotal");
                         }

[NoCoverage] MethodCallRemoval
Domain/DonationRepository.php:314:29
                             $newTotal = $this->matchingAdapter->addAmount($funding, $fundingWithdrawal->getAmount());
                             $totalAmountReleased = bcadd($totalAmountReleased, $fundingWithdrawal->getAmount(), 2);
                             $this->logInfo("Released {$fundingWithdrawal->getAmount()} to funding {$funding->getId()}");
-                            $this->logInfo("New fund total for {$funding->getId()}: $newTotal");
+                            
                         }
 

[Killed] MethodCallRemoval
Domain/DonationRepository.php:324:21
                 $releaseDone = true;
 
                 try {
-                    $this->removeAllFundingWithdrawalsForDonation($donation);
+                    
                 } catch (DBALException $exception) {
                     $this->logError('Doctrine could not remove withdrawals after maximum tries');
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

......................                                            22 / 22 (100%)

Time: 00:00.050, Memory: 20.00 MB

OK (22 tests, 85 assertions)

[Killed] MethodCallRemoval
Domain/DonationRepository.php:326:21
                 try {
                     $this->removeAllFundingWithdrawalsForDonation($donation);
                 } catch (DBALException $exception) {
-                    $this->logError('Doctrine could not remove withdrawals after maximum tries');
+                    
                 }
             } catch (Matching\TerminalLockException $exception) {
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

......................                                            22 / 22 (100%)

Time: 00:00.056, Memory: 20.00 MB

OK (22 tests, 85 assertions)

[NoCoverage] Minus
Domain/DonationRepository.php:329:17
                     $this->logError('Doctrine could not remove withdrawals after maximum tries');
                 }
             } catch (Matching\TerminalLockException $exception) {
-                $waitTime = round(microtime(true) - $lockStartTime, 6);
+                $waitTime = round(microtime(true) + $lockStartTime, 6);
                 $this->logError(
                     'Match release FINAL error: ID ' . $donation->getUuid() . ' got ' . get_class($exception) .

[NoCoverage] RoundingFamily
Domain/DonationRepository.php:329:17
                     $this->logError('Doctrine could not remove withdrawals after maximum tries');
                 }
             } catch (Matching\TerminalLockException $exception) {
-                $waitTime = round(microtime(true) - $lockStartTime, 6);
+                $waitTime = ceil(microtime(true) - $lockStartTime);
                 $this->logError(
                     'Match release FINAL error: ID ' . $donation->getUuid() . ' got ' . get_class($exception) .

[NoCoverage] MethodCallRemoval
Domain/DonationRepository.php:330:17
                 }
             } catch (Matching\TerminalLockException $exception) {
                 $waitTime = round(microtime(true) - $lockStartTime, 6);
-                $this->logError(
-                    'Match release FINAL error: ID ' . $donation->getUuid() . ' got ' . get_class($exception) .
-                    " after {$waitTime}s on try #$releaseTries: {$exception->getMessage()}"
-                );
+                
                 throw $exception; // Re-throw exception after logging the details if not recoverable
             }

[NoCoverage] ConcatOperandRemoval
Domain/DonationRepository.php:331:21
             } catch (Matching\TerminalLockException $exception) {
                 $waitTime = round(microtime(true) - $lockStartTime, 6);
                 $this->logError(
-                    'Match release FINAL error: ID ' . $donation->getUuid() . ' got ' . get_class($exception) .
+                    $this->logError('Match release FINAL error: ID ' . ' got ' . get_class($exception) . " after {$waitTime}s on try #{$releaseTries}: {$exception->getMessage()}");
                     " after {$waitTime}s on try #$releaseTries: {$exception->getMessage()}"
                 );

[NoCoverage] ConcatOperandRemoval
Domain/DonationRepository.php:331:21
             } catch (Matching\TerminalLockException $exception) {
                 $waitTime = round(microtime(true) - $lockStartTime, 6);
                 $this->logError(
-                    'Match release FINAL error: ID ' . $donation->getUuid() . ' got ' . get_class($exception) .
+                    $this->logError($donation->getUuid() . ' got ' . get_class($exception) . " after {$waitTime}s on try #{$releaseTries}: {$exception->getMessage()}");
                     " after {$waitTime}s on try #$releaseTries: {$exception->getMessage()}"
                 );

[Killed] LogicalNot
Domain/DonationRepository.php:338:9
             }
         }
 
-        if (!$releaseDone) {
+        if ($releaseDone) {
             $this->logger->error(
                 "Match release FINAL error: ID {$donation->getUuid()} failed releasing after $releaseTries tries"
killedBy: MatchBot\Tests\Domain\DonationRepositoryTest::testReleaseMatchFundsSuccess
statusReason: 1) MatchBot\Tests\Domain\DonationRepositoryTest::testReleaseMatchFundsSuccess
MatchBot\Domain\DomainException\DomainLockContentionException: 

/home/barney/projects/matchbot/src/Domain/DonationRepository.php:266
/home/barney/projects/matchbot/tests/Domain/DonationRepositoryTest.php:388

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[NoCoverage] MethodCallRemoval
Domain/DonationRepository.php:339:13
         }
 
         if (!$releaseDone) {
-            $this->logger->error(
-                "Match release FINAL error: ID {$donation->getUuid()} failed releasing after $releaseTries tries"
-            );
+            
 
             throw new DomainLockContentionException();

[Killed] MethodCallRemoval
Domain/DonationRepository.php:346:9
             throw new DomainLockContentionException();
         }
 
-        $this->logInfo("Taking from ID {$donation->getUuid()} released match funds totalling {$totalAmountReleased}");
+        
         $this->logInfo('Deallocation took ' . round($lockEndTime - $lockStartTime, 6) . ' seconds');
 
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

......................                                            22 / 22 (100%)

Time: 00:00.060, Memory: 20.00 MB

OK (22 tests, 85 assertions)

[Killed] Concat
Domain/DonationRepository.php:347:9
         }
 
         $this->logInfo("Taking from ID {$donation->getUuid()} released match funds totalling {$totalAmountReleased}");
-        $this->logInfo('Deallocation took ' . round($lockEndTime - $lockStartTime, 6) . ' seconds');
+        $this->logInfo('Deallocation took ' . ' seconds' . round($lockEndTime - $lockStartTime, 6));
 
         $fundsReleaseLock->release();
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

......................                                            22 / 22 (100%)

Time: 00:00.063, Memory: 20.00 MB

OK (22 tests, 85 assertions)

[Killed] Minus
Domain/DonationRepository.php:347:9
         }
 
         $this->logInfo("Taking from ID {$donation->getUuid()} released match funds totalling {$totalAmountReleased}");
-        $this->logInfo('Deallocation took ' . round($lockEndTime - $lockStartTime, 6) . ' seconds');
+        $this->logInfo('Deallocation took ' . round($lockEndTime + $lockStartTime, 6) . ' seconds');
 
         $fundsReleaseLock->release();
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

......................                                            22 / 22 (100%)

Time: 00:00.061, Memory: 20.00 MB

OK (22 tests, 85 assertions)

[Killed] MethodCallRemoval
Domain/DonationRepository.php:349:9
         $this->logInfo("Taking from ID {$donation->getUuid()} released match funds totalling {$totalAmountReleased}");
         $this->logInfo('Deallocation took ' . round($lockEndTime - $lockStartTime, 6) . ' seconds');
 
-        $fundsReleaseLock->release();
+        
     }
 
killedBy: MatchBot\Tests\Domain\DonationRepositoryTest::testReleaseMatchFundsSuccess
statusReason: 1) MatchBot\Tests\Domain\DonationRepositoryTest::testReleaseMatchFundsSuccess
Some predictions failed:
Double\LockInterface\P1:
  Expected exactly 1 calls that match:
      Double\LockInterface\P1->release()
    but none were made.

/home/barney/projects/matchbot/vendor/phpspec/prophecy-phpunit/src/ProphecyTrait.php:61

[NoCoverage] PublicVisibility
Domain/DonationRepository.php:355:5
     /**
      * @return Donation[]
      */
-    public function findWithExpiredMatching(\DateTimeImmutable $now): array
+    protected function findWithExpiredMatching(\DateTimeImmutable $now) : array
     {
         $cutoff = $now->sub(new \DateInterval('PT' . self::EXPIRY_SECONDS . 'S'));

[NoCoverage] ConcatOperandRemoval
Domain/DonationRepository.php:357:9
      */
     public function findWithExpiredMatching(\DateTimeImmutable $now): array
     {
-        $cutoff = $now->sub(new \DateInterval('PT' . self::EXPIRY_SECONDS . 'S'));
+        $cutoff = $now->sub(new \DateInterval('PT' . self::EXPIRY_SECONDS));
 
         $qb = $this->getEntityManager()->createQueryBuilder()

[NoCoverage] Concat
Domain/DonationRepository.php:357:9
      */
     public function findWithExpiredMatching(\DateTimeImmutable $now): array
     {
-        $cutoff = $now->sub(new \DateInterval('PT' . self::EXPIRY_SECONDS . 'S'));
+        $cutoff = $now->sub(new \DateInterval(self::EXPIRY_SECONDS . 'PT' . 'S'));
 
         $qb = $this->getEntityManager()->createQueryBuilder()

[Killed] PublicVisibility
Domain/DonationRepository.php:383:5
     /**
      * @return Donation[]
      */
-    public function findReadyToClaimGiftAid(bool $withResends): array
+    protected function findReadyToClaimGiftAid(bool $withResends) : array
     {
         if ($withResends && getenv('APP_ENV') === 'production') {
killedBy: MatchBot\Tests\Domain\DonationRepositoryTest::testFindReadyToClaimGiftAid
statusReason: 1) MatchBot\Tests\Domain\DonationRepositoryTest::testFindReadyToClaimGiftAid
BadMethodCallException: Undefined method "findReadyToClaimGiftAid". The method name must start with either findBy, findOneBy or countBy!

/home/barney/projects/matchbot/vendor/doctrine/orm/lib/Doctrine/ORM/EntityRepository.php:283
/home/barney/projects/matchbot/tests/Domain/DonationRepositoryTest.php:545

ERRORS!
Tests: 1

[Killed] LogicalAndSingleSubExprNegation
Domain/DonationRepository.php:385:9
      */
     public function findReadyToClaimGiftAid(bool $withResends): array
     {
-        if ($withResends && getenv('APP_ENV') === 'production') {
+        if (!$withResends && getenv('APP_ENV') === 'production') {
             throw new \LogicException('Cannot re-send live donations');
         }
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

......................                                            22 / 22 (100%)

Time: 00:00.064, Memory: 20.00 MB

OK (22 tests, 85 assertions)

[Killed] LogicalAndNegation
Domain/DonationRepository.php:385:9
      */
     public function findReadyToClaimGiftAid(bool $withResends): array
     {
-        if ($withResends && getenv('APP_ENV') === 'production') {
+        if (!($withResends && getenv('APP_ENV') === 'production')) {
             throw new \LogicException('Cannot re-send live donations');
         }
killedBy: MatchBot\Tests\Domain\DonationRepositoryTest::testFindReadyToClaimGiftAid
statusReason: 1) MatchBot\Tests\Domain\DonationRepositoryTest::testFindReadyToClaimGiftAid
LogicException: Cannot re-send live donations

/home/barney/projects/matchbot/src/Domain/DonationRepository.php:291
/home/barney/projects/matchbot/tests/Domain/DonationRepositoryTest.php:545

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[NoCoverage] Throw_
Domain/DonationRepository.php:386:13
     public function findReadyToClaimGiftAid(bool $withResends): array
     {
         if ($withResends && getenv('APP_ENV') === 'production') {
-            throw new \LogicException('Cannot re-send live donations');
+            new \LogicException('Cannot re-send live donations');
         }
 

[Killed] LogicalNot
Domain/DonationRepository.php:415:9
             ->setParameter('claimGiftAidWithStatus', DonationStatus::Paid->value)
             ->setParameter('claimGiftAidForDonationsBefore', $cutoff);
 
-        if (!$withResends) {
+        if ($withResends) {
             $qb = $qb->andWhere('d.tbgGiftAidRequestQueuedAt IS NULL');
         }
killedBy: MatchBot\Tests\Domain\DonationRepositoryTest::testFindReadyToClaimGiftAid
statusReason: 1) MatchBot\Tests\Domain\DonationRepositoryTest::testFindReadyToClaimGiftAid
Some predictions failed:
Double\Doctrine\ORM\QueryBuilder\P2:
  Expected exactly 6 calls that match:
      Double\Doctrine\ORM\QueryBuilder\P2->andWhere(type(string))
    but 5 were made:
      - andWhere("d.giftAid = TRUE") @ src/Domain/DonationRepository.php:302
      - andWhere("d.tbgShouldProcessGiftAid = TRUE") @ src

[NoCoverage] PublicVisibility
Domain/DonationRepository.php:425:5
     /**
      * @return Donation[]
      */
-    public function findNotFullyMatchedToCampaignsWhichClosedSince(DateTime $closedSinceDate): array
+    protected function findNotFullyMatchedToCampaignsWhichClosedSince(DateTime $closedSinceDate) : array
     {
         $now = (new DateTime('now'));

[NoCoverage] PublicVisibility
Domain/DonationRepository.php:453:5
     /**
      * @return Donation[]
      */
-    public function findRecentNotFullyMatchedToMatchCampaigns(DateTime $sinceDate): array
+    protected function findRecentNotFullyMatchedToMatchCampaigns(DateTime $sinceDate) : array
     {
         $qb = $this->getEntityManager()->createQueryBuilder()

[Killed] PublicVisibility
Domain/DonationRepository.php:481:5
      * @param string[]  $transferIds
      * @return Donation[]
      */
-    public function findWithTransferIdInArray(array $transferIds): array
+    protected function findWithTransferIdInArray(array $transferIds) : array
     {
         $qb = $this->getEntityManager()->createQueryBuilder()
killedBy: MatchBot\Tests\Domain\DonationRepositoryTest::testFindWithTransferIdInArray
statusReason: 1) MatchBot\Tests\Domain\DonationRepositoryTest::testFindWithTransferIdInArray
BadMethodCallException: Undefined method "findWithTransferIdInArray". The method name must start with either findBy, findOneBy or countBy!

/home/barney/projects/matchbot/vendor/doctrine/orm/lib/Doctrine/ORM/EntityRepository.php:283
/home/barney/projects/matchbot/tests/Domain/DonationRepositoryTest.php:587

ERRORS!
Test

[Killed] PublicVisibility
Domain/DonationRepository.php:499:5
      *
      * @return int  Number of donations updated to 'not-sent'.
      */
-    public function abandonOldCancelled(): int
+    protected function abandonOldCancelled() : int
     {
         $twentyMinsAgo = (new DateTime('now'))
killedBy: MatchBot\Tests\Domain\DonationRepositoryTest::testAbandonOldCancelled
statusReason: 1) MatchBot\Tests\Domain\DonationRepositoryTest::testAbandonOldCancelled
BadMethodCallException: Undefined method "abandonOldCancelled". The method name must start with either findBy, findOneBy or countBy!

/home/barney/projects/matchbot/vendor/doctrine/orm/lib/Doctrine/ORM/EntityRepository.php:283
/home/barney/projects/matchbot/tests/Domain/DonationRepositoryTest.php:487

ERRORS!
Tests: 1, Assert

[Killed] GreaterThan
Domain/DonationRepository.php:522:9
 
         /** @var Donation[] $donations */
         $donations = $qb->getQuery()->getResult();
-        if (count($donations) > 0) {
+        if (count($donations) >= 0) {
             foreach ($donations as $donation) {
                 $donation->setSalesforcePushStatus(SalesforceWriteProxy::PUSH_STATUS_NOT_SENT);
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

......................                                            22 / 22 (100%)

Time: 00:00.062, Memory: 20.00 MB

OK (22 tests, 85 assertions)

[Killed] GreaterThanNegotiation
Domain/DonationRepository.php:522:9
 
         /** @var Donation[] $donations */
         $donations = $qb->getQuery()->getResult();
-        if (count($donations) > 0) {
+        if (count($donations) <= 0) {
             foreach ($donations as $donation) {
                 $donation->setSalesforcePushStatus(SalesforceWriteProxy::PUSH_STATUS_NOT_SENT);
killedBy: MatchBot\Tests\Domain\DonationRepositoryTest::testAbandonOldCancelled
statusReason: 1) MatchBot\Tests\Domain\DonationRepositoryTest::testAbandonOldCancelled
Some predictions failed:
Double\EntityManagerInterface\P5:
  Expected exactly 1 calls that match:
      Double\EntityManagerInterface\P5->persist(type(MatchBot\Domain\Donation))
    but none were made.
  Expected exactly 1 calls that match:
      Double\EntityManagerInterface\P5->flush()

[Killed] Foreach_
Domain/DonationRepository.php:523:13
         /** @var Donation[] $donations */
         $donations = $qb->getQuery()->getResult();
         if (count($donations) > 0) {
-            foreach ($donations as $donation) {
-                $donation->setSalesforcePushStatus(SalesforceWriteProxy::PUSH_STATUS_NOT_SENT);
-                $this->getEntityManager()->persist($donation);
-            }
+            foreach (array() as $donation) {
 
             $this->getEntityManager()->flush();
killedBy: MatchBot\Tests\Domain\DonationRepositoryTest::testAbandonOldCancelled
statusReason: 1) MatchBot\Tests\Domain\DonationRepositoryTest::testAbandonOldCancelled
Some predictions failed:
Double\EntityManagerInterface\P5:
  Expected exactly 1 calls that match:
      Double\EntityManagerInterface\P5->persist(type(MatchBot\Domain\Donation))
    but none were made.

/home/barney/projects/matchbot/vendor/phpspec/prophecy-phpunit/src/ProphecyTrait.php:61

[Killed] MethodCallRemoval
Domain/DonationRepository.php:524:17
         $donations = $qb->getQuery()->getResult();
         if (count($donations) > 0) {
             foreach ($donations as $donation) {
-                $donation->setSalesforcePushStatus(SalesforceWriteProxy::PUSH_STATUS_NOT_SENT);
+                
                 $this->getEntityManager()->persist($donation);
             }
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

......................                                            22 / 22 (100%)

Time: 00:00.063, Memory: 20.00 MB

OK (22 tests, 85 assertions)
