[Killed] MethodCallRemoval
Domain/DonorAccount.php:49:9
 
     public function __construct(EmailAddress $emailAddress, DonorName $donorName, StripeCustomerId $stripeCustomerId)
     {
-        $this->createdNow();
+        
         $this->emailAddress = $emailAddress;
         $this->stripeCustomerId = $stripeCustomerId;
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

.                                                                   1 / 1 (100%)

Time: 00:00.014, Memory: 12.00 MB

OK (1 test, 1 assertion)
