[NoCoverage] PublicVisibility
Domain/DonorAccountRepository.php:16:5
     /**
      * @throws UniqueConstraintViolationException if we already have a donor account with the same Stripe Customer ID.
      */
-    public function save(DonorAccount $donorAccount): void
+    protected function save(DonorAccount $donorAccount) : void
     {
         $this->getEntityManager()->persist($donorAccount);

[NoCoverage] MethodCallRemoval
Domain/DonorAccountRepository.php:18:9
      */
     public function save(DonorAccount $donorAccount): void
     {
-        $this->getEntityManager()->persist($donorAccount);
+        
         $this->getEntityManager()->flush();
     }

[NoCoverage] MethodCallRemoval
Domain/DonorAccountRepository.php:19:9
     public function save(DonorAccount $donorAccount): void
     {
         $this->getEntityManager()->persist($donorAccount);
-        $this->getEntityManager()->flush();
+        
     }
 

[NoCoverage] PublicVisibility
Domain/DonorAccountRepository.php:22:5
         $this->getEntityManager()->flush();
     }
 
-    public function findByStripeIdOrNull(StripeCustomerId $stripeAccountId): ?DonorAccount
+    protected function findByStripeIdOrNull(StripeCustomerId $stripeAccountId) : ?DonorAccount
     {
         // see https://github.com/laravel-doctrine/fluent/issues/51 for using findOneBy on a field of an embeddable.
