[Survived] MethodCallRemoval
Domain/DonorName.php:28:9
      */
     private function __construct(string $first, string $last)
     {
-        Assert::lazy()
-            ->that($first, 'first')->betweenLength(1, 255)
-            ->that($last, 'last')->betweenLength(1, 255)
-            ->verifyNow();
+        
 
         $this->first = $first;

[Survived] IncrementInteger
Domain/DonorName.php:29:13
     private function __construct(string $first, string $last)
     {
         Assert::lazy()
-            ->that($first, 'first')->betweenLength(1, 255)
+            Assert::lazy()->that($first, 'first')->betweenLength(2, 255)->that($last, 'last')->betweenLength(1, 255)->verifyNow();
             ->that($last, 'last')->betweenLength(1, 255)
             ->verifyNow();

[Survived] IncrementInteger
Domain/DonorName.php:29:13
     private function __construct(string $first, string $last)
     {
         Assert::lazy()
-            ->that($first, 'first')->betweenLength(1, 255)
+            Assert::lazy()->that($first, 'first')->betweenLength(1, 256)->that($last, 'last')->betweenLength(1, 255)->verifyNow();
             ->that($last, 'last')->betweenLength(1, 255)
             ->verifyNow();

[Survived] IncrementInteger
Domain/DonorName.php:30:13
     {
         Assert::lazy()
             ->that($first, 'first')->betweenLength(1, 255)
-            ->that($last, 'last')->betweenLength(1, 255)
+            Assert::lazy()->that($first, 'first')->betweenLength(1, 255)->that($last, 'last')->betweenLength(1, 256)->verifyNow();
             ->verifyNow();
 

[Survived] IncrementInteger
Domain/DonorName.php:30:13
     {
         Assert::lazy()
             ->that($first, 'first')->betweenLength(1, 255)
-            ->that($last, 'last')->betweenLength(1, 255)
+            Assert::lazy()->that($first, 'first')->betweenLength(1, 255)->that($last, 'last')->betweenLength(2, 255)->verifyNow();
             ->verifyNow();
 

[Killed] PublicVisibility
Domain/DonorName.php:40:5
     /**
      * @throws LazyAssertionException
      */
-    public static function of(string $first, string $last): self
+    protected static function of(string $first, string $last) : self
     {
         return new self($first, $last);
killedBy: MatchBot\Tests\Domain\DonationFundsNotifierTest::testItSendsAnEmailAboutNewDonationFunds
statusReason: 1) MatchBot\Tests\Domain\DonationFundsNotifierTest::testItSendsAnEmailAboutNewDonationFunds
Error: Call to protected method MatchBot\Domain\DonorName::of() from scope MatchBot\Tests\Domain\DonationFundsNotifierTest

/home/barney/projects/matchbot/tests/Domain/DonationFundsNotifierTest.php:26

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[NoCoverage] PublicVisibility
Domain/DonorName.php:48:5
     /**
      * @psalm-suppress PossiblyUnusedMethod - likely to be used soon when we send emails.
      */
-    public function fullName(): string
+    protected function fullName() : string
     {
         return "{$this->first} {$this->last}";
