[Survived] MethodCallRemoval
Domain/EmailAddress.php:26:9
         string $value
     ) {
         $this->email = $value;
-        Assertion::email($this->email);
+        
     }
 

[Killed] PublicVisibility
Domain/EmailAddress.php:33:5
      * @param string $emailAddress - must be a valid email address.
      * @throws AssertionFailedException
      */
-    public static function of(string $emailAddress): self
+    protected static function of(string $emailAddress) : self
     {
         return new self($emailAddress);
killedBy: MatchBot\Tests\Domain\DonationFundsNotifierTest::testItSendsAnEmailAboutNewDonationFunds
statusReason: 1) MatchBot\Tests\Domain\DonationFundsNotifierTest::testItSendsAnEmailAboutNewDonationFunds
Error: Call to protected method MatchBot\Domain\EmailAddress::of() from scope MatchBot\Tests\Domain\DonationFundsNotifierTest

/home/barney/projects/matchbot/tests/Domain/DonationFundsNotifierTest.php:25

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.
