[Killed] PublicVisibility
Domain/FundRepository.php:21:5
     private CampaignFundingRepository $campaignFundingRepository;
     private Matching\Adapter $matchingAdapter;
 
-    public function setCampaignFundingRepository(CampaignFundingRepository $repository): void
+    protected function setCampaignFundingRepository(CampaignFundingRepository $repository) : void
     {
         $this->campaignFundingRepository = $repository;
killedBy: MatchBot\Tests\Domain\FundRepositoryTest::testPullForCampaignAllNew
statusReason: 1) MatchBot\Tests\Domain\FundRepositoryTest::testPullForCampaignAllNew
BadMethodCallException: Undefined method "setCampaignFundingRepository". The method name must start with either findBy, findOneBy or countBy!

/home/barney/projects/matchbot/vendor/doctrine/orm/lib/Doctrine/ORM/EntityRepository.php:283
/home/barney/projects/matchbot/tests/Domain/FundRepositoryTest.php:358
/home/barney/projects/

[Killed] PublicVisibility
Domain/FundRepository.php:29:5
     /**
      * @param Matching\Adapter $matchingAdapter
      */
-    public function setMatchingAdapter(Matching\Adapter $matchingAdapter): void
+    protected function setMatchingAdapter(Matching\Adapter $matchingAdapter) : void
     {
         $this->matchingAdapter = $matchingAdapter;
killedBy: MatchBot\Tests\Domain\FundRepositoryTest::testPullForCampaignAllNew
statusReason: 1) MatchBot\Tests\Domain\FundRepositoryTest::testPullForCampaignAllNew
BadMethodCallException: Undefined method "setMatchingAdapter". The method name must start with either findBy, findOneBy or countBy!

/home/barney/projects/matchbot/vendor/doctrine/orm/lib/Doctrine/ORM/EntityRepository.php:283
/home/barney/projects/matchbot/tests/Domain/FundRepositoryTest.php:361
/home/barney/projects/matchbot/t

[Killed] PublicVisibility
Domain/FundRepository.php:38:5
      * @param Campaign  $campaign
      * @throws Client\NotFoundException if Campaign not found on Salesforce
      */
-    public function pullForCampaign(Campaign $campaign): void
+    protected function pullForCampaign(Campaign $campaign) : void
     {
         $client = $this->getClient();
killedBy: MatchBot\Tests\Domain\FundRepositoryTest::testPullForCampaignAllNew
statusReason: 1) MatchBot\Tests\Domain\FundRepositoryTest::testPullForCampaignAllNew
BadMethodCallException: Undefined method "pullForCampaign". The method name must start with either findBy, findOneBy or countBy!

/home/barney/projects/matchbot/vendor/doctrine/orm/lib/Doctrine/ORM/EntityRepository.php:283
/home/barney/projects/matchbot/tests/Domain/FundRepositoryTest.php:97

ERRORS!
Tests: 1, Assertions: 0, Er

[Killed] LogicalNot
Domain/FundRepository.php:46:13
             // For each fund linked to the campaign, look it up or create it if unknown
             /** @var Fund $fund */
             $fund = $this->findOneBy(['salesforceId' => $fundData['id']]);
-            if (!$fund) {
+            if ($fund) {
                 $fund = $this->getNewFund($fundData);
             }
killedBy: MatchBot\Tests\Domain\FundRepositoryTest::testPullForCampaignAllNew
statusReason: 1) MatchBot\Tests\Domain\FundRepositoryTest::testPullForCampaignAllNew
TypeError: MatchBot\Domain\FundRepository::setAnyFundData(): Argument #1 ($fund) must be of type MatchBot\Domain\Fund, null given, called in /home/barney/projects/matchbot/src/Domain/FundRepository.php on line 46

/home/barney/projects/matchbot/src/Domain/FundRepository.php:113
/home/barney/projects/matchbot/src/Domain/FundRepo

[Killed] MethodCallRemoval
Domain/FundRepository.php:52:17
 
             // Then whether new or existing, set its key info
             try {
-                $this->setAnyFundData($fund, $fundData);
+                
             } catch (DomainCurrencyMustNotChangeException $exception) {
                 return; // No-op w.r.t matching if fund currency changed unexpectedly.
killedBy: MatchBot\Tests\Domain\FundRepositoryTest::testPullForCampaignAllNew
statusReason: 1) MatchBot\Tests\Domain\FundRepositoryTest::testPullForCampaignAllNew
Error: Typed property MatchBot\Domain\Fund::$amount must not be accessed before initialization

/home/barney/projects/matchbot/src/Domain/Fund.php:69
/home/barney/projects/matchbot/vendor/phpspec/prophecy/src/Prophecy/Argument/Token/ObjectStateToken.php:61
/home/barney/projects/matchbot/vendor/phpspec/prophecy/src/Prophecy/Argu

[Killed] MethodCallRemoval
Domain/FundRepository.php:58:17
             }
 
             try {
-                $this->getEntityManager()->persist($fund);
+                
                 $this->getEntityManager()->flush(); // Need the fund ID for the CampaignFunding find
             } catch (UniqueConstraintViolationException $exception) {
killedBy: MatchBot\Tests\Domain\FundRepositoryTest::testPullForCampaignAllNew
statusReason: 1) MatchBot\Tests\Domain\FundRepositoryTest::testPullForCampaignAllNew
Some predictions failed:
Double\EntityManagerInterface\P1:
  Expected exactly 2 calls that match:
      Double\EntityManagerInterface\P1->persist(type(MatchBot\Domain\ChampionFund))
    but none were made.
    Recorded `persist(...)` calls:
      - persist(MatchBot\Domain\CampaignFunding#167 Object (

[Killed] MethodCallRemoval
Domain/FundRepository.php:59:17
 
             try {
                 $this->getEntityManager()->persist($fund);
-                $this->getEntityManager()->flush(); // Need the fund ID for the CampaignFunding find
+                 // Need the fund ID for the CampaignFunding find
             } catch (UniqueConstraintViolationException $exception) {
                 // Somebody else made the fund with this SF ID during the previous operations.
killedBy: MatchBot\Tests\Domain\FundRepositoryTest::testPullForCampaignAllNew
statusReason: 1) MatchBot\Tests\Domain\FundRepositoryTest::testPullForCampaignAllNew
Some predictions failed:
Double\EntityManagerInterface\P1:
  Expected exactly 4 calls that match:
      Double\EntityManagerInterface\P1->flush()
    but 2 were made:
      - flush() @ src/Domain/FundRepository.php:106
      - flush() @ src/Domain/FundRepository.php:106

[NoCoverage] ConcatOperandRemoval
Domain/FundRepository.php:62:17
                 $this->getEntityManager()->flush(); // Need the fund ID for the CampaignFunding find
             } catch (UniqueConstraintViolationException $exception) {
                 // Somebody else made the fund with this SF ID during the previous operations.
-                $this->logError('Skipping fund create as unique constraint failed on SF ID ' . $fundData['id']);
+                $this->logError('Skipping fund create as unique constraint failed on SF ID ');
 
                 $fund = $this->findOneBy(['salesforceId' => $fundData['id']]);

[NoCoverage] Concat
Domain/FundRepository.php:62:17
                 $this->getEntityManager()->flush(); // Need the fund ID for the CampaignFunding find
             } catch (UniqueConstraintViolationException $exception) {
                 // Somebody else made the fund with this SF ID during the previous operations.
-                $this->logError('Skipping fund create as unique constraint failed on SF ID ' . $fundData['id']);
+                $this->logError($fundData['id'] . 'Skipping fund create as unique constraint failed on SF ID ');
 
                 $fund = $this->findOneBy(['salesforceId' => $fundData['id']]);

[NoCoverage] MethodCallRemoval
Domain/FundRepository.php:66:17
 
                 $fund = $this->findOneBy(['salesforceId' => $fundData['id']]);
                 $fund = $this->setAnyFundData($fund, $fundData);
-                $this->getEntityManager()->persist($fund);
+                
             }
 

[Killed] IfNegation
Domain/FundRepository.php:72:13
             // If there's already a CampaignFunding for this fund, use that regardless of existing campaigns
             // iff the fund is shareable. Otherwise look up only fundings for this campaign. In both cases,
             // if the funding is new the lookup result is null and we must make a new funding.
-            if ($fundData['isShared']) {
-                $campaignFunding = $this->campaignFundingRepository->getFunding($fund);
-            } else {
-                $campaignFunding = $this->campaignFundingRepository->getFundingForCampaign($campaign, $fund);
-            }
+            if (!$fundData['isShared']) {
 
             // We must now support funds' totals changing over time, even after a campaign opens. This must play
killedBy: MatchBot\Tests\Domain\FundRepositoryTest::testPullForCampaignAllExistingWithBalanceUpdated
statusReason: 1) MatchBot\Tests\Domain\FundRepositoryTest::testPullForCampaignAllExistingWithBalanceUpdated
Prophecy\Exception\Call\UnexpectedCallException: Unexpected method call on Double\MatchBot\Domain\CampaignFundingRepository\P2:
  - getFunding(
        MatchBot\Domain\ChampionFund#201 Object (
            'id' => 123123
            'salesforceId' => 'sfFundId123'
            'salesforceLastPull' => DateT

[Killed] Ternary
Domain/FundRepository.php:81:13
             // We must now support funds' totals changing over time, even after a campaign opens. This must play
             // well with high volume real-time adapters, so we must first check for a likely change and then push the
             // change to the matching adapter when needed.
-            $amountForCampaign = $fundData['amountForCampaign'] === null
-                ? '0.00'
-                : (string) $fundData['amountForCampaign'];
+            $amountForCampaign = $fundData['amountForCampaign'] === null ? (string) $fundData['amountForCampaign'] : '0.00';
 
             if ($campaignFunding) {
killedBy: MatchBot\Tests\Domain\FundRepositoryTest::testPullForCampaignAllNew
statusReason: 1) MatchBot\Tests\Domain\FundRepositoryTest::testPullForCampaignAllNew
Some predictions failed:
Double\EntityManagerInterface\P1:
  Expected exactly 2 calls that match:
      Double\EntityManagerInterface\P1->persist(state(getAmount(), "500"))
    but 1 were made:
      - persist(MatchBot\Domain\ChampionFund#139 Object (
        'id' => null

[Killed] Identical
Domain/FundRepository.php:81:13
             // We must now support funds' totals changing over time, even after a campaign opens. This must play
             // well with high volume real-time adapters, so we must first check for a likely change and then push the
             // change to the matching adapter when needed.
-            $amountForCampaign = $fundData['amountForCampaign'] === null
+            $amountForCampaign = $fundData['amountForCampaign'] !== null ? '0.00' : (string) $fundData['amountForCampaign'];
                 ? '0.00'
                 : (string) $fundData['amountForCampaign'];
killedBy: MatchBot\Tests\Domain\FundRepositoryTest::testPullForCampaignAllNew
statusReason: 1) MatchBot\Tests\Domain\FundRepositoryTest::testPullForCampaignAllNew
Some predictions failed:
Double\EntityManagerInterface\P1:
  Expected exactly 2 calls that match:
      Double\EntityManagerInterface\P1->persist(state(getAmount(), "500"))
    but 1 were made:
      - persist(MatchBot\Domain\ChampionFund#139 Object (
        'id' => null

[Killed] CastString
Domain/FundRepository.php:83:17
             // change to the matching adapter when needed.
             $amountForCampaign = $fundData['amountForCampaign'] === null
                 ? '0.00'
-                : (string) $fundData['amountForCampaign'];
+                $amountForCampaign = $fundData['amountForCampaign'] === null ? '0.00' : $fundData['amountForCampaign'];
 
             if ($campaignFunding) {
killedBy: MatchBot\Tests\Domain\FundRepositoryTest::testPullForCampaignAllNew
statusReason: 1) MatchBot\Tests\Domain\FundRepositoryTest::testPullForCampaignAllNew
TypeError: MatchBot\Domain\CampaignFunding::setAmountAvailable(): Argument #1 ($amountAvailable) must be of type string, int given, called in /home/barney/projects/matchbot/src/Domain/FundRepository.php on line 93

/home/barney/projects/matchbot/src/Domain/CampaignFunding.php:113
/home/barney/projects/matchbot/src/Domain/FundRe

[Killed] IncrementInteger
Domain/FundRepository.php:89:17
                 // Existing funding -> check for balance increase and apply any in a high-volume-safe way.
                 // Note that a balance DECREASE on the API side is unsupported and would be ignored, as this
                 // risks invalidating in-progress donation matches.
-                $increaseInAmount = bcsub($amountForCampaign, $campaignFunding->getAmount(), 2);
+                $increaseInAmount = bcsub($amountForCampaign, $campaignFunding->getAmount(), 3);
 
                 if (bccomp($increaseInAmount, '0.00', 2) === 1) {
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

.....                                                               5 / 5 (100%)

Time: 00:00.031, Memory: 14.00 MB

OK (5 tests, 30 assertions)

[Killed] DecrementInteger
Domain/FundRepository.php:89:17
                 // Existing funding -> check for balance increase and apply any in a high-volume-safe way.
                 // Note that a balance DECREASE on the API side is unsupported and would be ignored, as this
                 // risks invalidating in-progress donation matches.
-                $increaseInAmount = bcsub($amountForCampaign, $campaignFunding->getAmount(), 2);
+                $increaseInAmount = bcsub($amountForCampaign, $campaignFunding->getAmount(), 1);
 
                 if (bccomp($increaseInAmount, '0.00', 2) === 1) {
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

.....                                                               5 / 5 (100%)

Time: 00:00.032, Memory: 14.00 MB

OK (5 tests, 30 assertions)

[Killed] IncrementInteger
Domain/FundRepository.php:91:17
                 // risks invalidating in-progress donation matches.
                 $increaseInAmount = bcsub($amountForCampaign, $campaignFunding->getAmount(), 2);
 
-                if (bccomp($increaseInAmount, '0.00', 2) === 1) {
+                if (bccomp($increaseInAmount, '0.00', 2) === 2) {
                     $newTotal = $this->matchingAdapter->runTransactionally(
                         function () use ($campaignFunding, $increaseInAmount) {
killedBy: MatchBot\Tests\Domain\FundRepositoryTest::testPullForCampaignAllExistingWithBalanceUpdated
statusReason: 1) MatchBot\Tests\Domain\FundRepositoryTest::testPullForCampaignAllExistingWithBalanceUpdated
Some predictions failed:
Double\EntityManagerInterface\P1:
  Expected exactly 2 calls that match:
      Double\EntityManagerInterface\P1->persist(state(getAmount(), "500"))
    but 1 were made:
      - persist(MatchBot\Domain\ChampionFund#201 Object (
        'id' => 123123

[Killed] DecrementInteger
Domain/FundRepository.php:91:17
                 // risks invalidating in-progress donation matches.
                 $increaseInAmount = bcsub($amountForCampaign, $campaignFunding->getAmount(), 2);
 
-                if (bccomp($increaseInAmount, '0.00', 2) === 1) {
+                if (bccomp($increaseInAmount, '0.00', 1) === 1) {
                     $newTotal = $this->matchingAdapter->runTransactionally(
                         function () use ($campaignFunding, $increaseInAmount) {
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

.....                                                               5 / 5 (100%)

Time: 00:00.031, Memory: 14.00 MB

OK (5 tests, 30 assertions)

[Killed] MethodCallRemoval
Domain/FundRepository.php:99:21
                         }
                     );
 
-                    $this->logger->info(
-                        "Funding ID {$campaignFunding->getId()} balance increased " .
-                        "£{$increaseInAmount} to £{$newTotal}"
-                    );
+                    
 
                     $campaignFunding->setAmount($amountForCampaign);
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

.....                                                               5 / 5 (100%)

Time: 00:00.030, Memory: 14.00 MB

OK (5 tests, 30 assertions)

[Killed] ConcatOperandRemoval
Domain/FundRepository.php:100:25
                     );
 
                     $this->logger->info(
-                        "Funding ID {$campaignFunding->getId()} balance increased " .
-                        "£{$increaseInAmount} to £{$newTotal}"
+                        $this->logger->info("£{$increaseInAmount} to £{$newTotal}");
                     );
 
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

.....                                                               5 / 5 (100%)

Time: 00:00.030, Memory: 14.00 MB

OK (5 tests, 30 assertions)

[Killed] Concat
Domain/FundRepository.php:100:25
                     );
 
                     $this->logger->info(
-                        "Funding ID {$campaignFunding->getId()} balance increased " .
-                        "£{$increaseInAmount} to £{$newTotal}"
+                        $this->logger->info("£{$increaseInAmount} to £{$newTotal}" . "Funding ID {$campaignFunding->getId()} balance increased ");
                     );
 
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

.....                                                               5 / 5 (100%)

Time: 00:00.030, Memory: 14.00 MB

OK (5 tests, 30 assertions)

[Killed] MethodCallRemoval
Domain/FundRepository.php:104:21
                         "£{$increaseInAmount} to £{$newTotal}"
                     );
 
-                    $campaignFunding->setAmount($amountForCampaign);
+                    
                 }
             } else {
killedBy: MatchBot\Tests\Domain\FundRepositoryTest::testPullForCampaignAllExistingWithBalanceUpdated
statusReason: 1) MatchBot\Tests\Domain\FundRepositoryTest::testPullForCampaignAllExistingWithBalanceUpdated
Some predictions failed:
Double\EntityManagerInterface\P1:
  Expected exactly 2 calls that match:
      Double\EntityManagerInterface\P1->persist(state(getAmount(), "500"))
    but 1 were made:
      - persist(MatchBot\Domain\ChampionFund#201 Object (
        'id' => 123123

[Killed] MethodCallRemoval
Domain/FundRepository.php:109:17
             } else {
                 // Not a previously existing campaign -> create one and set balances without checking for existing ones.
                 $campaignFunding = new CampaignFunding();
-                $campaignFunding->createdNow();
+                
                 $campaignFunding->setFund($fund);
                 $campaignFunding->setCurrencyCode($fund->getCurrencyCode());
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

.....                                                               5 / 5 (100%)

Time: 00:00.031, Memory: 14.00 MB

OK (5 tests, 30 assertions)

[Killed] MethodCallRemoval
Domain/FundRepository.php:110:17
                 // Not a previously existing campaign -> create one and set balances without checking for existing ones.
                 $campaignFunding = new CampaignFunding();
                 $campaignFunding->createdNow();
-                $campaignFunding->setFund($fund);
+                
                 $campaignFunding->setCurrencyCode($fund->getCurrencyCode());
                 $campaignFunding->setAmountAvailable($amountForCampaign);
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

.....                                                               5 / 5 (100%)

Time: 00:00.030, Memory: 14.00 MB

OK (5 tests, 30 assertions)

[Killed] MethodCallRemoval
Domain/FundRepository.php:111:17
                 $campaignFunding = new CampaignFunding();
                 $campaignFunding->createdNow();
                 $campaignFunding->setFund($fund);
-                $campaignFunding->setCurrencyCode($fund->getCurrencyCode());
+                
                 $campaignFunding->setAmountAvailable($amountForCampaign);
                 $campaignFunding->setAmount($amountForCampaign);
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

.....                                                               5 / 5 (100%)

Time: 00:00.030, Memory: 14.00 MB

OK (5 tests, 30 assertions)

[Killed] MethodCallRemoval
Domain/FundRepository.php:112:17
                 $campaignFunding->createdNow();
                 $campaignFunding->setFund($fund);
                 $campaignFunding->setCurrencyCode($fund->getCurrencyCode());
-                $campaignFunding->setAmountAvailable($amountForCampaign);
+                
                 $campaignFunding->setAmount($amountForCampaign);
             }
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

.....                                                               5 / 5 (100%)

Time: 00:00.031, Memory: 14.00 MB

OK (5 tests, 30 assertions)

[Killed] MethodCallRemoval
Domain/FundRepository.php:113:17
                 $campaignFunding->setFund($fund);
                 $campaignFunding->setCurrencyCode($fund->getCurrencyCode());
                 $campaignFunding->setAmountAvailable($amountForCampaign);
-                $campaignFunding->setAmount($amountForCampaign);
+                
             }
 
killedBy: MatchBot\Tests\Domain\FundRepositoryTest::testPullForCampaignAllNew
statusReason: 1) MatchBot\Tests\Domain\FundRepositoryTest::testPullForCampaignAllNew
Error: Typed property MatchBot\Domain\CampaignFunding::$amount must not be accessed before initialization

/home/barney/projects/matchbot/src/Domain/CampaignFunding.php:91
/home/barney/projects/matchbot/vendor/phpspec/prophecy/src/Prophecy/Argument/Token/ObjectStateToken.php:61
/home/barney/projects/matchbot/vendor/phpspec/prop

[Killed] InstanceOf_
Domain/FundRepository.php:116:13
                 $campaignFunding->setAmount($amountForCampaign);
             }
 
-            if ($fund instanceof Pledge) {
+            if (true) {
                 $campaignFunding->setAllocationOrder(100);
             } else {
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

.....                                                               5 / 5 (100%)

Time: 00:00.032, Memory: 14.00 MB

OK (5 tests, 30 assertions)

[Killed] InstanceOf_
Domain/FundRepository.php:116:13
                 $campaignFunding->setAmount($amountForCampaign);
             }
 
-            if ($fund instanceof Pledge) {
+            if (false) {
                 $campaignFunding->setAllocationOrder(100);
             } else {
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

.....                                                               5 / 5 (100%)

Time: 00:00.031, Memory: 14.00 MB

OK (5 tests, 30 assertions)

[NoCoverage] MethodCallRemoval
Domain/FundRepository.php:117:17
             }
 
             if ($fund instanceof Pledge) {
-                $campaignFunding->setAllocationOrder(100);
+                
             } else {
                 $campaignFunding->setAllocationOrder(200);

[NoCoverage] DecrementInteger
Domain/FundRepository.php:117:17
             }
 
             if ($fund instanceof Pledge) {
-                $campaignFunding->setAllocationOrder(100);
+                $campaignFunding->setAllocationOrder(99);
             } else {
                 $campaignFunding->setAllocationOrder(200);

[Killed] MethodCallRemoval
Domain/FundRepository.php:119:17
             if ($fund instanceof Pledge) {
                 $campaignFunding->setAllocationOrder(100);
             } else {
-                $campaignFunding->setAllocationOrder(200);
+                
             }
 
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

.....                                                               5 / 5 (100%)

Time: 00:00.030, Memory: 14.00 MB

OK (5 tests, 30 assertions)

[Killed] IncrementInteger
Domain/FundRepository.php:119:17
             if ($fund instanceof Pledge) {
                 $campaignFunding->setAllocationOrder(100);
             } else {
-                $campaignFunding->setAllocationOrder(200);
+                $campaignFunding->setAllocationOrder(201);
             }
 
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

.....                                                               5 / 5 (100%)

Time: 00:00.031, Memory: 14.00 MB

OK (5 tests, 30 assertions)

[Killed] MethodCallRemoval
Domain/FundRepository.php:124:13
 
             // Make the CampaignFunding available to the Campaign. This method is immutable and won't add duplicates
             // if a campaign is already among those linked to the CampaignFunding.
-            $campaignFunding->addCampaign($campaign);
+            
 
             try {
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

.....                                                               5 / 5 (100%)

Time: 00:00.030, Memory: 14.00 MB

OK (5 tests, 30 assertions)

[Killed] MethodCallRemoval
Domain/FundRepository.php:127:17
             $campaignFunding->addCampaign($campaign);
 
             try {
-                $this->getEntityManager()->persist($campaignFunding);
+                
                 $this->getEntityManager()->flush();
             } catch (UniqueConstraintViolationException $exception) {
killedBy: MatchBot\Tests\Domain\FundRepositoryTest::testPullForCampaignAllNew
statusReason: 1) MatchBot\Tests\Domain\FundRepositoryTest::testPullForCampaignAllNew
Some predictions failed:
Double\EntityManagerInterface\P1:
  Expected exactly 2 calls that match:
      Double\EntityManagerInterface\P1->persist(type(MatchBot\Domain\CampaignFunding))
    but none were made.
    Recorded `persist(...)` calls:
      - persist(MatchBot\Domain\ChampionFund#139 Object (

[Killed] MethodCallRemoval
Domain/FundRepository.php:128:17
 
             try {
                 $this->getEntityManager()->persist($campaignFunding);
-                $this->getEntityManager()->flush();
+                
             } catch (UniqueConstraintViolationException $exception) {
                 // Somebody else created the specific funding -> proceed without modifying it.
killedBy: MatchBot\Tests\Domain\FundRepositoryTest::testPullForCampaignAllNew
statusReason: 1) MatchBot\Tests\Domain\FundRepositoryTest::testPullForCampaignAllNew
Some predictions failed:
Double\EntityManagerInterface\P1:
  Expected exactly 4 calls that match:
      Double\EntityManagerInterface\P1->flush()
    but 2 were made:
      - flush() @ src/Domain/FundRepository.php:53
      - flush() @ src/Domain/FundRepository.php:53

[NoCoverage] MethodCallRemoval
Domain/FundRepository.php:131:17
                 $this->getEntityManager()->flush();
             } catch (UniqueConstraintViolationException $exception) {
                 // Somebody else created the specific funding -> proceed without modifying it.
-                $this->logError(
-                    'Skipping campaign funding create as constraint failed with campaign ' .
-                    $campaign->getId() . ', fund ' . $fund->getId()
-                );
+                
             }
         }

[NoCoverage] ConcatOperandRemoval
Domain/FundRepository.php:132:21
             } catch (UniqueConstraintViolationException $exception) {
                 // Somebody else created the specific funding -> proceed without modifying it.
                 $this->logError(
-                    'Skipping campaign funding create as constraint failed with campaign ' .
-                    $campaign->getId() . ', fund ' . $fund->getId()
+                    $this->logError('Skipping campaign funding create as constraint failed with campaign ' . ', fund ' . $fund->getId());
                 );
             }

[NoCoverage] Concat
Domain/FundRepository.php:132:21
             } catch (UniqueConstraintViolationException $exception) {
                 // Somebody else created the specific funding -> proceed without modifying it.
                 $this->logError(
-                    'Skipping campaign funding create as constraint failed with campaign ' .
-                    $campaign->getId() . ', fund ' . $fund->getId()
+                    $this->logError('Skipping campaign funding create as constraint failed with campaign ' . $campaign->getId() . $fund->getId() . ', fund ');
                 );
             }

[Killed] ProtectedVisibility
Domain/FundRepository.php:139:5
         }
     }
 
-    protected function setAnyFundData(Fund $fund, array $fundData): Fund
+    private function setAnyFundData(Fund $fund, array $fundData) : Fund
     {
         if ($fund->hasBeenPersisted() && $fund->getCurrencyCode() !== $fundData['currencyCode']) {
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

.....                                                               5 / 5 (100%)

Time: 00:00.031, Memory: 14.00 MB

OK (5 tests, 30 assertions)

[Killed] LogicalAnd
Domain/FundRepository.php:141:9
 
     protected function setAnyFundData(Fund $fund, array $fundData): Fund
     {
-        if ($fund->hasBeenPersisted() && $fund->getCurrencyCode() !== $fundData['currencyCode']) {
+        if ($fund->hasBeenPersisted() || $fund->getCurrencyCode() !== $fundData['currencyCode']) {
             $this->logWarning(sprintf(
                 'Refusing to update fund currency to %s for SF ID %s',
killedBy: MatchBot\Tests\Domain\FundRepositoryTest::testPullForCampaignAllNew
statusReason: 1) MatchBot\Tests\Domain\FundRepositoryTest::testPullForCampaignAllNew
Error: Typed property MatchBot\Domain\Fund::$currencyCode must not be accessed before initialization

/home/barney/projects/matchbot/src/Domain/Fund.php:79
/home/barney/projects/matchbot/src/Domain/FundRepository.php:115
/home/barney/projects/matchbot/src/Domain/FundRepository.php:46
/home/barney/projects/matchbot/tests/Domain/
