[Killed] PublicVisibility
Domain/FundingWithdrawal.php:39:5
     /**
      * @param Donation $donation
      */
-    public function setDonation(Donation $donation): void
+    protected function setDonation(Donation $donation) : void
     {
         $this->donation = $donation;
killedBy: MatchBot\Tests\Application\Actions\Donations\CreateTest::testSuccessWithStripeAccountIDMissingInitiallyButFoundOnRefetch
statusReason: 1) MatchBot\Tests\Application\Actions\Donations\CreateTest::testSuccessWithStripeAccountIDMissingInitiallyButFoundOnRefetch
Error: Call to protected method MatchBot\Domain\FundingWithdrawal::setDonation() from scope MatchBot\Tests\Application\Actions\Donations\CreateTest

/home/barney/projects/matchbot/tests/Application/Actions/Donations/CreateTest.php:280

ERRORS!
Tests: 1, Assertions: 0, Errors:

[NoCoverage] PublicVisibility
Domain/FundingWithdrawal.php:63:5
     /**
      * @param CampaignFunding $campaignFunding
      */
-    public function setCampaignFunding(CampaignFunding $campaignFunding): void
+    protected function setCampaignFunding(CampaignFunding $campaignFunding) : void
     {
         $this->campaignFunding = $campaignFunding;

[NoCoverage] PublicVisibility
Domain/FundingWithdrawal.php:68:5
         $this->campaignFunding = $campaignFunding;
     }
 
-    public function getCampaignFunding(): ?CampaignFunding
+    protected function getCampaignFunding() : ?CampaignFunding
     {
         return $this->campaignFunding;
