[Killed] PublicVisibility
Domain/Model.php:22:5
     /**
      * @return int|null
      */
-    public function getId(): ?int
+    protected function getId() : ?int
     {
         return $this->id;
killedBy: MatchBot\Tests\Domain\FundRepositoryTest::testPullForCampaignAllExistingWithBalanceUpdated
statusReason: 1) MatchBot\Tests\Domain\FundRepositoryTest::testPullForCampaignAllExistingWithBalanceUpdated
Error: Call to protected method MatchBot\Domain\Model::getId() from scope MatchBot\Domain\FundRepository

/home/barney/projects/matchbot/src/Domain/FundRepository.php:100
/home/barney/projects/matchbot/tests/Domain/FundRepositoryTest.php:208

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] PublicVisibility
Domain/Model.php:35:5
         $this->id = $id;
     }
 
-    public function hasBeenPersisted(): bool
+    protected function hasBeenPersisted() : bool
     {
         return $this->id !== null;
killedBy: MatchBot\Tests\Domain\FundRepositoryTest::testPull
statusReason: 1) MatchBot\Tests\Domain\FundRepositoryTest::testPull
Error: Call to protected method MatchBot\Domain\Model::hasBeenPersisted() from scope MatchBot\Domain\SalesforceReadProxyRepository

/home/barney/projects/matchbot/src/Domain/SalesforceReadProxyRepository.php:36
/home/barney/projects/matchbot/tests/Domain/FundRepositoryTest.php:49

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] NotIdentical
Domain/Model.php:37:9
 
     public function hasBeenPersisted(): bool
     {
-        return $this->id !== null;
+        return $this->id === null;
     }
 
killedBy: MatchBot\Tests\Domain\FundRepositoryTest::testPull
statusReason: 1) MatchBot\Tests\Domain\FundRepositoryTest::testPull
Error: Call to a member function getEntityPersister() on null

/home/barney/projects/matchbot/vendor/doctrine/orm/lib/Doctrine/ORM/EntityRepository.php:239
/home/barney/projects/matchbot/src/Domain/SalesforceReadProxyRepository.php:37
/home/barney/projects/matchbot/tests/Domain/FundRepositoryTest.php:49

ERRORS!

[NoCoverage] ConcatOperandRemoval
Domain/Model.php:42:9
 
     public function __toString(): string
     {
-        return "Instance of " . get_class($this);
+        return "Instance of ";
     }
 }

[NoCoverage] ConcatOperandRemoval
Domain/Model.php:42:9
 
     public function __toString(): string
     {
-        return "Instance of " . get_class($this);
+        return get_class($this);
     }
 }
