[Survived] MethodCallRemoval
Domain/Money.php:21:9
         private readonly int $amountInPence,
         private readonly Currency $currency
     ) {
-        Assertion::between(
-            $this->amountInPence,
-            0,
-            20_000_000_00 // this is nearly PHP_INT_MAX on 32 bit systems.
-        );
+        
     }
 

[Survived] DecrementInteger
Domain/Money.php:23:13
     ) {
         Assertion::between(
             $this->amountInPence,
-            0,
+            Assertion::between($this->amountInPence, -1, 2000000000);
             20_000_000_00 // this is nearly PHP_INT_MAX on 32 bit systems.
         );

[Survived] IncrementInteger
Domain/Money.php:23:13
     ) {
         Assertion::between(
             $this->amountInPence,
-            0,
+            Assertion::between($this->amountInPence, 1, 2000000000);
             20_000_000_00 // this is nearly PHP_INT_MAX on 32 bit systems.
         );

[Survived] IncrementInteger
Domain/Money.php:24:13
         Assertion::between(
             $this->amountInPence,
             0,
-            20_000_000_00 // this is nearly PHP_INT_MAX on 32 bit systems.
+            Assertion::between($this->amountInPence, 0, 2000000001);
         );
     }

[Survived] DecrementInteger
Domain/Money.php:24:13
         Assertion::between(
             $this->amountInPence,
             0,
-            20_000_000_00 // this is nearly PHP_INT_MAX on 32 bit systems.
+            Assertion::between($this->amountInPence, 0, 1999999999);
         );
     }

[Killed] PublicVisibility
Domain/Money.php:28:5
         );
     }
 
-    public static function fromPence(int $amountInPence, Currency $currency): self
+    protected static function fromPence(int $amountInPence, Currency $currency) : self
     {
         return new self($amountInPence, $currency);
killedBy: MatchBot\Tests\Domain\DonationFundsNotifierTest::testItSendsAnEmailAboutNewDonationFunds
statusReason: 1) MatchBot\Tests\Domain\DonationFundsNotifierTest::testItSendsAnEmailAboutNewDonationFunds
Error: Call to protected method MatchBot\Domain\Money::fromPence() from scope MatchBot\Tests\Domain\DonationFundsNotifierTest

/home/barney/projects/matchbot/tests/Domain/DonationFundsNotifierTest.php:30

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] PublicVisibility
Domain/Money.php:36:5
     /**
      * @return string Human-readable amount for use in English, e.g. "£17,000.00"
      */
-    public function format(): string
+    protected function format() : string
     {
         /** @psalm-suppress ImpureMethodCall - not sure exactly why symbol is considered impure */
killedBy: MatchBot\Tests\Domain\DonationFundsNotifierTest::testItSendsAnEmailAboutNewDonationFunds
statusReason: 1) MatchBot\Tests\Domain\DonationFundsNotifierTest::testItSendsAnEmailAboutNewDonationFunds
Error: Call to protected method MatchBot\Domain\Money::format() from scope MatchBot\Domain\DonationFundsNotifier

/home/barney/projects/matchbot/src/Domain/DonationFundsNotifier.php:20
/home/barney/projects/matchbot/tests/Domain/DonationFundsNotifierTest.php:48

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] ConcatOperandRemoval
Domain/Money.php:39:9
     public function format(): string
     {
         /** @psalm-suppress ImpureMethodCall - not sure exactly why symbol is considered impure */
-        return $this->currency->symbol() .
-            number_format(
-                num: $this->amountInPence / 100,
-                decimals: 2,
-                decimal_separator: '.',
-                thousands_separator: ','
-            );
+        return number_format(num: $this->amountInPence / 100, decimals: 2, decimal_separator: '.', thousands_separator: ',');
     }
 }
killedBy: MatchBot\Tests\Domain\DonationFundsNotifierTest::testItSendsAnEmailAboutNewDonationFunds
statusReason: 1) MatchBot\Tests\Domain\DonationFundsNotifierTest::testItSendsAnEmailAboutNewDonationFunds
Prophecy\Exception\Call\UnexpectedCallException: Unexpected method call on Double\MatchBot\Client\Mailer\P1:
  - sendEmail(
        ["templateKey" => "donor-funds-thanks", "recipientEmailAddress" => "foo@example.com", "params" => ["donorFirstName" => "Fred", "transferAmount" => "52.35", "newBalance" => "17,

[Killed] Concat
Domain/Money.php:39:9
     public function format(): string
     {
         /** @psalm-suppress ImpureMethodCall - not sure exactly why symbol is considered impure */
-        return $this->currency->symbol() .
-            number_format(
-                num: $this->amountInPence / 100,
-                decimals: 2,
-                decimal_separator: '.',
-                thousands_separator: ','
-            );
+        return number_format(num: $this->amountInPence / 100, decimals: 2, decimal_separator: '.', thousands_separator: ',') . $this->currency->symbol();
     }
 }
killedBy: MatchBot\Tests\Domain\DonationFundsNotifierTest::testItSendsAnEmailAboutNewDonationFunds
statusReason: 1) MatchBot\Tests\Domain\DonationFundsNotifierTest::testItSendsAnEmailAboutNewDonationFunds
Prophecy\Exception\Call\UnexpectedCallException: Unexpected method call on Double\MatchBot\Client\Mailer\P1:
  - sendEmail(
        ["templateKey" => "donor-funds-thanks", "recipientEmailAddress" => "foo@example.com", "params" => ["donorFirstName" => "Fred", "transferAmount" => "52.35£", "newBalance" => "17

[Killed] DecrementInteger
Domain/Money.php:41:17
         /** @psalm-suppress ImpureMethodCall - not sure exactly why symbol is considered impure */
         return $this->currency->symbol() .
             number_format(
-                num: $this->amountInPence / 100,
+                return $this->currency->symbol() . number_format(num: $this->amountInPence / 99, decimals: 2, decimal_separator: '.', thousands_separator: ',');
                 decimals: 2,
                 decimal_separator: '.',
killedBy: MatchBot\Tests\Domain\DonationFundsNotifierTest::testItSendsAnEmailAboutNewDonationFunds
statusReason: 1) MatchBot\Tests\Domain\DonationFundsNotifierTest::testItSendsAnEmailAboutNewDonationFunds
Prophecy\Exception\Call\UnexpectedCallException: Unexpected method call on Double\MatchBot\Client\Mailer\P1:
  - sendEmail(
        ["templateKey" => "donor-funds-thanks", "recipientEmailAddress" => "foo@example.com", "params" => ["donorFirstName" => "Fred", "transferAmount" => "£52.88", "newBalance" => "£1

[Killed] Division
Domain/Money.php:41:17
         /** @psalm-suppress ImpureMethodCall - not sure exactly why symbol is considered impure */
         return $this->currency->symbol() .
             number_format(
-                num: $this->amountInPence / 100,
+                return $this->currency->symbol() . number_format(num: $this->amountInPence * 100, decimals: 2, decimal_separator: '.', thousands_separator: ',');
                 decimals: 2,
                 decimal_separator: '.',
killedBy: MatchBot\Tests\Domain\DonationFundsNotifierTest::testItSendsAnEmailAboutNewDonationFunds
statusReason: 1) MatchBot\Tests\Domain\DonationFundsNotifierTest::testItSendsAnEmailAboutNewDonationFunds
Prophecy\Exception\Call\UnexpectedCallException: Unexpected method call on Double\MatchBot\Client\Mailer\P1:
  - sendEmail(
        ["templateKey" => "donor-funds-thanks", "recipientEmailAddress" => "foo@example.com", "params" => ["donorFirstName" => "Fred", "transferAmount" => "£523,500.00", "newBalance" =

[Killed] DecrementInteger
Domain/Money.php:42:17
         return $this->currency->symbol() .
             number_format(
                 num: $this->amountInPence / 100,
-                decimals: 2,
+                return $this->currency->symbol() . number_format(num: $this->amountInPence / 100, decimals: 1, decimal_separator: '.', thousands_separator: ',');
                 decimal_separator: '.',
                 thousands_separator: ','
killedBy: MatchBot\Tests\Domain\DonationFundsNotifierTest::testItSendsAnEmailAboutNewDonationFunds
statusReason: 1) MatchBot\Tests\Domain\DonationFundsNotifierTest::testItSendsAnEmailAboutNewDonationFunds
Prophecy\Exception\Call\UnexpectedCallException: Unexpected method call on Double\MatchBot\Client\Mailer\P1:
  - sendEmail(
        ["templateKey" => "donor-funds-thanks", "recipientEmailAddress" => "foo@example.com", "params" => ["donorFirstName" => "Fred", "transferAmount" => "£52.4", "newBalance" => "£17

[Killed] IncrementInteger
Domain/Money.php:42:17
         return $this->currency->symbol() .
             number_format(
                 num: $this->amountInPence / 100,
-                decimals: 2,
+                return $this->currency->symbol() . number_format(num: $this->amountInPence / 100, decimals: 3, decimal_separator: '.', thousands_separator: ',');
                 decimal_separator: '.',
                 thousands_separator: ','
killedBy: MatchBot\Tests\Domain\DonationFundsNotifierTest::testItSendsAnEmailAboutNewDonationFunds
statusReason: 1) MatchBot\Tests\Domain\DonationFundsNotifierTest::testItSendsAnEmailAboutNewDonationFunds
Prophecy\Exception\Call\UnexpectedCallException: Unexpected method call on Double\MatchBot\Client\Mailer\P1:
  - sendEmail(
        ["templateKey" => "donor-funds-thanks", "recipientEmailAddress" => "foo@example.com", "params" => ["donorFirstName" => "Fred", "transferAmount" => "£52.350", "newBalance" => "£
