[Killed] ProtectedVisibility
Domain/SalesforceProxyRepository.php:19:5
     protected Client\Common $client;
     protected LoggerInterface $logger;
 
-    protected function logError(string $message): void
+    private function logError(string $message) : void
     {
         $this->logger->error($message);
killedBy: MatchBot\Tests\Domain\DonationRepositoryTest::testExistingPushWithMissingProxyIdButPendingUpdateStatusNew
statusReason: 1) MatchBot\Tests\Domain\DonationRepositoryTest::testExistingPushWithMissingProxyIdButPendingUpdateStatusNew
BadMethodCallException: Undefined method "logError". The method name must start with either findBy, findOneBy or countBy!

/home/barney/projects/matchbot/vendor/doctrine/orm/lib/Doctrine/ORM/EntityRepository.php:283
/home/barney/projects/matchbot/src/Domain/SalesforceWriteProxyRepository.ph

[Killed] MethodCallRemoval
Domain/SalesforceProxyRepository.php:21:9
 
     protected function logError(string $message): void
     {
-        $this->logger->error($message);
+        
     }
 
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

......................                                            22 / 22 (100%)

Time: 00:00.065, Memory: 20.00 MB

OK (22 tests, 85 assertions)

[Killed] ProtectedVisibility
Domain/SalesforceProxyRepository.php:24:5
         $this->logger->error($message);
     }
 
-    protected function logWarning(string $message): void
+    private function logWarning(string $message) : void
     {
         $this->logger->warning($message);
killedBy: MatchBot\Tests\Domain\FundRepositoryTest::testPullForCampaignAllExistingWithBalancesUpdatedToNewCurrency
statusReason: 1) MatchBot\Tests\Domain\FundRepositoryTest::testPullForCampaignAllExistingWithBalancesUpdatedToNewCurrency
BadMethodCallException: Undefined method "logWarning". The method name must start with either findBy, findOneBy or countBy!

/home/barney/projects/matchbot/vendor/doctrine/orm/lib/Doctrine/ORM/EntityRepository.php:283
/home/barney/projects/matchbot/src/Domain/FundRepository.php:145
/home/bar

[Killed] MethodCallRemoval
Domain/SalesforceProxyRepository.php:26:9
 
     protected function logWarning(string $message): void
     {
-        $this->logger->warning($message);
+        
     }
 
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

...........................                                       27 / 27 (100%)

Time: 00:00.074, Memory: 22.00 MB

OK (27 tests, 115 assertions)

[Killed] ProtectedVisibility
Domain/SalesforceProxyRepository.php:29:5
         $this->logger->warning($message);
     }
 
-    protected function logInfo(string $message): void
+    private function logInfo(string $message) : void
     {
         $this->logger->info($message);
killedBy: MatchBot\Tests\Domain\FundRepositoryTest::testPull
statusReason: 1) MatchBot\Tests\Domain\FundRepositoryTest::testPull
BadMethodCallException: Undefined method "logInfo". The method name must start with either findBy, findOneBy or countBy!

/home/barney/projects/matchbot/vendor/doctrine/orm/lib/Doctrine/ORM/EntityRepository.php:283
/home/barney/projects/matchbot/src/Domain/SalesforceReadProxyRepository.php:42
/home/barney/projects/matchbot/tests/Domain/FundRepo

[Killed] MethodCallRemoval
Domain/SalesforceProxyRepository.php:31:9
 
     protected function logInfo(string $message): void
     {
-        $this->logger->info($message);
+        
     }
 
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

...........................                                       27 / 27 (100%)

Time: 00:00.073, Memory: 22.00 MB

OK (27 tests, 115 assertions)

[Killed] PublicVisibility
Domain/SalesforceProxyRepository.php:34:5
         $this->logger->info($message);
     }
 
-    public function setClient(Client\Common $client): void
+    protected function setClient(Client\Common $client) : void
     {
         $this->client = $client;
killedBy: MatchBot\Tests\Domain\FundRepositoryTest::testPull
statusReason: 1) MatchBot\Tests\Domain\FundRepositoryTest::testPull
BadMethodCallException: Undefined method "setClient". The method name must start with either findBy, findOneBy or countBy!

/home/barney/projects/matchbot/vendor/doctrine/orm/lib/Doctrine/ORM/EntityRepository.php:283
/home/barney/projects/matchbot/tests/Domain/FundRepositoryTest.php:39

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] ProtectedVisibility
Domain/SalesforceProxyRepository.php:44:5
         $this->logger = $logger;
     }
 
-    protected function getClient(): Client\Common
+    private function getClient() : Client\Common
     {
         if (!$this->client) {
killedBy: MatchBot\Tests\Domain\FundRepositoryTest::testPull
statusReason: 1) MatchBot\Tests\Domain\FundRepositoryTest::testPull
BadMethodCallException: Undefined method "getClient". The method name must start with either findBy, findOneBy or countBy!

/home/barney/projects/matchbot/vendor/doctrine/orm/lib/Doctrine/ORM/EntityRepository.php:283
/home/barney/projects/matchbot/src/Domain/FundRepository.php:182
/home/barney/projects/matchbot/src/Domain/SalesforceReadProxyRep

[Killed] LogicalNot
Domain/SalesforceProxyRepository.php:46:9
 
     protected function getClient(): Client\Common
     {
-        if (!$this->client) {
+        if ($this->client) {
             throw new \LogicException('Set a Client in DI config for this Repository to sync data');
         }
killedBy: MatchBot\Tests\Domain\FundRepositoryTest::testPull
statusReason: 1) MatchBot\Tests\Domain\FundRepositoryTest::testPull
LogicException: Set a Client in DI config for this Repository to sync data

/home/barney/projects/matchbot/src/Domain/SalesforceProxyRepository.php:40
/home/barney/projects/matchbot/src/Domain/FundRepository.php:182
/home/barney/projects/matchbot/src/Domain/SalesforceReadProxyRepository.php:45
/home/barney/projects/matchbot/tests/Domain/FundRep

[NoCoverage] Throw_
Domain/SalesforceProxyRepository.php:47:13
     protected function getClient(): Client\Common
     {
         if (!$this->client) {
-            throw new \LogicException('Set a Client in DI config for this Repository to sync data');
+            new \LogicException('Set a Client in DI config for this Repository to sync data');
         }
 
