[Killed] TrueValue
Domain/SalesforceReadProxyRepository.php:31:5
      * @psalm-param T $proxy
      * @psalm-return T
      */
-    public function pull(SalesforceReadProxy $proxy, $autoSave = true): SalesforceReadProxy
+    public function pull(SalesforceReadProxy $proxy, $autoSave = false) : SalesforceReadProxy
     {
         // Make sure we update existing object if passed in a partial copy and we already have that Salesforce object
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

.....                                                               5 / 5 (100%)

Time: 00:00.033, Memory: 14.00 MB

OK (5 tests, 30 assertions)

[Killed] PublicVisibility
Domain/SalesforceReadProxyRepository.php:31:5
      * @psalm-param T $proxy
      * @psalm-return T
      */
-    public function pull(SalesforceReadProxy $proxy, $autoSave = true): SalesforceReadProxy
+    protected function pull(SalesforceReadProxy $proxy, $autoSave = true) : SalesforceReadProxy
     {
         // Make sure we update existing object if passed in a partial copy and we already have that Salesforce object
killedBy: MatchBot\Tests\Domain\FundRepositoryTest::testPull
statusReason: 1) MatchBot\Tests\Domain\FundRepositoryTest::testPull
BadMethodCallException: Undefined method "pull". The method name must start with either findBy, findOneBy or countBy!

/home/barney/projects/matchbot/vendor/doctrine/orm/lib/Doctrine/ORM/EntityRepository.php:283
/home/barney/projects/matchbot/tests/Domain/FundRepositoryTest.php:49

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] LogicalAnd
Domain/SalesforceReadProxyRepository.php:36:13
         // Make sure we update existing object if passed in a partial copy and we already have that Salesforce object
         // persisted, otherwise we'll try to insert a duplicate and get an ORM crash.
         if (
-            $proxy->hasBeenPersisted() &&
-            ($existingProxy = $this->findOneBy(['salesforceId' => $proxy->getSalesforceId()]))
+            if ($proxy->hasBeenPersisted() || ($existingProxy = $this->findOneBy(['salesforceId' => $proxy->getSalesforceId()]))) {OneBy(['salesforceId' => $proxy->getSalesforceId()]))
         ) {
             $this->logInfo('Updating ' . get_class($proxy) . ' ' . $proxy->getSalesforceId() . '...');
killedBy: MatchBot\Tests\Domain\FundRepositoryTest::testPull
statusReason: 1) MatchBot\Tests\Domain\FundRepositoryTest::testPull
Error: Call to a member function getEntityPersister() on null

/home/barney/projects/matchbot/vendor/doctrine/orm/lib/Doctrine/ORM/EntityRepository.php:239
/home/barney/projects/matchbot/src/Domain/SalesforceReadProxyRepository.php:32
/home/barney/projects/matchbot/tests/Domain/FundRepositoryTest.php:49

ERRORS!

[Killed] LogicalAndAllSubExprNegation
Domain/SalesforceReadProxyRepository.php:36:13
         // Make sure we update existing object if passed in a partial copy and we already have that Salesforce object
         // persisted, otherwise we'll try to insert a duplicate and get an ORM crash.
         if (
-            $proxy->hasBeenPersisted() &&
-            ($existingProxy = $this->findOneBy(['salesforceId' => $proxy->getSalesforceId()]))
+            if (!$proxy->hasBeenPersisted() && !($existingProxy = $this->findOneBy(['salesforceId' => $proxy->getSalesforceId()]))) {OneBy(['salesforceId' => $proxy->getSalesforceId()]))
         ) {
             $this->logInfo('Updating ' . get_class($proxy) . ' ' . $proxy->getSalesforceId() . '...');
killedBy: MatchBot\Tests\Domain\FundRepositoryTest::testPull
statusReason: 1) MatchBot\Tests\Domain\FundRepositoryTest::testPull
Error: Call to a member function getEntityPersister() on null

/home/barney/projects/matchbot/vendor/doctrine/orm/lib/Doctrine/ORM/EntityRepository.php:239
/home/barney/projects/matchbot/src/Domain/SalesforceReadProxyRepository.php:32
/home/barney/projects/matchbot/tests/Domain/FundRepositoryTest.php:49

ERRORS!

[Killed] ArrayItem
Domain/SalesforceReadProxyRepository.php:37:13
         // persisted, otherwise we'll try to insert a duplicate and get an ORM crash.
         if (
             $proxy->hasBeenPersisted() &&
-            ($existingProxy = $this->findOneBy(['salesforceId' => $proxy->getSalesforceId()]))
+            if ($proxy->hasBeenPersisted() && ($existingProxy = $this->findOneBy(['salesforceId' > $proxy->getSalesforceId()]))) {
         ) {
             $this->logInfo('Updating ' . get_class($proxy) . ' ' . $proxy->getSalesforceId() . '...');
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

.....                                                               5 / 5 (100%)

Time: 00:00.033, Memory: 14.00 MB

OK (5 tests, 30 assertions)

[NoCoverage] ConcatOperandRemoval
Domain/SalesforceReadProxyRepository.php:39:13
             $proxy->hasBeenPersisted() &&
             ($existingProxy = $this->findOneBy(['salesforceId' => $proxy->getSalesforceId()]))
         ) {
-            $this->logInfo('Updating ' . get_class($proxy) . ' ' . $proxy->getSalesforceId() . '...');
+            $this->logInfo(get_class($proxy) . ' ' . $proxy->getSalesforceId() . '...');
             $proxy = $existingProxy;
         } else {

[NoCoverage] Concat
Domain/SalesforceReadProxyRepository.php:39:13
             $proxy->hasBeenPersisted() &&
             ($existingProxy = $this->findOneBy(['salesforceId' => $proxy->getSalesforceId()]))
         ) {
-            $this->logInfo('Updating ' . get_class($proxy) . ' ' . $proxy->getSalesforceId() . '...');
+            $this->logInfo('Updating ' . get_class($proxy) . ' ' . '...' . $proxy->getSalesforceId());
             $proxy = $existingProxy;
         } else {

[Killed] MethodCallRemoval
Domain/SalesforceReadProxyRepository.php:42:13
             $this->logInfo('Updating ' . get_class($proxy) . ' ' . $proxy->getSalesforceId() . '...');
             $proxy = $existingProxy;
         } else {
-            $this->logInfo('Creating ' . get_class($proxy) . ' ' . $proxy->getSalesforceId());
+            
         }
 
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

.....                                                               5 / 5 (100%)

Time: 00:00.032, Memory: 16.00 MB

OK (5 tests, 30 assertions)

[Killed] Concat
Domain/SalesforceReadProxyRepository.php:42:13
             $this->logInfo('Updating ' . get_class($proxy) . ' ' . $proxy->getSalesforceId() . '...');
             $proxy = $existingProxy;
         } else {
-            $this->logInfo('Creating ' . get_class($proxy) . ' ' . $proxy->getSalesforceId());
+            $this->logInfo(get_class($proxy) . 'Creating ' . ' ' . $proxy->getSalesforceId());
         }
 
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

.....                                                               5 / 5 (100%)

Time: 00:00.036, Memory: 14.00 MB

OK (5 tests, 30 assertions)

[Killed] MethodCallRemoval
Domain/SalesforceReadProxyRepository.php:46:9
         }
 
         $proxy = $this->doPull($proxy);
-        $proxy->setSalesforceLastPull(new DateTime('now'));
+        
         $this->getEntityManager()->persist($proxy);
         if ($autoSave) {
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

.....                                                               5 / 5 (100%)

Time: 00:00.031, Memory: 16.00 MB

OK (5 tests, 30 assertions)

[Killed] MethodCallRemoval
Domain/SalesforceReadProxyRepository.php:47:9
 
         $proxy = $this->doPull($proxy);
         $proxy->setSalesforceLastPull(new DateTime('now'));
-        $this->getEntityManager()->persist($proxy);
+        
         if ($autoSave) {
             $this->getEntityManager()->flush();
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

.....                                                               5 / 5 (100%)

Time: 00:00.032, Memory: 16.00 MB

OK (5 tests, 30 assertions)

[Killed] IfNegation
Domain/SalesforceReadProxyRepository.php:48:9
         $proxy = $this->doPull($proxy);
         $proxy->setSalesforceLastPull(new DateTime('now'));
         $this->getEntityManager()->persist($proxy);
-        if ($autoSave) {
-            $this->getEntityManager()->flush();
-        }
+        if (!$autoSave) {
 
         $this->logInfo('Done persisting ' . get_class($proxy) . ' ' . $proxy->getSalesforceId());
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

.....                                                               5 / 5 (100%)

Time: 00:00.031, Memory: 14.00 MB

OK (5 tests, 30 assertions)

[NoCoverage] MethodCallRemoval
Domain/SalesforceReadProxyRepository.php:49:13
         $proxy->setSalesforceLastPull(new DateTime('now'));
         $this->getEntityManager()->persist($proxy);
         if ($autoSave) {
-            $this->getEntityManager()->flush();
+            
         }
 

[Killed] Concat
Domain/SalesforceReadProxyRepository.php:52:9
             $this->getEntityManager()->flush();
         }
 
-        $this->logInfo('Done persisting ' . get_class($proxy) . ' ' . $proxy->getSalesforceId());
+        $this->logInfo('Done persisting ' . ' ' . get_class($proxy) . $proxy->getSalesforceId());
 
         return $proxy;
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

.....                                                               5 / 5 (100%)

Time: 00:00.031, Memory: 14.00 MB

OK (5 tests, 30 assertions)

[Killed] ConcatOperandRemoval
Domain/SalesforceReadProxyRepository.php:52:9
             $this->getEntityManager()->flush();
         }
 
-        $this->logInfo('Done persisting ' . get_class($proxy) . ' ' . $proxy->getSalesforceId());
+        $this->logInfo('Done persisting ' . get_class($proxy) . ' ');
 
         return $proxy;
statusReason: PHPUnit 9.6.13 by Sebastian Bergmann and contributors.

.....                                                               5 / 5 (100%)

Time: 00:00.032, Memory: 16.00 MB

OK (5 tests, 30 assertions)
