[Survived] MethodCallRemoval
Domain/StripeCustomerId.php:22:9
         string $stripeCustomerId
     ){
         $this->stripeCustomerId = $stripeCustomerId;
-        Assertion::notEmpty($this->stripeCustomerId);
+        
         Assertion::maxLength($this->stripeCustomerId, 255);
         Assertion::regex($this->stripeCustomerId, '/^cus_[a-zA-Z0-9]+$/'); // e.g. cus_df64s36cf

[Survived] MethodCallRemoval
Domain/StripeCustomerId.php:23:9
     ){
         $this->stripeCustomerId = $stripeCustomerId;
         Assertion::notEmpty($this->stripeCustomerId);
-        Assertion::maxLength($this->stripeCustomerId, 255);
+        
         Assertion::regex($this->stripeCustomerId, '/^cus_[a-zA-Z0-9]+$/'); // e.g. cus_df64s36cf
     }

[Survived] IncrementInteger
Domain/StripeCustomerId.php:23:9
     ){
         $this->stripeCustomerId = $stripeCustomerId;
         Assertion::notEmpty($this->stripeCustomerId);
-        Assertion::maxLength($this->stripeCustomerId, 255);
+        Assertion::maxLength($this->stripeCustomerId, 256);
         Assertion::regex($this->stripeCustomerId, '/^cus_[a-zA-Z0-9]+$/'); // e.g. cus_df64s36cf
     }

[Survived] MethodCallRemoval
Domain/StripeCustomerId.php:24:9
         $this->stripeCustomerId = $stripeCustomerId;
         Assertion::notEmpty($this->stripeCustomerId);
         Assertion::maxLength($this->stripeCustomerId, 255);
-        Assertion::regex($this->stripeCustomerId, '/^cus_[a-zA-Z0-9]+$/'); // e.g. cus_df64s36cf
+         // e.g. cus_df64s36cf
     }
 

[Killed] PublicVisibility
Domain/StripeCustomerId.php:30:5
     /**
      * @param string $stripeID - must fit the pattern for a Stripe ID.
      */
-    public static function of(string $stripeID): self
+    protected static function of(string $stripeID) : self
     {
         return new self($stripeID);
killedBy: MatchBot\Tests\Domain\DonationFundsNotifierTest::testItSendsAnEmailAboutNewDonationFunds
statusReason: 1) MatchBot\Tests\Domain\DonationFundsNotifierTest::testItSendsAnEmailAboutNewDonationFunds
Error: Call to protected method MatchBot\Domain\StripeCustomerId::of() from scope MatchBot\Tests\Domain\DonationFundsNotifierTest

/home/barney/projects/matchbot/tests/Domain/DonationFundsNotifierTest.php:27

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.
