[NoCoverage] NotIdentical
Migrations/Version20191109151808.php:23:9
     public function up(Schema $schema) : void
     {
         // this up() migration is auto-generated, please modify it to your needs
-        $this->abortIf($this->connection->getDatabasePlatform()->getName() !== 'mysql', 'Migration can only be executed safely on \'mysql\'.');
+        $this->abortIf($this->connection->getDatabasePlatform()->getName() === 'mysql', 'Migration can only be executed safely on \'mysql\'.');
 

[NoCoverage] MethodCallRemoval
Migrations/Version20191109151808.php:23:9
     public function up(Schema $schema) : void
     {
         // this up() migration is auto-generated, please modify it to your needs
-        $this->abortIf($this->connection->getDatabasePlatform()->getName() !== 'mysql', 'Migration can only be executed safely on \'mysql\'.');
+        
 

[NoCoverage] MethodCallRemoval
Migrations/Version20191109151808.php:32:9
-        $this->addSql('ALTER TABLE Campaign ADD CONSTRAINT FK_E663708BF5C97E37 FOREIGN KEY (charity_id) REFERENCES Charity (id)');
+        
         $this->addSql('ALTER TABLE FundingWithdrawal ADD CONSTRAINT FK_5C8EAC124DC1279C FOREIGN KEY (donation_id) REFERENCES Donation (id)');
         $this->addSql('ALTER TABLE CampaignFunding ADD CONSTRAINT FK_B00548FA25A38F89 FOREIGN KEY (fund_id) REFERENCES Fund (id)');

[NoCoverage] MethodCallRemoval
Migrations/Version20191109151808.php:33:9
         $this->addSql('ALTER TABLE Campaign ADD CONSTRAINT FK_E663708BF5C97E37 FOREIGN KEY (charity_id) REFERENCES Charity (id)');
-        $this->addSql('ALTER TABLE FundingWithdrawal ADD CONSTRAINT FK_5C8EAC124DC1279C FOREIGN KEY (donation_id) REFERENCES Donation (id)');
+        
         $this->addSql('ALTER TABLE CampaignFunding ADD CONSTRAINT FK_B00548FA25A38F89 FOREIGN KEY (fund_id) REFERENCES Fund (id)');
         $this->addSql('ALTER TABLE Campaign_CampaignFunding ADD CONSTRAINT FK_3364399584C3B9E4 FOREIGN KEY (campaignfunding_id) REFERENCES CampaignFunding (id)');

[NoCoverage] MethodCallRemoval
Migrations/Version20191109151808.php:34:9
         $this->addSql('ALTER TABLE Campaign ADD CONSTRAINT FK_E663708BF5C97E37 FOREIGN KEY (charity_id) REFERENCES Charity (id)');
         $this->addSql('ALTER TABLE FundingWithdrawal ADD CONSTRAINT FK_5C8EAC124DC1279C FOREIGN KEY (donation_id) REFERENCES Donation (id)');
-        $this->addSql('ALTER TABLE CampaignFunding ADD CONSTRAINT FK_B00548FA25A38F89 FOREIGN KEY (fund_id) REFERENCES Fund (id)');
+        
         $this->addSql('ALTER TABLE Campaign_CampaignFunding ADD CONSTRAINT FK_3364399584C3B9E4 FOREIGN KEY (campaignfunding_id) REFERENCES CampaignFunding (id)');
         $this->addSql('ALTER TABLE Campaign_CampaignFunding ADD CONSTRAINT FK_33643995F639F774 FOREIGN KEY (campaign_id) REFERENCES Campaign (id)');

[NoCoverage] MethodCallRemoval
Migrations/Version20191109151808.php:35:9
         $this->addSql('ALTER TABLE Campaign ADD CONSTRAINT FK_E663708BF5C97E37 FOREIGN KEY (charity_id) REFERENCES Charity (id)');
         $this->addSql('ALTER TABLE FundingWithdrawal ADD CONSTRAINT FK_5C8EAC124DC1279C FOREIGN KEY (donation_id) REFERENCES Donation (id)');
         $this->addSql('ALTER TABLE CampaignFunding ADD CONSTRAINT FK_B00548FA25A38F89 FOREIGN KEY (fund_id) REFERENCES Fund (id)');
-        $this->addSql('ALTER TABLE Campaign_CampaignFunding ADD CONSTRAINT FK_3364399584C3B9E4 FOREIGN KEY (campaignfunding_id) REFERENCES CampaignFunding (id)');
+        
         $this->addSql('ALTER TABLE Campaign_CampaignFunding ADD CONSTRAINT FK_33643995F639F774 FOREIGN KEY (campaign_id) REFERENCES Campaign (id)');
         $this->addSql('ALTER TABLE Donation ADD CONSTRAINT FK_C893E3F6F639F774 FOREIGN KEY (campaign_id) REFERENCES Campaign (id)');

[NoCoverage] MethodCallRemoval
Migrations/Version20191109151808.php:36:9
         $this->addSql('ALTER TABLE FundingWithdrawal ADD CONSTRAINT FK_5C8EAC124DC1279C FOREIGN KEY (donation_id) REFERENCES Donation (id)');
         $this->addSql('ALTER TABLE CampaignFunding ADD CONSTRAINT FK_B00548FA25A38F89 FOREIGN KEY (fund_id) REFERENCES Fund (id)');
         $this->addSql('ALTER TABLE Campaign_CampaignFunding ADD CONSTRAINT FK_3364399584C3B9E4 FOREIGN KEY (campaignfunding_id) REFERENCES CampaignFunding (id)');
-        $this->addSql('ALTER TABLE Campaign_CampaignFunding ADD CONSTRAINT FK_33643995F639F774 FOREIGN KEY (campaign_id) REFERENCES Campaign (id)');
+        
         $this->addSql('ALTER TABLE Donation ADD CONSTRAINT FK_C893E3F6F639F774 FOREIGN KEY (campaign_id) REFERENCES Campaign (id)');
     }

[NoCoverage] MethodCallRemoval
Migrations/Version20191109151808.php:37:9
         $this->addSql('ALTER TABLE CampaignFunding ADD CONSTRAINT FK_B00548FA25A38F89 FOREIGN KEY (fund_id) REFERENCES Fund (id)');
         $this->addSql('ALTER TABLE Campaign_CampaignFunding ADD CONSTRAINT FK_3364399584C3B9E4 FOREIGN KEY (campaignfunding_id) REFERENCES CampaignFunding (id)');
         $this->addSql('ALTER TABLE Campaign_CampaignFunding ADD CONSTRAINT FK_33643995F639F774 FOREIGN KEY (campaign_id) REFERENCES Campaign (id)');
-        $this->addSql('ALTER TABLE Donation ADD CONSTRAINT FK_C893E3F6F639F774 FOREIGN KEY (campaign_id) REFERENCES Campaign (id)');
+        
     }
 

[NoCoverage] MethodCallRemoval
Migrations/Version20191109151808.php:43:9
     public function down(Schema $schema) : void
     {
         // this down() migration is auto-generated, please modify it to your needs
-        $this->abortIf($this->connection->getDatabasePlatform()->getName() !== 'mysql', 'Migration can only be executed safely on \'mysql\'.');
+        
 
         $this->addSql('ALTER TABLE Campaign DROP FOREIGN KEY FK_E663708BF5C97E37');

[NoCoverage] NotIdentical
Migrations/Version20191109151808.php:43:9
     public function down(Schema $schema) : void
     {
         // this down() migration is auto-generated, please modify it to your needs
-        $this->abortIf($this->connection->getDatabasePlatform()->getName() !== 'mysql', 'Migration can only be executed safely on \'mysql\'.');
+        $this->abortIf($this->connection->getDatabasePlatform()->getName() === 'mysql', 'Migration can only be executed safely on \'mysql\'.');
 
         $this->addSql('ALTER TABLE Campaign DROP FOREIGN KEY FK_E663708BF5C97E37');

[NoCoverage] MethodCallRemoval
Migrations/Version20191109151808.php:45:9
         // this down() migration is auto-generated, please modify it to your needs
         $this->abortIf($this->connection->getDatabasePlatform()->getName() !== 'mysql', 'Migration can only be executed safely on \'mysql\'.');
 
-        $this->addSql('ALTER TABLE Campaign DROP FOREIGN KEY FK_E663708BF5C97E37');
+        
         $this->addSql('ALTER TABLE Campaign_CampaignFunding DROP FOREIGN KEY FK_33643995F639F774');
         $this->addSql('ALTER TABLE Donation DROP FOREIGN KEY FK_C893E3F6F639F774');

[NoCoverage] MethodCallRemoval
Migrations/Version20191109151808.php:46:9
         $this->abortIf($this->connection->getDatabasePlatform()->getName() !== 'mysql', 'Migration can only be executed safely on \'mysql\'.');
 
         $this->addSql('ALTER TABLE Campaign DROP FOREIGN KEY FK_E663708BF5C97E37');
-        $this->addSql('ALTER TABLE Campaign_CampaignFunding DROP FOREIGN KEY FK_33643995F639F774');
+        
         $this->addSql('ALTER TABLE Donation DROP FOREIGN KEY FK_C893E3F6F639F774');
         $this->addSql('ALTER TABLE CampaignFunding DROP FOREIGN KEY FK_B00548FA25A38F89');

[NoCoverage] MethodCallRemoval
Migrations/Version20191109151808.php:47:9
 
         $this->addSql('ALTER TABLE Campaign DROP FOREIGN KEY FK_E663708BF5C97E37');
         $this->addSql('ALTER TABLE Campaign_CampaignFunding DROP FOREIGN KEY FK_33643995F639F774');
-        $this->addSql('ALTER TABLE Donation DROP FOREIGN KEY FK_C893E3F6F639F774');
+        
         $this->addSql('ALTER TABLE CampaignFunding DROP FOREIGN KEY FK_B00548FA25A38F89');
         $this->addSql('ALTER TABLE Campaign_CampaignFunding DROP FOREIGN KEY FK_3364399584C3B9E4');

[NoCoverage] MethodCallRemoval
Migrations/Version20191109151808.php:48:9
         $this->addSql('ALTER TABLE Campaign DROP FOREIGN KEY FK_E663708BF5C97E37');
         $this->addSql('ALTER TABLE Campaign_CampaignFunding DROP FOREIGN KEY FK_33643995F639F774');
         $this->addSql('ALTER TABLE Donation DROP FOREIGN KEY FK_C893E3F6F639F774');
-        $this->addSql('ALTER TABLE CampaignFunding DROP FOREIGN KEY FK_B00548FA25A38F89');
+        
         $this->addSql('ALTER TABLE Campaign_CampaignFunding DROP FOREIGN KEY FK_3364399584C3B9E4');
         $this->addSql('ALTER TABLE FundingWithdrawal DROP FOREIGN KEY FK_5C8EAC124DC1279C');

[NoCoverage] MethodCallRemoval
Migrations/Version20191109151808.php:49:9
         $this->addSql('ALTER TABLE Campaign_CampaignFunding DROP FOREIGN KEY FK_33643995F639F774');
         $this->addSql('ALTER TABLE Donation DROP FOREIGN KEY FK_C893E3F6F639F774');
         $this->addSql('ALTER TABLE CampaignFunding DROP FOREIGN KEY FK_B00548FA25A38F89');
-        $this->addSql('ALTER TABLE Campaign_CampaignFunding DROP FOREIGN KEY FK_3364399584C3B9E4');
+        
         $this->addSql('ALTER TABLE FundingWithdrawal DROP FOREIGN KEY FK_5C8EAC124DC1279C');
         $this->addSql('DROP TABLE Charity');

[NoCoverage] MethodCallRemoval
Migrations/Version20191109151808.php:50:9
         $this->addSql('ALTER TABLE Donation DROP FOREIGN KEY FK_C893E3F6F639F774');
         $this->addSql('ALTER TABLE CampaignFunding DROP FOREIGN KEY FK_B00548FA25A38F89');
         $this->addSql('ALTER TABLE Campaign_CampaignFunding DROP FOREIGN KEY FK_3364399584C3B9E4');
-        $this->addSql('ALTER TABLE FundingWithdrawal DROP FOREIGN KEY FK_5C8EAC124DC1279C');
+        
         $this->addSql('DROP TABLE Charity');
         $this->addSql('DROP TABLE Campaign');

[NoCoverage] MethodCallRemoval
Migrations/Version20191109151808.php:51:9
         $this->addSql('ALTER TABLE CampaignFunding DROP FOREIGN KEY FK_B00548FA25A38F89');
         $this->addSql('ALTER TABLE Campaign_CampaignFunding DROP FOREIGN KEY FK_3364399584C3B9E4');
         $this->addSql('ALTER TABLE FundingWithdrawal DROP FOREIGN KEY FK_5C8EAC124DC1279C');
-        $this->addSql('DROP TABLE Charity');
+        
         $this->addSql('DROP TABLE Campaign');
         $this->addSql('DROP TABLE Fund');

[NoCoverage] MethodCallRemoval
Migrations/Version20191109151808.php:52:9
         $this->addSql('ALTER TABLE Campaign_CampaignFunding DROP FOREIGN KEY FK_3364399584C3B9E4');
         $this->addSql('ALTER TABLE FundingWithdrawal DROP FOREIGN KEY FK_5C8EAC124DC1279C');
         $this->addSql('DROP TABLE Charity');
-        $this->addSql('DROP TABLE Campaign');
+        
         $this->addSql('DROP TABLE Fund');
         $this->addSql('DROP TABLE FundingWithdrawal');

[NoCoverage] MethodCallRemoval
Migrations/Version20191109151808.php:53:9
         $this->addSql('ALTER TABLE FundingWithdrawal DROP FOREIGN KEY FK_5C8EAC124DC1279C');
         $this->addSql('DROP TABLE Charity');
         $this->addSql('DROP TABLE Campaign');
-        $this->addSql('DROP TABLE Fund');
+        
         $this->addSql('DROP TABLE FundingWithdrawal');
         $this->addSql('DROP TABLE CampaignFunding');

[NoCoverage] MethodCallRemoval
Migrations/Version20191109151808.php:54:9
         $this->addSql('DROP TABLE Charity');
         $this->addSql('DROP TABLE Campaign');
         $this->addSql('DROP TABLE Fund');
-        $this->addSql('DROP TABLE FundingWithdrawal');
+        
         $this->addSql('DROP TABLE CampaignFunding');
         $this->addSql('DROP TABLE Campaign_CampaignFunding');

[NoCoverage] MethodCallRemoval
Migrations/Version20191109151808.php:55:9
         $this->addSql('DROP TABLE Campaign');
         $this->addSql('DROP TABLE Fund');
         $this->addSql('DROP TABLE FundingWithdrawal');
-        $this->addSql('DROP TABLE CampaignFunding');
+        
         $this->addSql('DROP TABLE Campaign_CampaignFunding');
         $this->addSql('DROP TABLE Donation');

[NoCoverage] MethodCallRemoval
Migrations/Version20191109151808.php:56:9
         $this->addSql('DROP TABLE Fund');
         $this->addSql('DROP TABLE FundingWithdrawal');
         $this->addSql('DROP TABLE CampaignFunding');
-        $this->addSql('DROP TABLE Campaign_CampaignFunding');
+        
         $this->addSql('DROP TABLE Donation');
     }

[NoCoverage] MethodCallRemoval
Migrations/Version20191109151808.php:57:9
         $this->addSql('DROP TABLE FundingWithdrawal');
         $this->addSql('DROP TABLE CampaignFunding');
         $this->addSql('DROP TABLE Campaign_CampaignFunding');
-        $this->addSql('DROP TABLE Donation');
+        
     }
 }
