[NoCoverage] MethodCallRemoval
Migrations/Version20191110112409.php:25:9
         // this up() migration is auto-generated, please modify it to your needs
         $this->abortIf($this->connection->getDatabasePlatform()->getName() !== 'mysql', 'Migration can only be executed safely on \'mysql\'.');
 
-        $this->addSql('ALTER TABLE FundingWithdrawal ADD campaignFunding_id INT UNSIGNED DEFAULT NULL');
+        
         $this->addSql('ALTER TABLE FundingWithdrawal ADD CONSTRAINT FK_5C8EAC12CB9EBA34 FOREIGN KEY (campaignFunding_id) REFERENCES CampaignFunding (id)');
         $this->addSql('CREATE INDEX IDX_5C8EAC12CB9EBA34 ON FundingWithdrawal (campaignFunding_id)');

[NoCoverage] MethodCallRemoval
Migrations/Version20191110112409.php:26:9
         $this->abortIf($this->connection->getDatabasePlatform()->getName() !== 'mysql', 'Migration can only be executed safely on \'mysql\'.');
 
         $this->addSql('ALTER TABLE FundingWithdrawal ADD campaignFunding_id INT UNSIGNED DEFAULT NULL');
-        $this->addSql('ALTER TABLE FundingWithdrawal ADD CONSTRAINT FK_5C8EAC12CB9EBA34 FOREIGN KEY (campaignFunding_id) REFERENCES CampaignFunding (id)');
+        
         $this->addSql('CREATE INDEX IDX_5C8EAC12CB9EBA34 ON FundingWithdrawal (campaignFunding_id)');
     }

[NoCoverage] MethodCallRemoval
Migrations/Version20191110112409.php:27:9
 
         $this->addSql('ALTER TABLE FundingWithdrawal ADD campaignFunding_id INT UNSIGNED DEFAULT NULL');
         $this->addSql('ALTER TABLE FundingWithdrawal ADD CONSTRAINT FK_5C8EAC12CB9EBA34 FOREIGN KEY (campaignFunding_id) REFERENCES CampaignFunding (id)');
-        $this->addSql('CREATE INDEX IDX_5C8EAC12CB9EBA34 ON FundingWithdrawal (campaignFunding_id)');
+        
     }
 

[NoCoverage] MethodCallRemoval
Migrations/Version20191110112409.php:35:9
         // this down() migration is auto-generated, please modify it to your needs
         $this->abortIf($this->connection->getDatabasePlatform()->getName() !== 'mysql', 'Migration can only be executed safely on \'mysql\'.');
 
-        $this->addSql('ALTER TABLE FundingWithdrawal DROP FOREIGN KEY FK_5C8EAC12CB9EBA34');
+        
         $this->addSql('DROP INDEX IDX_5C8EAC12CB9EBA34 ON FundingWithdrawal');
         $this->addSql('ALTER TABLE FundingWithdrawal DROP campaignFunding_id');

[NoCoverage] MethodCallRemoval
Migrations/Version20191110112409.php:36:9
         $this->abortIf($this->connection->getDatabasePlatform()->getName() !== 'mysql', 'Migration can only be executed safely on \'mysql\'.');
 
         $this->addSql('ALTER TABLE FundingWithdrawal DROP FOREIGN KEY FK_5C8EAC12CB9EBA34');
-        $this->addSql('DROP INDEX IDX_5C8EAC12CB9EBA34 ON FundingWithdrawal');
+        
         $this->addSql('ALTER TABLE FundingWithdrawal DROP campaignFunding_id');
     }

[NoCoverage] MethodCallRemoval
Migrations/Version20191110112409.php:37:9
 
         $this->addSql('ALTER TABLE FundingWithdrawal DROP FOREIGN KEY FK_5C8EAC12CB9EBA34');
         $this->addSql('DROP INDEX IDX_5C8EAC12CB9EBA34 ON FundingWithdrawal');
-        $this->addSql('ALTER TABLE FundingWithdrawal DROP campaignFunding_id');
+        
     }
 }
