[NoCoverage] MethodCallRemoval
Migrations/Version20191110162524.php:33:9
         // this down() migration is auto-generated, please modify it to your needs
         $this->abortIf($this->connection->getDatabasePlatform()->getName() !== 'mysql', 'Migration can only be executed safely on \'mysql\'.');
 
-        $this->addSql('DROP TABLE CommandLockKeys');
+        
     }
 }
