[NoCoverage] MethodCallRemoval
Migrations/Version20191113083835.php:22:9
 
     public function up(Schema $schema) : void
     {
-        $this->abortIf($this->connection->getDatabasePlatform()->getName() !== 'mysql', 'Migration can only be executed safely on \'mysql\'.');
+        
 
         $this->addSql('CREATE INDEX available_fundings ON CampaignFunding (amountAvailable, allocationOrder, id)');

[NoCoverage] NotIdentical
Migrations/Version20191113083835.php:22:9
 
     public function up(Schema $schema) : void
     {
-        $this->abortIf($this->connection->getDatabasePlatform()->getName() !== 'mysql', 'Migration can only be executed safely on \'mysql\'.');
+        $this->abortIf($this->connection->getDatabasePlatform()->getName() === 'mysql', 'Migration can only be executed safely on \'mysql\'.');
 
         $this->addSql('CREATE INDEX available_fundings ON CampaignFunding (amountAvailable, allocationOrder, id)');

[NoCoverage] MethodCallRemoval
Migrations/Version20191113083835.php:24:9
     {
         $this->abortIf($this->connection->getDatabasePlatform()->getName() !== 'mysql', 'Migration can only be executed safely on \'mysql\'.');
 
-        $this->addSql('CREATE INDEX available_fundings ON CampaignFunding (amountAvailable, allocationOrder, id)');
+        
         $this->addSql('CREATE INDEX date_and_status ON Donation (createdAt, donationStatus)');
         $this->addSql('CREATE INDEX salesforcePushStatus ON Donation (salesforcePushStatus)');

[NoCoverage] MethodCallRemoval
Migrations/Version20191113083835.php:25:9
         $this->abortIf($this->connection->getDatabasePlatform()->getName() !== 'mysql', 'Migration can only be executed safely on \'mysql\'.');
 
         $this->addSql('CREATE INDEX available_fundings ON CampaignFunding (amountAvailable, allocationOrder, id)');
-        $this->addSql('CREATE INDEX date_and_status ON Donation (createdAt, donationStatus)');
+        
         $this->addSql('CREATE INDEX salesforcePushStatus ON Donation (salesforcePushStatus)');
     }

[NoCoverage] MethodCallRemoval
Migrations/Version20191113083835.php:26:9
 
         $this->addSql('CREATE INDEX available_fundings ON CampaignFunding (amountAvailable, allocationOrder, id)');
         $this->addSql('CREATE INDEX date_and_status ON Donation (createdAt, donationStatus)');
-        $this->addSql('CREATE INDEX salesforcePushStatus ON Donation (salesforcePushStatus)');
+        
     }
 

[NoCoverage] MethodCallRemoval
Migrations/Version20191113083835.php:33:9
     {
         $this->abortIf($this->connection->getDatabasePlatform()->getName() !== 'mysql', 'Migration can only be executed safely on \'mysql\'.');
 
-        $this->addSql('DROP INDEX available_fundings ON CampaignFunding');
+        
         $this->addSql('DROP INDEX date_and_status ON Donation');
         $this->addSql('DROP INDEX salesforcePushStatus ON Donation');

[NoCoverage] MethodCallRemoval
Migrations/Version20191113083835.php:34:9
         $this->abortIf($this->connection->getDatabasePlatform()->getName() !== 'mysql', 'Migration can only be executed safely on \'mysql\'.');
 
         $this->addSql('DROP INDEX available_fundings ON CampaignFunding');
-        $this->addSql('DROP INDEX date_and_status ON Donation');
+        
         $this->addSql('DROP INDEX salesforcePushStatus ON Donation');
     }

[NoCoverage] MethodCallRemoval
Migrations/Version20191113083835.php:35:9
 
         $this->addSql('DROP INDEX available_fundings ON CampaignFunding');
         $this->addSql('DROP INDEX date_and_status ON Donation');
-        $this->addSql('DROP INDEX salesforcePushStatus ON Donation');
+        
     }
 }
