[NoCoverage] MethodCallRemoval
Migrations/Version20200720102604.php:24:9
     {
         $this->abortIf($this->connection->getDatabasePlatform()->getName() !== 'mysql', 'Migration can only be executed safely on \'mysql\'.');
 
-        $this->addSql('ALTER TABLE Charity ADD stripeAccountId VARCHAR(255) DEFAULT NULL');
+        
         $this->addSql('CREATE UNIQUE INDEX UNIQ_4CC08E8293A8A818 ON Charity (stripeAccountId)');
     }

[NoCoverage] MethodCallRemoval
Migrations/Version20200720102604.php:25:9
         $this->abortIf($this->connection->getDatabasePlatform()->getName() !== 'mysql', 'Migration can only be executed safely on \'mysql\'.');
 
         $this->addSql('ALTER TABLE Charity ADD stripeAccountId VARCHAR(255) DEFAULT NULL');
-        $this->addSql('CREATE UNIQUE INDEX UNIQ_4CC08E8293A8A818 ON Charity (stripeAccountId)');
+        
     }
 

[NoCoverage] MethodCallRemoval
Migrations/Version20200720102604.php:32:9
     {
         $this->abortIf($this->connection->getDatabasePlatform()->getName() !== 'mysql', 'Migration can only be executed safely on \'mysql\'.');
 
-        $this->addSql('DROP INDEX UNIQ_4CC08E8293A8A818 ON Charity');
+        
         $this->addSql('ALTER TABLE Charity DROP stripeAccountId');
     }

[NoCoverage] MethodCallRemoval
Migrations/Version20200720102604.php:33:9
         $this->abortIf($this->connection->getDatabasePlatform()->getName() !== 'mysql', 'Migration can only be executed safely on \'mysql\'.');
 
         $this->addSql('DROP INDEX UNIQ_4CC08E8293A8A818 ON Charity');
-        $this->addSql('ALTER TABLE Charity DROP stripeAccountId');
+        
     }
 }
