[NoCoverage] MethodCallRemoval
Migrations/Version20200804150108.php:31:9
     {
         $this->abortIf($this->connection->getDatabasePlatform()->getName() !== 'mysql', 'Migration can only be executed safely on \'mysql\'.');
 
-        $this->addSql('ALTER TABLE Donation CHANGE charityComms charityComms TINYINT(1) NOT NULL, CHANGE giftAid giftAid TINYINT(1) NOT NULL, CHANGE tbgComms tbgComms TINYINT(1) NOT NULL');
+        
     }
 }
