[NoCoverage] MethodCallRemoval
Migrations/Version20200804164545.php:24:9
     {
         $this->abortIf($this->connection->getDatabasePlatform()->getName() !== 'mysql', 'Migration can only be executed safely on \'mysql\'.');
 
-        $this->addSql('ALTER TABLE Donation ADD donorHomeAddressLine1 VARCHAR(255) DEFAULT NULL, ADD donorHomePostcode VARCHAR(255) DEFAULT NULL, ADD tipGiftAid TINYINT(1) DEFAULT NULL');
+        
         $this->addSql('UPDATE Donation SET tipGiftAid = giftAid WHERE tipGiftAid IS NULL');
     }

[NoCoverage] MethodCallRemoval
Migrations/Version20200804164545.php:25:9
         $this->abortIf($this->connection->getDatabasePlatform()->getName() !== 'mysql', 'Migration can only be executed safely on \'mysql\'.');
 
         $this->addSql('ALTER TABLE Donation ADD donorHomeAddressLine1 VARCHAR(255) DEFAULT NULL, ADD donorHomePostcode VARCHAR(255) DEFAULT NULL, ADD tipGiftAid TINYINT(1) DEFAULT NULL');
-        $this->addSql('UPDATE Donation SET tipGiftAid = giftAid WHERE tipGiftAid IS NULL');
+        
     }
 

[NoCoverage] MethodCallRemoval
Migrations/Version20200804164545.php:32:9
     {
         $this->abortIf($this->connection->getDatabasePlatform()->getName() !== 'mysql', 'Migration can only be executed safely on \'mysql\'.');
 
-        $this->addSql('ALTER TABLE Donation DROP donorHomeAddressLine1, DROP donorHomePostcode, DROP tipGiftAid');
+        
     }
 }
