[NoCoverage] MethodCallRemoval
Migrations/Version20200826135513.php:24:9
     {
         $this->abortIf($this->connection->getDatabasePlatform()->getName() !== 'mysql', 'Migration can only be executed safely on \'mysql\'.');
 
-        $this->addSql('ALTER TABLE Donation ADD chargeId VARCHAR(255) DEFAULT NULL');
+        
         $this->addSql('CREATE UNIQUE INDEX UNIQ_C893E3F6402C829F ON Donation (chargeId)');
     }

[NoCoverage] MethodCallRemoval
Migrations/Version20200826135513.php:25:9
         $this->abortIf($this->connection->getDatabasePlatform()->getName() !== 'mysql', 'Migration can only be executed safely on \'mysql\'.');
 
         $this->addSql('ALTER TABLE Donation ADD chargeId VARCHAR(255) DEFAULT NULL');
-        $this->addSql('CREATE UNIQUE INDEX UNIQ_C893E3F6402C829F ON Donation (chargeId)');
+        
     }
 

[NoCoverage] MethodCallRemoval
Migrations/Version20200826135513.php:32:9
     {
         $this->abortIf($this->connection->getDatabasePlatform()->getName() !== 'mysql', 'Migration can only be executed safely on \'mysql\'.');
 
-        $this->addSql('DROP INDEX UNIQ_C893E3F6402C829F ON Donation');
+        
         $this->addSql('ALTER TABLE Donation DROP chargeId');
     }

[NoCoverage] MethodCallRemoval
Migrations/Version20200826135513.php:33:9
         $this->abortIf($this->connection->getDatabasePlatform()->getName() !== 'mysql', 'Migration can only be executed safely on \'mysql\'.');
 
         $this->addSql('DROP INDEX UNIQ_C893E3F6402C829F ON Donation');
-        $this->addSql('ALTER TABLE Donation DROP chargeId');
+        
     }
 }
