[NoCoverage] MethodCallRemoval
Migrations/Version20200925104750.php:25:9
         // this up() migration is auto-generated, please modify it to your needs
         $this->abortIf($this->connection->getDatabasePlatform()->getName() !== 'mysql', 'Migration can only be executed safely on \'mysql\'.');
 
-        $this->addSql('ALTER TABLE Donation ADD championComms TINYINT(1) DEFAULT NULL');
+        
     }
 

[NoCoverage] MethodCallRemoval
Migrations/Version20200925104750.php:33:9
         // this down() migration is auto-generated, please modify it to your needs
         $this->abortIf($this->connection->getDatabasePlatform()->getName() !== 'mysql', 'Migration can only be executed safely on \'mysql\'.');
 
-        $this->addSql('ALTER TABLE Donation DROP championComms');
+        
     }
 }
