[NoCoverage] MethodCallRemoval
Migrations/Version20201113093420.php:29:9
 SET salesforcePushStatus = 'not-sent'
 WHERE salesforcePushStatus = 'pending-update' AND (donorFirstName IS NULL OR donorLastName IS NULL)
 EOT;
-        $this->addSql($updateSql);
+        
     }
 
