[NoCoverage] MethodCallRemoval
Migrations/Version20210408183019.php:25:9
         $this->abortIf($this->connection->getDatabasePlatform()->getName() !== 'mysql', 'Migration can only be executed safely on \'mysql\'.');
 
         // Migration modified to first set up existing data with currencyCode 'GBP'.
-        $this->addSql('ALTER TABLE Campaign ADD currencyCode VARCHAR(3) NOT NULL DEFAULT \'GBP\'');
+        
         $this->addSql('ALTER TABLE CampaignFunding ADD currencyCode VARCHAR(3) NOT NULL DEFAULT \'GBP\'');
         $this->addSql('ALTER TABLE Donation ADD currencyCode VARCHAR(3) NOT NULL DEFAULT \'GBP\'');

[NoCoverage] MethodCallRemoval
Migrations/Version20210408183019.php:26:9
 
         // Migration modified to first set up existing data with currencyCode 'GBP'.
         $this->addSql('ALTER TABLE Campaign ADD currencyCode VARCHAR(3) NOT NULL DEFAULT \'GBP\'');
-        $this->addSql('ALTER TABLE CampaignFunding ADD currencyCode VARCHAR(3) NOT NULL DEFAULT \'GBP\'');
+        
         $this->addSql('ALTER TABLE Donation ADD currencyCode VARCHAR(3) NOT NULL DEFAULT \'GBP\'');
         $this->addSql('ALTER TABLE Fund ADD currencyCode VARCHAR(3) NOT NULL DEFAULT \'GBP\'');

[NoCoverage] MethodCallRemoval
Migrations/Version20210408183019.php:27:9
         // Migration modified to first set up existing data with currencyCode 'GBP'.
         $this->addSql('ALTER TABLE Campaign ADD currencyCode VARCHAR(3) NOT NULL DEFAULT \'GBP\'');
         $this->addSql('ALTER TABLE CampaignFunding ADD currencyCode VARCHAR(3) NOT NULL DEFAULT \'GBP\'');
-        $this->addSql('ALTER TABLE Donation ADD currencyCode VARCHAR(3) NOT NULL DEFAULT \'GBP\'');
+        
         $this->addSql('ALTER TABLE Fund ADD currencyCode VARCHAR(3) NOT NULL DEFAULT \'GBP\'');
 

[NoCoverage] MethodCallRemoval
Migrations/Version20210408183019.php:28:9
         $this->addSql('ALTER TABLE Campaign ADD currencyCode VARCHAR(3) NOT NULL DEFAULT \'GBP\'');
         $this->addSql('ALTER TABLE CampaignFunding ADD currencyCode VARCHAR(3) NOT NULL DEFAULT \'GBP\'');
         $this->addSql('ALTER TABLE Donation ADD currencyCode VARCHAR(3) NOT NULL DEFAULT \'GBP\'');
-        $this->addSql('ALTER TABLE Fund ADD currencyCode VARCHAR(3) NOT NULL DEFAULT \'GBP\'');
+        
 
         // Once this change is done, remove the defaults.

[NoCoverage] MethodCallRemoval
Migrations/Version20210408183019.php:31:9
         $this->addSql('ALTER TABLE Fund ADD currencyCode VARCHAR(3) NOT NULL DEFAULT \'GBP\'');
 
         // Once this change is done, remove the defaults.
-        $this->addSql('ALTER TABLE Campaign CHANGE currencyCode currencyCode VARCHAR(3) NOT NULL');
+        
         $this->addSql('ALTER TABLE CampaignFunding CHANGE currencyCode currencyCode VARCHAR(3) NOT NULL');
         $this->addSql('ALTER TABLE Donation CHANGE currencyCode currencyCode VARCHAR(3) NOT NULL');

[NoCoverage] MethodCallRemoval
Migrations/Version20210408183019.php:32:9
 
         // Once this change is done, remove the defaults.
         $this->addSql('ALTER TABLE Campaign CHANGE currencyCode currencyCode VARCHAR(3) NOT NULL');
-        $this->addSql('ALTER TABLE CampaignFunding CHANGE currencyCode currencyCode VARCHAR(3) NOT NULL');
+        
         $this->addSql('ALTER TABLE Donation CHANGE currencyCode currencyCode VARCHAR(3) NOT NULL');
         $this->addSql('ALTER TABLE Fund CHANGE currencyCode currencyCode VARCHAR(3) NOT NULL');

[NoCoverage] MethodCallRemoval
Migrations/Version20210408183019.php:33:9
         // Once this change is done, remove the defaults.
         $this->addSql('ALTER TABLE Campaign CHANGE currencyCode currencyCode VARCHAR(3) NOT NULL');
         $this->addSql('ALTER TABLE CampaignFunding CHANGE currencyCode currencyCode VARCHAR(3) NOT NULL');
-        $this->addSql('ALTER TABLE Donation CHANGE currencyCode currencyCode VARCHAR(3) NOT NULL');
+        
         $this->addSql('ALTER TABLE Fund CHANGE currencyCode currencyCode VARCHAR(3) NOT NULL');
     }

[NoCoverage] MethodCallRemoval
Migrations/Version20210408183019.php:34:9
         $this->addSql('ALTER TABLE Campaign CHANGE currencyCode currencyCode VARCHAR(3) NOT NULL');
         $this->addSql('ALTER TABLE CampaignFunding CHANGE currencyCode currencyCode VARCHAR(3) NOT NULL');
         $this->addSql('ALTER TABLE Donation CHANGE currencyCode currencyCode VARCHAR(3) NOT NULL');
-        $this->addSql('ALTER TABLE Fund CHANGE currencyCode currencyCode VARCHAR(3) NOT NULL');
+        
     }
 

[NoCoverage] MethodCallRemoval
Migrations/Version20210408183019.php:41:9
     {
         $this->abortIf($this->connection->getDatabasePlatform()->getName() !== 'mysql', 'Migration can only be executed safely on \'mysql\'.');
 
-        $this->addSql('ALTER TABLE Campaign DROP currencyCode');
+        
         $this->addSql('ALTER TABLE CampaignFunding DROP currencyCode');
         $this->addSql('ALTER TABLE Donation DROP currencyCode');

[NoCoverage] MethodCallRemoval
Migrations/Version20210408183019.php:42:9
         $this->abortIf($this->connection->getDatabasePlatform()->getName() !== 'mysql', 'Migration can only be executed safely on \'mysql\'.');
 
         $this->addSql('ALTER TABLE Campaign DROP currencyCode');
-        $this->addSql('ALTER TABLE CampaignFunding DROP currencyCode');
+        
         $this->addSql('ALTER TABLE Donation DROP currencyCode');
         $this->addSql('ALTER TABLE Fund DROP currencyCode');

[NoCoverage] MethodCallRemoval
Migrations/Version20210408183019.php:43:9
 
         $this->addSql('ALTER TABLE Campaign DROP currencyCode');
         $this->addSql('ALTER TABLE CampaignFunding DROP currencyCode');
-        $this->addSql('ALTER TABLE Donation DROP currencyCode');
+        
         $this->addSql('ALTER TABLE Fund DROP currencyCode');
     }

[NoCoverage] MethodCallRemoval
Migrations/Version20210408183019.php:44:9
         $this->addSql('ALTER TABLE Campaign DROP currencyCode');
         $this->addSql('ALTER TABLE CampaignFunding DROP currencyCode');
         $this->addSql('ALTER TABLE Donation DROP currencyCode');
-        $this->addSql('ALTER TABLE Fund DROP currencyCode');
+        
     }
 }
