[NoCoverage] MethodCallRemoval
Migrations/Version20210422163630.php:24:9
     {
         $this->abortIf($this->connection->getDatabasePlatform()->getName() !== 'mysql', 'Migration can only be executed safely on \'mysql\'.');
 
-        $this->addSql('ALTER TABLE Campaign ADD feePercentage NUMERIC(3, 1) DEFAULT NULL');
+        
     }
 

[NoCoverage] MethodCallRemoval
Migrations/Version20210422163630.php:31:9
     {
         $this->abortIf($this->connection->getDatabasePlatform()->getName() !== 'mysql', 'Migration can only be executed safely on \'mysql\'.');
 
-        $this->addSql('ALTER TABLE Campaign DROP feePercentage');
+        
     }
 }
