[NoCoverage] MethodCallRemoval
Migrations/Version20210907103000.php:24:9
     {
         $this->abortIf($this->connection->getDatabasePlatform()->getName() !== 'mysql', 'Migration can only be executed safely on \'mysql\'.');
 
-        $this->addSql("ALTER TABLE Donation ADD feeCoverAmount NUMERIC(18, 2) DEFAULT '0.00' NOT NULL");
+        
     }
 

[NoCoverage] MethodCallRemoval
Migrations/Version20210907103000.php:31:9
     {
         $this->abortIf($this->connection->getDatabasePlatform()->getName() !== 'mysql', 'Migration can only be executed safely on \'mysql\'.');
 
-        $this->addSql('ALTER TABLE Donation DROP feeCoverAmount');
+        
     }
 }
