[NoCoverage] MethodCallRemoval
Migrations/Version20211029152640.php:28:9
 
         // Set new collectedAt field to the best guess we have at roughly when the donation was completed by
         // the donor – this will be up to a few minutes before the real time for pre-existing donations.
-        $this->addSql("UPDATE Donation SET collectedAt = createdAt WHERE collectedAt IS NULL AND (donationStatus IN ('Collected', 'Paid'))");
+        
     }
 

[NoCoverage] MethodCallRemoval
Migrations/Version20211029152640.php:35:9
     {
         $this->abortIf($this->connection->getDatabasePlatform()->getName() !== 'mysql', 'Migration can only be executed safely on \'mysql\'.');
 
-        $this->addSql('ALTER TABLE Donation DROP collectedAt, DROP tbgShouldProcessGiftAid, DROP tbgGiftAidRequestQueuedAt, DROP tbgGiftAidRequestFailedAt');
+        
     }
 }
