[NoCoverage] MethodCallRemoval
Migrations/Version20211029163214.php:24:9
     {
         $this->abortIf($this->connection->getDatabasePlatform()->getName() !== 'mysql', 'Migration can only be executed safely on \'mysql\'.');
 
-        $this->addSql('ALTER TABLE Charity ADD hmrcReferenceNumber VARCHAR(7) DEFAULT NULL, ADD tbgClaimingGiftAid TINYINT(1) DEFAULT NULL');
+        
         $this->addSql('CREATE UNIQUE INDEX UNIQ_4CC08E829EF7853B ON Charity (hmrcReferenceNumber)');
 

[NoCoverage] MethodCallRemoval
Migrations/Version20211029163214.php:25:9
         $this->abortIf($this->connection->getDatabasePlatform()->getName() !== 'mysql', 'Migration can only be executed safely on \'mysql\'.');
 
         $this->addSql('ALTER TABLE Charity ADD hmrcReferenceNumber VARCHAR(7) DEFAULT NULL, ADD tbgClaimingGiftAid TINYINT(1) DEFAULT NULL');
-        $this->addSql('CREATE UNIQUE INDEX UNIQ_4CC08E829EF7853B ON Charity (hmrcReferenceNumber)');
+        
 
         // Set a non-null value for existing charities, without adding a schema `DEFAULT`.

[NoCoverage] MethodCallRemoval
Migrations/Version20211029163214.php:28:9
         $this->addSql('CREATE UNIQUE INDEX UNIQ_4CC08E829EF7853B ON Charity (hmrcReferenceNumber)');
 
         // Set a non-null value for existing charities, without adding a schema `DEFAULT`.
-        $this->addSql('UPDATE Charity SET tbgClaimingGiftAid = 0 WHERE tbgClaimingGiftAid IS NULL');
+        
     }
 

[NoCoverage] MethodCallRemoval
Migrations/Version20211029163214.php:35:9
     {
         $this->abortIf($this->connection->getDatabasePlatform()->getName() !== 'mysql', 'Migration can only be executed safely on \'mysql\'.');
 
-        $this->addSql('DROP INDEX UNIQ_4CC08E829EF7853B ON Charity');
+        
         $this->addSql('ALTER TABLE Charity DROP hmrcReferenceNumber, DROP tbgClaimingGiftAid');
     }

[NoCoverage] MethodCallRemoval
Migrations/Version20211029163214.php:36:9
         $this->abortIf($this->connection->getDatabasePlatform()->getName() !== 'mysql', 'Migration can only be executed safely on \'mysql\'.');
 
         $this->addSql('DROP INDEX UNIQ_4CC08E829EF7853B ON Charity');
-        $this->addSql('ALTER TABLE Charity DROP hmrcReferenceNumber, DROP tbgClaimingGiftAid');
+        
     }
 }
