[NoCoverage] MethodCallRemoval
Migrations/Version20211029225612.php:24:9
     {
         $this->abortIf($this->connection->getDatabasePlatform()->getName() !== 'mysql', 'Migration can only be executed safely on \'mysql\'.');
 
-        $this->addSql('ALTER TABLE Donation CHANGE collectedAt collectedAt DATETIME DEFAULT NULL');
+        
     }
 

[NoCoverage] MethodCallRemoval
Migrations/Version20211029225612.php:31:9
     {
         $this->abortIf($this->connection->getDatabasePlatform()->getName() !== 'mysql', 'Migration can only be executed safely on \'mysql\'.');
 
-        $this->addSql('ALTER TABLE Donation CHANGE collectedAt collectedAt DATETIME NOT NULL');
+        
     }
 }
