[NoCoverage] MethodCallRemoval
Migrations/Version20211209083200.php:30:9
 WHERE uuid = '096fe6fd-d8b0-42fd-806f-03bbdc54c092' AND transactionId = 'pi_3K1ZFYKkGuKkxwBN0IPLOiWS'
 LIMIT 1
 EOT;
-        $this->addSql($updateTipPartiallyRefundedDonation);
+        
 
         $updateDonorGAIncorrectlyClaimed = <<<EOT

[NoCoverage] MethodCallRemoval
Migrations/Version20211209083200.php:38:9
 WHERE uuid = '2417b8db-89b1-438b-a053-33e77c58303c' AND transactionId = 'pi_3K3zlfKkGuKkxwBN14bQcAKu'
 LIMIT 1
 EOT;
-        $this->addSql($updateDonorGAIncorrectlyClaimed);
+        
     }
 
