[NoCoverage] MethodCallRemoval
Migrations/Version20220104121300.php:31:9
 LIMIT 1
 EOT;
 
-        $this->addSql($updateIncorrectPostcode, [
-            'uuid' => '4f6804a9-6e2c-46de-9cb4-6bc59c380f90',
-            'paymentIntentId' => 'pi_3K2RMiKkGuKkxwBN0S5Uy9mP',
-        ]);
+        
         $this->addSql($updateIncorrectPostcode, [
             'uuid' => 'd957f281-d71b-45ba-8593-cf12f9203d5b',

[NoCoverage] MethodCallRemoval
Migrations/Version20220104121300.php:35:9
             'uuid' => '4f6804a9-6e2c-46de-9cb4-6bc59c380f90',
             'paymentIntentId' => 'pi_3K2RMiKkGuKkxwBN0S5Uy9mP',
         ]);
-        $this->addSql($updateIncorrectPostcode, [
-            'uuid' => 'd957f281-d71b-45ba-8593-cf12f9203d5b',
-            'paymentIntentId' => 'pi_3K2YigKkGuKkxwBN0re3gWSI',
-        ]);
+        
 
         $updateDonorGAIncorrectlyClaimed = <<<EOT

[NoCoverage] ArrayItemRemoval
Migrations/Version20220104121300.php:35:9
             'uuid' => '4f6804a9-6e2c-46de-9cb4-6bc59c380f90',
             'paymentIntentId' => 'pi_3K2RMiKkGuKkxwBN0S5Uy9mP',
         ]);
-        $this->addSql($updateIncorrectPostcode, [
-            'uuid' => 'd957f281-d71b-45ba-8593-cf12f9203d5b',
-            'paymentIntentId' => 'pi_3K2YigKkGuKkxwBN0re3gWSI',
-        ]);
+        $this->addSql($updateIncorrectPostcode, ['paymentIntentId' => 'pi_3K2YigKkGuKkxwBN0re3gWSI']);
 
         $updateDonorGAIncorrectlyClaimed = <<<EOT

[NoCoverage] MethodCallRemoval
Migrations/Version20220104121300.php:48:9
 LIMIT 1
 EOT;
 
-        $this->addSql($updateDonorGAIncorrectlyClaimed, [
-            'uuid' => 'b07e5700-ab97-4fd8-99d7-33c3fd5f0666',
-            'paymentIntentId' => 'pi_3K2DQDKkGuKkxwBN0rEMw2oz',
-        ]);
+        
         $this->addSql($updateDonorGAIncorrectlyClaimed, [
             'uuid' => 'bd7a0b27-bddf-4728-9e39-facc0f6b4172',

[NoCoverage] MethodCallRemoval
Migrations/Version20220104121300.php:52:9
             'uuid' => 'b07e5700-ab97-4fd8-99d7-33c3fd5f0666',
             'paymentIntentId' => 'pi_3K2DQDKkGuKkxwBN0rEMw2oz',
         ]);
-        $this->addSql($updateDonorGAIncorrectlyClaimed, [
-            'uuid' => 'bd7a0b27-bddf-4728-9e39-facc0f6b4172',
-            'paymentIntentId' => 'pi_3K3d9dKkGuKkxwBN1Dlln6TX',
-        ]);
+        
         $this->addSql($updateDonorGAIncorrectlyClaimed, [
             'uuid' => 'fe2c6084-61bc-4d65-b510-95cce859dc24',

[NoCoverage] MethodCallRemoval
Migrations/Version20220104121300.php:56:9
             'uuid' => 'bd7a0b27-bddf-4728-9e39-facc0f6b4172',
             'paymentIntentId' => 'pi_3K3d9dKkGuKkxwBN1Dlln6TX',
         ]);
-        $this->addSql($updateDonorGAIncorrectlyClaimed, [
-            'uuid' => 'fe2c6084-61bc-4d65-b510-95cce859dc24',
-            'paymentIntentId' => 'pi_3K1WhbKkGuKkxwBN0hXKeHh1',
-        ]);
+        
         $this->addSql($updateDonorGAIncorrectlyClaimed, [
             'uuid' => '5495a028-742e-4d71-9392-4a3cb722f595',

[NoCoverage] MethodCallRemoval
Migrations/Version20220104121300.php:60:9
             'uuid' => 'fe2c6084-61bc-4d65-b510-95cce859dc24',
             'paymentIntentId' => 'pi_3K1WhbKkGuKkxwBN0hXKeHh1',
         ]);
-        $this->addSql($updateDonorGAIncorrectlyClaimed, [
-            'uuid' => '5495a028-742e-4d71-9392-4a3cb722f595',
-            'paymentIntentId' => 'pi_3K3i7MKkGuKkxwBN1WWThUP3',
-        ]);
+        
         $this->addSql($updateDonorGAIncorrectlyClaimed, [
             'uuid' => '3f79c7ef-d6d1-406f-a2c8-80e006d17312',

[NoCoverage] MethodCallRemoval
Migrations/Version20220104121300.php:64:9
             'uuid' => '5495a028-742e-4d71-9392-4a3cb722f595',
             'paymentIntentId' => 'pi_3K3i7MKkGuKkxwBN1WWThUP3',
         ]);
-        $this->addSql($updateDonorGAIncorrectlyClaimed, [
-            'uuid' => '3f79c7ef-d6d1-406f-a2c8-80e006d17312',
-            'paymentIntentId' => 'pi_3K2YdQKkGuKkxwBN1SJh1OKF',
-        ]);
+        
     }
 
