[NoCoverage] MethodCallRemoval
Migrations/Version20220104135535.php:24:9
     {
         $this->abortIf($this->connection->getDatabasePlatform()->getName() !== 'mysql', 'Migration can only be executed safely on \'mysql\'.');
 
-        $this->addSql('ALTER TABLE Donation ADD transferId VARCHAR(255) DEFAULT NULL');
+        
         $this->addSql('CREATE UNIQUE INDEX UNIQ_C893E3F6AE9826DA ON Donation (transferId)');
     }

[NoCoverage] MethodCallRemoval
Migrations/Version20220104135535.php:25:9
         $this->abortIf($this->connection->getDatabasePlatform()->getName() !== 'mysql', 'Migration can only be executed safely on \'mysql\'.');
 
         $this->addSql('ALTER TABLE Donation ADD transferId VARCHAR(255) DEFAULT NULL');
-        $this->addSql('CREATE UNIQUE INDEX UNIQ_C893E3F6AE9826DA ON Donation (transferId)');
+        
     }
 

[NoCoverage] MethodCallRemoval
Migrations/Version20220104135535.php:32:9
     {
         $this->abortIf($this->connection->getDatabasePlatform()->getName() !== 'mysql', 'Migration can only be executed safely on \'mysql\'.');
 
-        $this->addSql('DROP INDEX UNIQ_C893E3F6AE9826DA ON Donation');
+        
         $this->addSql('ALTER TABLE Donation DROP transferId');
     }

[NoCoverage] MethodCallRemoval
Migrations/Version20220104135535.php:33:9
         $this->abortIf($this->connection->getDatabasePlatform()->getName() !== 'mysql', 'Migration can only be executed safely on \'mysql\'.');
 
         $this->addSql('DROP INDEX UNIQ_C893E3F6AE9826DA ON Donation');
-        $this->addSql('ALTER TABLE Donation DROP transferId');
+        
     }
 }
