[NoCoverage] DecrementInteger
Migrations/Version20220308132408.php:22:9
 
     public function up(Schema $schema): void
     {
-        $campaignId = 3076;
+        $campaignId = 3075;
         $this->addSql(
             'DELETE FROM Donation WHERE uuid = :uuid AND campaign_id = :campaignId LIMIT 1',

[NoCoverage] IncrementInteger
Migrations/Version20220308132408.php:22:9
 
     public function up(Schema $schema): void
     {
-        $campaignId = 3076;
+        $campaignId = 3077;
         $this->addSql(
             'DELETE FROM Donation WHERE uuid = :uuid AND campaign_id = :campaignId LIMIT 1',

[NoCoverage] MethodCallRemoval
Migrations/Version20220308132408.php:23:9
     public function up(Schema $schema): void
     {
         $campaignId = 3076;
-        $this->addSql(
-            'DELETE FROM Donation WHERE uuid = :uuid AND campaign_id = :campaignId LIMIT 1',
-            [
-                'campaignId' => $campaignId,
-                'uuid' => '846b5692-4ccb-4e88-9cf3-ea0223951ee7',
-            ],
-        );
+        
         $this->addSql(
             'DELETE FROM Campaign WHERE id = :campaignId AND salesforceId = :salesforceId LIMIT 1',

[NoCoverage] MethodCallRemoval
Migrations/Version20220308132408.php:30:9
                 'uuid' => '846b5692-4ccb-4e88-9cf3-ea0223951ee7',
             ],
         );
-        $this->addSql(
-            'DELETE FROM Campaign WHERE id = :campaignId AND salesforceId = :salesforceId LIMIT 1',
-            [
-                'campaignId' => $campaignId,
-                'salesforceId' => 'a0569000029jOkUAAU',
-            ],
-        );
+        
     }
 
