[NoCoverage] MethodCallRemoval
Migrations/Version20220318111320.php:23:9
 
     public function up(Schema $schema): void
     {
-        $this->addSql(<<<EOT
-            UPDATE Donation SET tbgShouldProcessGiftAid = 0
-            WHERE campaign_id IN (2078, 2165, 2454) AND tbgShouldProcessGiftAid = 1
-            LIMIT 52
-EOT
-        );
+        
     }
 
