[NoCoverage] MethodCallRemoval
Migrations/Version20220404153900.php:36:9
             '6091abe0-d06e-4ccf-9a8e-a3b553f7557b',
         ];
 
-        $this->addSql(<<<EOT
-UPDATE Donation
-SET
-    tbgGiftAidRequestConfirmedCompleteAt = NOW(),
-    tbgGiftAidRequestCorrelationId = :correlationId,
-    tbgGiftAidResponseDetail = :responseDetail
-WHERE
-    tbgGiftAidRequestQueuedAt IS NOT NULL AND
-    tbgGiftAidRequestConfirmedCompleteAt IS NULL AND
-    tbgGiftAidRequestCorrelationId IS NULL AND
-    uuid IN (:completeUuids)
-LIMIT 10
-EOT,
-            [
-                'correlationId' => '6DB2614C26324981B0CB34C19FE6FF00',
-                'responseDetail' => 'Thank you for your submission',
-                'completeUuids' => $donationIdsClaimed,
-            ],
-            // https://stackoverflow.com/a/36710894/2803757
-            [
-                'correlationId' => \PDO::PARAM_STR,
-                'responseDetail' => \PDO::PARAM_STR,
-                'completeUuids' => Connection::PARAM_STR_ARRAY,
-            ]
-        );
+        
 
         $this->addSQL(<<<EOT

[NoCoverage] MethodCallRemoval
Migrations/Version20220404153900.php:62:9
             ]
         );
 
-        $this->addSQL(<<<EOT
-UPDATE Donation
-SET tbgGiftAidRequestQueuedAt = NULL
-WHERE
-    tbgGiftAidRequestQueuedAt IS NOT NULL AND
-    tbgGiftAidRequestConfirmedCompleteAt IS NULL AND
-    tbgGiftAidRequestCorrelationId IS NULL AND
-    uuid NOT IN (:completeUuids)
-LIMIT 10
-EOT,
-            [
-                'completeUuids' => $donationIdsClaimed,
-            ],
-            // https://stackoverflow.com/a/36710894/2803757
-            [
-                'completeUuids' => Connection::PARAM_STR_ARRAY,
-            ]
-        );
+        
     }
 
