[NoCoverage] MethodCallRemoval
Migrations/Version20220404165640.php:51:9
             '71f8eaea-c6d1-49a0-b9ae-b95914f3cee1',
         ];
 
-        $this->addSql(<<<EOT
-UPDATE Donation
-SET
-    tbgGiftAidRequestConfirmedCompleteAt = NOW(),
-    tbgGiftAidRequestCorrelationId = :correlationId,
-    tbgGiftAidResponseDetail = :responseDetail
-WHERE
-    tbgGiftAidRequestQueuedAt IS NOT NULL AND
-    tbgGiftAidRequestConfirmedCompleteAt IS NULL AND
-    tbgGiftAidRequestCorrelationId IS NULL AND
-    uuid IN (:completeUuids)
-LIMIT 10
-EOT,
-            [
-                'correlationId' => $correlationId,
-                'responseDetail' => $responseDetail,
-                'completeUuids' => $donationIdsClaimed,
-            ],
-            // https://stackoverflow.com/a/36710894/2803757
-            [
-                'correlationId' => \PDO::PARAM_STR,
-                'responseDetail' => \PDO::PARAM_STR,
-                'completeUuids' => Connection::PARAM_STR_ARRAY,
-            ]
-        );
+        
 
         $this->addSQL(<<<EOT

[NoCoverage] ArrayItemRemoval
Migrations/Version20220404165640.php:64:13
     uuid IN (:completeUuids)
 LIMIT 10
 EOT,
-            [
-                'correlationId' => $correlationId,
-                'responseDetail' => $responseDetail,
-                'completeUuids' => $donationIdsClaimed,
-            ],
+            ['responseDetail' => $responseDetail, 'completeUuids' => $donationIdsClaimed],,
             // https://stackoverflow.com/a/36710894/2803757
             [

[NoCoverage] MethodCallRemoval
Migrations/Version20220404165640.php:77:9
             ]
         );
 
-        $this->addSQL(<<<EOT
-UPDATE Donation
-SET tbgGiftAidRequestQueuedAt = NULL
-WHERE
-    tbgGiftAidRequestQueuedAt IS NOT NULL AND
-    tbgGiftAidRequestConfirmedCompleteAt IS NULL AND
-    tbgGiftAidRequestCorrelationId IS NULL AND
-    uuid IN (:notCompleteUuids)
-LIMIT 10
-EOT,
-            [
-                'notCompleteUuids' => $donationIdsQueuedAndNotClaimed,
-            ],
-            // https://stackoverflow.com/a/36710894/2803757
-            [
-                'notCompleteUuids' => Connection::PARAM_STR_ARRAY,
-            ]
-        );
+        
     }
 

[NoCoverage] ArrayItemRemoval
Migrations/Version20220404165640.php:87:13
     uuid IN (:notCompleteUuids)
 LIMIT 10
 EOT,
-            [
-                'notCompleteUuids' => $donationIdsQueuedAndNotClaimed,
-            ],
+            [],,
             // https://stackoverflow.com/a/36710894/2803757
             [

[NoCoverage] ArrayItemRemoval
Migrations/Version20220404165640.php:91:13
                 'notCompleteUuids' => $donationIdsQueuedAndNotClaimed,
             ],
             // https://stackoverflow.com/a/36710894/2803757
-            [
-                'notCompleteUuids' => Connection::PARAM_STR_ARRAY,
-            ]
+            []
         );
     }
