[NoCoverage] MethodCallRemoval
Migrations/Version20220419180844.php:22:9
 
     public function up(Schema $schema): void
     {
-        $this->addSql('ALTER TABLE Charity ADD regulator VARCHAR(4) DEFAULT NULL, ADD regulatorNumber VARCHAR(10) DEFAULT NULL');
+        
     }
 

[NoCoverage] MethodCallRemoval
Migrations/Version20220419180844.php:27:9
 
     public function down(Schema $schema): void
     {
-        $this->addSql('ALTER TABLE Charity DROP regulator, DROP regulatorNumber');
+        
     }
 }
