[NoCoverage] MethodCallRemoval
Migrations/Version20220421090453.php:22:9
 
     public function up(Schema $schema): void
     {
-        $this->addSql(<<<EOT
-UPDATE Donation
-SET
-    tbgGiftAidRequestQueuedAt = NULL,
-    tbgGiftAidRequestFailedAt = NULL,
-    tbgGiftAidRequestConfirmedCompleteAt = NULL,
-    tbgGiftAidRequestCorrelationId = NULL,
-    tbgGiftAidResponseDetail = NULL
-WHERE
-    tbgGiftAidRequestQueuedAt IS NOT NULL
-    AND tbgGiftAidRequestQueuedAt < '2022-04-21 00:00:00'
-EOT);
+        
     }
 
