[NoCoverage] MethodCallRemoval
Migrations/Version20220421121601.php:22:9
 
     public function up(Schema $schema): void
     {
-        $this->addSql(<<<EOT
-UPDATE Donation
-SET
-    tbgGiftAidRequestQueuedAt = NULL,
-    tbgGiftAidRequestFailedAt = NULL,
-    tbgGiftAidRequestConfirmedCompleteAt = NULL,
-    tbgGiftAidRequestCorrelationId = NULL,
-    tbgGiftAidResponseDetail = NULL
-WHERE
-    tbgGiftAidRequestQueuedAt IS NOT NULL
-    AND tbgGiftAidRequestQueuedAt > '2022-04-21 00:00:00'
-    AND tbgGiftAidRequestQueuedAt < '2022-04-21 15:00:00'
-    AND tbgGiftAidRequestConfirmedCompleteAt IS NULL
-EOT); // Only reset things queued today (21 April) up to 16:00 BST.
+         // Only reset things queued today (21 April) up to 16:00 BST.
     }
 
