[NoCoverage] MethodCallRemoval
Migrations/Version20220531094925.php:26:9
     public function up(Schema $schema): void
     {
         // MAT-246.
-        $this->addSql(<<<EOT
-            UPDATE Donation SET tbgShouldProcessGiftAid = 0
-            WHERE campaign_id = :campaignId AND
-                  giftAid = 1 AND
-                  tbgShouldProcessGiftAid = 1
-            LIMIT 76
-EOT,
-            [
-                'campaignId' => 3016, // The one campaign for internal Charity ID 1632.
-            ],
-        );
+        
 
         // MAT-250. 25 donations to the affected charity not fully processed.

[NoCoverage] DecrementInteger
Migrations/Version20220531094925.php:34:17
             LIMIT 76
 EOT,
             [
-                'campaignId' => 3016, // The one campaign for internal Charity ID 1632.
+                , ['campaignId' => 3015]);
             ],
         );

[NoCoverage] IncrementInteger
Migrations/Version20220531094925.php:34:17
             LIMIT 76
 EOT,
             [
-                'campaignId' => 3016, // The one campaign for internal Charity ID 1632.
+                , ['campaignId' => 3017]);
             ],
         );

[NoCoverage] MethodCallRemoval
Migrations/Version20220531094925.php:39:9
         );
 
         // MAT-250. 25 donations to the affected charity not fully processed.
-        $this->addSql(<<<EOT
-UPDATE Donation
-SET
-    tbgGiftAidRequestQueuedAt = NULL,
-    tbgGiftAidRequestFailedAt = NULL,
-    tbgGiftAidRequestConfirmedCompleteAt = NULL,
-    tbgGiftAidRequestCorrelationId = NULL,
-    tbgGiftAidResponseDetail = NULL
-WHERE
-    tbgGiftAidRequestQueuedAt IS NOT NULL AND
-    tbgGiftAidRequestCorrelationId IN (:correlationIdsToResubmit)
-LIMIT 25
-EOT,
-            [
-                'correlationIdsToResubmit' => [
-                    '271C66984399459FB28366A527897AB6',
-                    '3AE1F6653D9F43C795E570DDA5C5E83C',
-                    '8E237A0CB284419C98F1EC0DFB40B38B',
-                ],
-            ],
-            // https://stackoverflow.com/a/36710894/2803757
-            [
-                'correlationIdsToResubmit' => Connection::PARAM_STR_ARRAY,
-            ]
-        );
+        
     }
 

[NoCoverage] ArrayItemRemoval
Migrations/Version20220531094925.php:60:13
                 ],
             ],
             // https://stackoverflow.com/a/36710894/2803757
-            [
-                'correlationIdsToResubmit' => Connection::PARAM_STR_ARRAY,
-            ]
+            []
         );
     }
