[NoCoverage] IncrementInteger
Migrations/Version20221004134449.php:23:9
 
     public function up(Schema $schema): void
     {
-        $campaignIds = [1805, 2758, 2469];
+        $campaignIds = [1805, 2758, 2470];
         $this->addSql(<<<EOT
 UPDATE Donation

[NoCoverage] DecrementInteger
Migrations/Version20221004134449.php:23:9
 
     public function up(Schema $schema): void
     {
-        $campaignIds = [1805, 2758, 2469];
+        $campaignIds = [1805, 2757, 2469];
         $this->addSql(<<<EOT
 UPDATE Donation

[NoCoverage] MethodCallRemoval
Migrations/Version20221004134449.php:24:9
     public function up(Schema $schema): void
     {
         $campaignIds = [1805, 2758, 2469];
-        $this->addSql(<<<EOT
-UPDATE Donation
-SET
-    tbgGiftAidRequestQueuedAt = NULL,
-    tbgGiftAidRequestFailedAt = NULL,
-    tbgGiftAidRequestConfirmedCompleteAt = NULL,
-    tbgGiftAidRequestCorrelationId = NULL,
-    tbgGiftAidResponseDetail = NULL
-WHERE
-    campaign_id IN (:campaignIdsToRequeue) AND
-    tbgGiftAidRequestQueuedAt IS NOT NULL AND
-    giftAid = 1 AND
-    tbgShouldProcessGiftAid = 1
-LIMIT 130
-EOT,
-            ['campaignIdsToRequeue' => $campaignIds],
-            ['campaignIdsToRequeue' => Connection::PARAM_INT_ARRAY],
-        );
+        
     }
     public function down(Schema $schema): void

[NoCoverage] ArrayItemRemoval
Migrations/Version20221004134449.php:40:13
 LIMIT 130
 EOT,
             ['campaignIdsToRequeue' => $campaignIds],
-            ['campaignIdsToRequeue' => Connection::PARAM_INT_ARRAY],
+            , ['campaignIdsToRequeue' => $campaignIds], []);
         );
     }
