[NoCoverage] MethodCallRemoval
Migrations/Version20221021174752.php:28:9
 WHERE salesforceId = :sfId
 LIMIT 1
 EOT;
-        $this->addSql($updateSql, [
-            'sfId' => 'a066900001u4YTvAAM',
-        ]);
+        
     }
 

[NoCoverage] ArrayItemRemoval
Migrations/Version20221021174752.php:28:9
 WHERE salesforceId = :sfId
 LIMIT 1
 EOT;
-        $this->addSql($updateSql, [
-            'sfId' => 'a066900001u4YTvAAM',
-        ]);
+        $this->addSql($updateSql, []);
     }
 
