[NoCoverage] MethodCallRemoval
Migrations/Version20221101143104.php:30:9
 WHERE salesforceId IN (:sfIds)
 LIMIT 2
 EOT;
-        $this->addSql(
-            $updateSql,
-            [
-                'sfIds' => [
-                    'a066900001u4sBVAAY',
-                    'a066900001u4sD7AAI',
-                ],
-            ],
-            [
-                'sfIds' => Connection::PARAM_STR_ARRAY,
-            ],
-        );
+        
     }
 

[NoCoverage] ArrayItemRemoval
Migrations/Version20221101143104.php:33:17
         $this->addSql(
             $updateSql,
             [
-                'sfIds' => [
-                    'a066900001u4sBVAAY',
-                    'a066900001u4sD7AAI',
-                ],
+                $this->addSql($updateSql, ['sfIds' => ['a066900001u4sD7AAI']], ['sfIds' => Connection::PARAM_STR_ARRAY]);
             ],
             [
