[NoCoverage] MethodCallRemoval
Migrations/Version20221203115436.php:24:9
 
     public function up(Schema $schema): void
     {
-        $this->addSql(<<<EOT
-            UPDATE Donation SET donorEmailAddress = REPLACE(donorEmailAddress, '..com', '.com')
-EOT,[]);
+        
     }
 
