[NoCoverage] MethodCallRemoval
Migrations/Version20221205110006.php:21:9
     }
     public function up(Schema $schema): void
     {
-        $this->addSql('CREATE INDEX end_date_and_is_matched ON Campaign (endDate, isMatched)');
+        
         $this->addSql('CREATE INDEX campaign_and_status ON Donation (campaign_id, donationStatus)');
     }

[NoCoverage] MethodCallRemoval
Migrations/Version20221205110006.php:22:9
     public function up(Schema $schema): void
     {
         $this->addSql('CREATE INDEX end_date_and_is_matched ON Campaign (endDate, isMatched)');
-        $this->addSql('CREATE INDEX campaign_and_status ON Donation (campaign_id, donationStatus)');
+        
     }
 

[NoCoverage] MethodCallRemoval
Migrations/Version20221205110006.php:27:9
 
     public function down(Schema $schema): void
     {
-        $this->addSql('DROP INDEX end_date_and_is_matched ON Campaign');
+        
         $this->addSql('DROP INDEX campaign_and_status ON Donation');
     }

[NoCoverage] MethodCallRemoval
Migrations/Version20221205110006.php:28:9
     public function down(Schema $schema): void
     {
         $this->addSql('DROP INDEX end_date_and_is_matched ON Campaign');
-        $this->addSql('DROP INDEX campaign_and_status ON Donation');
+        
     }
 }
