[NoCoverage] MethodCallRemoval
Migrations/Version20221213144526.php:19:9
 
     public function up(Schema $schema): void
     {
-        $this->addSql(<<<'SQL'
-                UPDATE Donation 
-                set giftAid = 0, tipGiftAid = 0, salesforcePushStatus = 'pending-update'
-                WHERE Donation.salesforceId IN ('a066900001vWmAaAAK', 'a066900001vWlRHAA0', 'a066900001vVkwZAAS') LIMIT 3
-            SQL
-        );
+        
     }
     public function down(Schema $schema): void

[NoCoverage] Throw_
Migrations/Version20221213144526.php:28:9
     }
     public function down(Schema $schema): void
     {
-        throw new \Exception('no going back');
+        new \Exception('no going back');
     }
 }
