[NoCoverage] MethodCallRemoval
Migrations/Version20221214100808.php:19:9
 
     public function up(Schema $schema): void
     {
-        $this->addSql(<<<'SQL'
-                UPDATE Donation 
-                set amount = 450 , salesforcePushStatus = 'pending-update'
-                WHERE uuid = "dcec4e60-8969-4f40-80f0-35bb5b7184af" LIMIT 1
-            SQL
-        );
+        
     }
 
