[NoCoverage] MethodCallRemoval
Migrations/Version20230110140053.php:22:9
 
     public function up(Schema $schema): void
     {
-        $this->addSql('OPTIMIZE TABLE Donation');
+        
         $this->addSql('OPTIMIZE TABLE FundingWithdrawal');
     }

[NoCoverage] MethodCallRemoval
Migrations/Version20230110140053.php:23:9
     public function up(Schema $schema): void
     {
         $this->addSql('OPTIMIZE TABLE Donation');
-        $this->addSql('OPTIMIZE TABLE FundingWithdrawal');
+        
     }
 
