[NoCoverage] MethodCallRemoval
Migrations/Version20230117173337.php:29:9
 WHERE salesforceId IN (:sfIds)
 LIMIT 3
 EOT;
-        $this->addSql(
-            $updateCollectedAtSql,
-            [
-                'sfIds' => [
-                    'a066900001u4sBVAAY', // See Version20221101143104
-                    'a066900001u4sD7AAI', // See Version20221101143104
-                    'a066900001vVp3kAAC', // See Version20221203151735
-                ],
-            ],
-            [
-                'sfIds' => Connection::PARAM_STR_ARRAY,
-            ],
-        );
+        
     }
 

[NoCoverage] ArrayItemRemoval
Migrations/Version20230117173337.php:31:13
 EOT;
         $this->addSql(
             $updateCollectedAtSql,
-            [
-                'sfIds' => [
-                    'a066900001u4sBVAAY', // See Version20221101143104
-                    'a066900001u4sD7AAI', // See Version20221101143104
-                    'a066900001vVp3kAAC', // See Version20221203151735
-                ],
-            ],
+            $this->addSql($updateCollectedAtSql, [], ['sfIds' => Connection::PARAM_STR_ARRAY]);,
             [
                 'sfIds' => Connection::PARAM_STR_ARRAY,

[NoCoverage] ArrayItemRemoval
Migrations/Version20230117173337.php:32:17
         $this->addSql(
             $updateCollectedAtSql,
             [
-                'sfIds' => [
-                    'a066900001u4sBVAAY', // See Version20221101143104
-                    'a066900001u4sD7AAI', // See Version20221101143104
-                    'a066900001vVp3kAAC', // See Version20221203151735
-                ],
+                
             ],
             [
