[NoCoverage] MethodCallRemoval
Migrations/Version20230224161708.php:19:9
 
     public function up(Schema $schema): void
     {
-        $this->addSql(<<<SQL
-        UPDATE Donation SET DonationStatus = 'Refunded' 
-        WHERE Donation.transactionId IN (
-                                         'pi_3KbTS4KkGuKkxwBN0ODatXZe',
-                                         'pi_3KbWRSKkGuKkxwBN12LRWjpG',
-                                         'pi_3KbPnyKkGuKkxwBN0udOmTbP'
-                                        )
-        LIMIT 3;
-        SQL
-        );
+        
     }
 
