[NoCoverage] MethodCallRemoval
Migrations/Version20230622095211.php:19:9
 
     public function up(Schema $schema): void
     {
-        $this->addSql('ALTER TABLE Donation ADD refundedAt DATETIME DEFAULT NULL COMMENT \'(DC2Type:datetime_immutable)\' AFTER collectedAt');
+        
     }
 

[NoCoverage] MethodCallRemoval
Migrations/Version20230622095211.php:24:9
 
     public function down(Schema $schema): void
     {
-        $this->addSql('ALTER TABLE Donation DROP refundedAt');
+        
     }
 }
