[NoCoverage] MethodCallRemoval
Migrations/Version20230707100241.php:22:9
 
     public function up(Schema $schema): void
     {
-        $this->addSql(<<<SQL
-            UPDATE Donation
-            SET
-                tbgGiftAidRequestQueuedAt = NULL,
-                tbgGiftAidRequestFailedAt = NULL,
-                tbgGiftAidRequestConfirmedCompleteAt = NULL,
-                tbgGiftAidRequestCorrelationId = NULL,
-                tbgGiftAidResponseDetail = NULL
-            WHERE
-                campaign_id = 4635 AND
-                giftAid = 1 AND
-                tbgShouldProcessGiftAid = 1 AND
-                tbgGiftAidRequestCorrelationId IS NOT NULL AND
-                donationStatus = 'Paid'
-            LIMIT 224;
-        SQL
-        );
+        
     }
 
