[NoCoverage] MethodCallRemoval
Migrations/Version20230801110114.php:20:9
     public function up(Schema $schema): void
     {
         // SQL copied from \MatchBot\Migrations\Version20230707100241, campaign id changed.
-        $this->addSql(<<<SQL
-            UPDATE Donation
-            SET
-                tbgGiftAidRequestQueuedAt = NULL,
-                tbgGiftAidRequestFailedAt = NULL,
-                tbgGiftAidRequestConfirmedCompleteAt = NULL,
-                tbgGiftAidRequestCorrelationId = NULL,
-                tbgGiftAidResponseDetail = NULL
-            WHERE
-                campaign_id = 4644 AND
-                giftAid = 1 AND
-                tbgShouldProcessGiftAid = 1 AND
-                tbgGiftAidRequestCorrelationId IS NOT NULL AND
-                donationStatus = 'Paid'
-            LIMIT 97;
-        SQL
-        );
+        
     }
 

[NoCoverage] Throw_
Migrations/Version20230801110114.php:41:9
 
     public function down(Schema $schema): void
     {
-        throw new \Exception("No going back");
+        new \Exception("No going back");
     }
 }
