[NoCoverage] IncrementInteger
Migrations/Version20230907114841.php:22:9
 
     public function up(Schema $schema): void
     {
-        $campaignIdForMAT311 = 4661;
+        $campaignIdForMAT311 = 4662;
 
         $this->addSql(<<<SQL

[NoCoverage] DecrementInteger
Migrations/Version20230907114841.php:22:9
 
     public function up(Schema $schema): void
     {
-        $campaignIdForMAT311 = 4661;
+        $campaignIdForMAT311 = 4660;
 
         $this->addSql(<<<SQL

[NoCoverage] MethodCallRemoval
Migrations/Version20230907114841.php:24:9
     {
         $campaignIdForMAT311 = 4661;
 
-        $this->addSql(<<<SQL
-            UPDATE Donation
-            SET
-                tbgGiftAidRequestQueuedAt = NULL,
-                tbgGiftAidRequestFailedAt = NULL,
-                tbgGiftAidRequestConfirmedCompleteAt = NULL,
-                tbgGiftAidRequestCorrelationId = NULL,
-                tbgGiftAidResponseDetail = NULL
-            WHERE
-                campaign_id = $campaignIdForMAT311 AND
-                giftAid = 1 AND
-                tbgShouldProcessGiftAid = 1 AND
-                tbgGiftAidRequestCorrelationId IS NOT NULL AND
-                donationStatus = 'Paid'
-            LIMIT 218;
-        SQL
-        );
+        
     }
 
