[NoCoverage] MethodCallRemoval
Migrations/Version20230913111156.php:22:9
 
     public function up(Schema $schema): void
     {
-        $this->addSql('ALTER TABLE Charity DROP donateLinkId');
+        
     }
 

[NoCoverage] MethodCallRemoval
Migrations/Version20230913111156.php:27:9
 
     public function down(Schema $schema): void
     {
-        $this->addSql('ALTER TABLE Charity ADD donateLinkId VARCHAR(255) NOT NULL');
+        
     }
 }
