[NoCoverage] MethodCallRemoval
Migrations/Version20230925121435.php:19:9
 
     public function up(Schema $schema): void
     {
-        $this->addSql('ALTER TABLE Donation DROP clientSecret');
+        
     }
 

[NoCoverage] MethodCallRemoval
Migrations/Version20230925121435.php:24:9
 
     public function down(Schema $schema): void
     {
-        $this->addSql('ALTER TABLE Donation ADD clientSecret VARCHAR(255) DEFAULT NULL');
+        
     }
 }
