[NoCoverage] MethodCallRemoval
Migrations/Version20230929135818.php:22:9
 
     public function up(Schema $schema): void
     {
-        $this->addSql('ALTER TABLE Donation CHANGE collectedAt collectedAt DATETIME DEFAULT NULL COMMENT \'(DC2Type:datetime_immutable)\'');
+        
     }
 

[NoCoverage] MethodCallRemoval
Migrations/Version20230929135818.php:27:9
 
     public function down(Schema $schema): void
     {
-        $this->addSql('ALTER TABLE Donation CHANGE collectedAt collectedAt DATETIME DEFAULT NULL');
+        
     }
 }
