[NoCoverage] MethodCallRemoval
Migrations/Version20231016115215.php:29:9
     public function down(Schema $schema): void
     {
         // this down() migration is auto-generated, please modify it to your needs
-        $this->addSql('DROP TABLE DonorAccount');
+        
     }
 }
