[NoCoverage] MethodCallRemoval
Migrations/Version20231016160140.php:19:9
 
     public function up(Schema $schema): void
     {
-        $this->addSql('ALTER TABLE DonorAccount ADD createdAt DATETIME NOT NULL, ADD updatedAt DATETIME NOT NULL');
+        
     }
 

[NoCoverage] MethodCallRemoval
Migrations/Version20231016160140.php:24:9
 
     public function down(Schema $schema): void
     {
-        $this->addSql('ALTER TABLE DonorAccount DROP createdAt, DROP updatedAt');
+        
     }
 }
