[NoCoverage] MethodCallRemoval
Migrations/Version20231016174027.php:19:9
 
     public function up(Schema $schema): void
     {
-        $this->addSql('ALTER TABLE DonorAccount ADD donorName_first VARCHAR(255) NOT NULL, ADD donorName_last VARCHAR(255) NOT NULL');
+        
     }
 

[NoCoverage] MethodCallRemoval
Migrations/Version20231016174027.php:24:9
 
     public function down(Schema $schema): void
     {
-        $this->addSql('ALTER TABLE DonorAccount DROP donorName_first, DROP donorName_last');
+        
     }
 }
