[NoCoverage] MethodCallRemoval
Migrations/Version20231018104935.php:25:9
     public function up(Schema $schema): void
     {
         // we have a duplicate already in staging, but we don't care much about any of the data in this table yet.
-        $this->addSql('DELETE FROM DonorAccount WHERE ID > 0');
+        
         $this->addSql('CREATE UNIQUE INDEX UNIQ_STRIPE_ID ON DonorAccount(stripeCustomerId) ');
     }

[NoCoverage] MethodCallRemoval
Migrations/Version20231018104935.php:26:9
     {
         // we have a duplicate already in staging, but we don't care much about any of the data in this table yet.
         $this->addSql('DELETE FROM DonorAccount WHERE ID > 0');
-        $this->addSql('CREATE UNIQUE INDEX UNIQ_STRIPE_ID ON DonorAccount(stripeCustomerId) ');
+        
     }
 

[NoCoverage] MethodCallRemoval
Migrations/Version20231018104935.php:31:9
 
     public function down(Schema $schema): void
     {
-        $this->addSql('DROP INDEX UNIQ_STRIPE_ID ON DonorAccount');
+        
 
     }
