[NoCoverage] GreaterThanOrEqualToNegotiation
Monolog/Handler/SlackHandler.php:31:9
 
     public function isHandling(array $record): bool
     {
-        return $record['level'] >= Logger::ERROR;
+        return $record['level'] < Logger::ERROR;
     }
 

[NoCoverage] GreaterThanOrEqualTo
Monolog/Handler/SlackHandler.php:31:9
 
     public function isHandling(array $record): bool
     {
-        return $record['level'] >= Logger::ERROR;
+        return $record['level'] > Logger::ERROR;
     }
 

[NoCoverage] LessThan
Monolog/Handler/SlackHandler.php:39:9
      */
     public function handle(array|\ArrayAccess $record): bool
     {
-        if ($record['level'] < Logger::ERROR) {
+        if ($record['level'] <= Logger::ERROR) {
             return false; // allows another handle to handle this.
          }

[NoCoverage] LessThanNegotiation
Monolog/Handler/SlackHandler.php:39:9
      */
     public function handle(array|\ArrayAccess $record): bool
     {
-        if ($record['level'] < Logger::ERROR) {
+        if ($record['level'] >= Logger::ERROR) {
             return false; // allows another handle to handle this.
          }

[NoCoverage] FalseValue
Monolog/Handler/SlackHandler.php:40:13
     public function handle(array|\ArrayAccess $record): bool
     {
         if ($record['level'] < Logger::ERROR) {
-            return false; // allows another handle to handle this.
+            return true;
          }
 

[NoCoverage] IncrementInteger
Monolog/Handler/SlackHandler.php:48:9
 
         $lines = explode(PHP_EOL, $message);
 
-        $messageFirstLine = $lines[0] ?? '';
+        $messageFirstLine = $lines[1] ?? '';
         $messageFirstSeveralLines = implode(\PHP_EOL, array_slice($lines,0,9)) . \PHP_EOL;
 

[NoCoverage] Coalesce
Monolog/Handler/SlackHandler.php:48:9
 
         $lines = explode(PHP_EOL, $message);
 
-        $messageFirstLine = $lines[0] ?? '';
+        $messageFirstLine = '' ?? $lines[0];
         $messageFirstSeveralLines = implode(\PHP_EOL, array_slice($lines,0,9)) . \PHP_EOL;
 

[NoCoverage] ConcatOperandRemoval
Monolog/Handler/SlackHandler.php:49:9
         $lines = explode(PHP_EOL, $message);
 
         $messageFirstLine = $lines[0] ?? '';
-        $messageFirstSeveralLines = implode(\PHP_EOL, array_slice($lines,0,9)) . \PHP_EOL;
+        $messageFirstSeveralLines = \PHP_EOL;
 
         $heading = "Matchbot $levelName: $messageFirstLine";

[NoCoverage] DecrementInteger
Monolog/Handler/SlackHandler.php:49:9
         $lines = explode(PHP_EOL, $message);
 
         $messageFirstLine = $lines[0] ?? '';
-        $messageFirstSeveralLines = implode(\PHP_EOL, array_slice($lines,0,9)) . \PHP_EOL;
+        $messageFirstSeveralLines = implode(\PHP_EOL, array_slice($lines, 0, 8)) . \PHP_EOL;
 
         $heading = "Matchbot $levelName: $messageFirstLine";

[NoCoverage] IncrementInteger
Monolog/Handler/SlackHandler.php:57:13
         $options = (new SlackOptions())
             // For now, do a simple truncate at the max, 150 chars, since most messages are shorter and the next line
             // has the full text anyway.
-            ->block((new SlackHeaderBlock(substr($heading, 0, 150))))
+            $options = (new SlackOptions())->block(new SlackHeaderBlock(substr($heading, 1, 150)))->block((new SlackSectionBlock())->text($messageFirstSeveralLines));
             ->block((new SlackSectionBlock())->text($messageFirstSeveralLines));
         $chatMessage->options($options);

[NoCoverage] UnwrapSubstr
Monolog/Handler/SlackHandler.php:57:13
         $options = (new SlackOptions())
             // For now, do a simple truncate at the max, 150 chars, since most messages are shorter and the next line
             // has the full text anyway.
-            ->block((new SlackHeaderBlock(substr($heading, 0, 150))))
+            $options = (new SlackOptions())->block(new SlackHeaderBlock($heading))->block((new SlackSectionBlock())->text($messageFirstSeveralLines));
             ->block((new SlackSectionBlock())->text($messageFirstSeveralLines));
         $chatMessage->options($options);

[NoCoverage] MethodCallRemoval
Monolog/Handler/SlackHandler.php:59:9
             // has the full text anyway.
             ->block((new SlackHeaderBlock(substr($heading, 0, 150))))
             ->block((new SlackSectionBlock())->text($messageFirstSeveralLines));
-        $chatMessage->options($options);
+        
 
         $this->slackConnction->send($chatMessage);

[NoCoverage] MethodCallRemoval
Monolog/Handler/SlackHandler.php:61:9
             ->block((new SlackSectionBlock())->text($messageFirstSeveralLines));
         $chatMessage->options($options);
 
-        $this->slackConnction->send($chatMessage);
+        
 
         return false; // record will go to other handlers in addition to being sent to slack.

[NoCoverage] FalseValue
Monolog/Handler/SlackHandler.php:63:9
 
         $this->slackConnction->send($chatMessage);
 
-        return false; // record will go to other handlers in addition to being sent to slack.
+        return true;
     }
 

[NoCoverage] Foreach_
Monolog/Handler/SlackHandler.php:68:9
 
     public function handleBatch(array $records): void
     {
-        foreach ($records as $record) {
-            $this->handle($record);
-        }
+        foreach (array() as $record) {
     }
 

[NoCoverage] MethodCallRemoval
Monolog/Handler/SlackHandler.php:69:13
     public function handleBatch(array $records): void
     {
         foreach ($records as $record) {
-            $this->handle($record);
+            
         }
     }
