[Killed] LogicalNot
Monolog/Processor/AwsTraceIdProcessor.php:14:9
     public function __invoke(array|\ArrayAccess $record): array
     {
         $traceId = $_SERVER['HTTP_X_AMZN_TRACE_ID'] ?? null;
-        if (!empty($traceId)) {
+        if (empty($traceId)) {
             $record['extra']['x-amzn-trace-id'] = $traceId;
         }
killedBy: MatchBot\Tests\Monolog\Processor\AwsTraceIdProcessorTest::testContextAdded
statusReason: 1) MatchBot\Tests\Monolog\Processor\AwsTraceIdProcessorTest::testContextAdded
Undefined array key "x-amzn-trace-id"

/home/barney/projects/matchbot/tests/Monolog/Processor/AwsTraceIdProcessorTest.php:62

ERRORS!
Tests: 1, Assertions: 2, Errors: 1.
