1) /home/barney/projects/matchbot/src/Application/Actions/Action.php:72    [M] FalseValue

--- Original
+++ New
@@ @@
      *                                      avoid noise from known issues.
      * @return Response with 400 HTTP response code.
      */
-    protected function validationError(Response $response, string $logMessage, ?string $publicMessage = null, bool $reduceSeverity = false) : Response
+    protected function validationError(Response $response, string $logMessage, ?string $publicMessage = null, bool $reduceSeverity = true) : Response
     {
         if ($reduceSeverity) {
             $this->logger->info($logMessage);

2) /home/barney/projects/matchbot/src/Application/Actions/Action.php:74    [M] IfNegation

--- Original
+++ New
@@ @@
      */
     protected function validationError(Response $response, string $logMessage, ?string $publicMessage = null, bool $reduceSeverity = false) : Response
     {
-        if ($reduceSeverity) {
+        if (!$reduceSeverity) {
             $this->logger->info($logMessage);
         } else {
             $this->logger->warning($logMessage);

5) /home/barney/projects/matchbot/src/Application/Actions/ActionPayload.php:14    [M] DecrementInteger

--- Original
+++ New
@@ @@
 class ActionPayload implements JsonSerializable
 {
     #[Pure]
-    public function __construct(private int $statusCode = 200, private array|object|null $data = null, private ?ActionError $error = null)
+    public function __construct(private int $statusCode = 199, private array|object|null $data = null, private ?ActionError $error = null)
     {
     }
     /**

6) /home/barney/projects/matchbot/src/Application/Actions/ActionPayload.php:14    [M] IncrementInteger

--- Original
+++ New
@@ @@
 class ActionPayload implements JsonSerializable
 {
     #[Pure]
-    public function __construct(private int $statusCode = 200, private array|object|null $data = null, private ?ActionError $error = null)
+    public function __construct(private int $statusCode = 201, private array|object|null $data = null, private ?ActionError $error = null)
     {
     }
     /**

7) /home/barney/projects/matchbot/src/Application/Actions/DeletePaymentMethod.php:51    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $allPaymentMethodsOfCustomer = $this->stripeClient->customers->allPaymentMethods($customerId)->toArray()['data'];
         $allCustomersPaymentMethodIds = array_map(static fn(array $pm): string => $pm['id'], $allPaymentMethodsOfCustomer);
         if (!in_array($paymentMethodId, $allCustomersPaymentMethodIds, true)) {
-            $this->logger->warning("Refusing to delete stripe payment method as not found for customer", compact('customerId', 'paymentMethodId'));
+            
             return $this->respondWithData($response, ['error' => 'Payment method not found'], StatusCodeInterface::STATUS_BAD_REQUEST);
         }
         try {

8) /home/barney/projects/matchbot/src/Application/Actions/DeletePaymentMethod.php:58    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         $allCustomersPaymentMethodIds = array_map(static fn(array $pm): string => $pm['id'], $allPaymentMethodsOfCustomer);
         if (!in_array($paymentMethodId, $allCustomersPaymentMethodIds, true)) {
             $this->logger->warning("Refusing to delete stripe payment method as not found for customer", compact('customerId', 'paymentMethodId'));
-            return $this->respondWithData($response, ['error' => 'Payment method not found'], StatusCodeInterface::STATUS_BAD_REQUEST);
+            return $this->respondWithData($response, [], StatusCodeInterface::STATUS_BAD_REQUEST);
         }
         try {
             $this->stripeClient->paymentMethods->detach($paymentMethodId);

9) /home/barney/projects/matchbot/src/Application/Actions/Donations/Confirm.php:67    [M] DecrementInteger

--- Original
+++ New
@@ @@
     protected function action(Request $request, Response $response, array $args) : Response
     {
         try {
-            $requestBody = json_decode($request->getBody()->getContents(), true, 512, JSON_THROW_ON_ERROR);
+            $requestBody = json_decode($request->getBody()->getContents(), true, 511, JSON_THROW_ON_ERROR);
         } catch (\JsonException) {
             throw new HttpBadRequestException($request, 'Cannot parse request body as JSON');
         }

10) /home/barney/projects/matchbot/src/Application/Actions/Donations/Confirm.php:67    [M] IncrementInteger

--- Original
+++ New
@@ @@
     protected function action(Request $request, Response $response, array $args) : Response
     {
         try {
-            $requestBody = json_decode($request->getBody()->getContents(), true, 512, JSON_THROW_ON_ERROR);
+            $requestBody = json_decode($request->getBody()->getContents(), true, 513, JSON_THROW_ON_ERROR);
         } catch (\JsonException) {
             throw new HttpBadRequestException($request, 'Cannot parse request body as JSON');
         }

11) /home/barney/projects/matchbot/src/Application/Actions/Donations/Confirm.php:77    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         \assert(is_array($requestBody));
         $pamentMethodId = $requestBody['stripePaymentMethodId'];
         \assert(is_string($pamentMethodId));
-        $this->entityManager->beginTransaction();
+        
         $donation = $this->donationRepository->findAndLockOneBy(['uuid' => $args['donationId']]);
         if (!$donation) {
             throw new NotFoundException();

12) /home/barney/projects/matchbot/src/Application/Actions/Donations/Confirm.php:129    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             $this->stripeClient->paymentIntents->confirm($paymentIntentId, ['payment_method' => $pamentMethodId]);
         } catch (CardException $exception) {
             $exceptionClass = get_class($exception);
-            $this->logger->info(sprintf('Stripe %s on Confirm for donation %s (%s): %s', $exceptionClass, $donation->getUuid(), $paymentIntentId, $exception->getMessage()));
+            
             $this->entityManager->rollback();
             return new JsonResponse(['error' => ['message' => $exception->getMessage(), 'code' => $exception->getStripeCode(), 'decline_code' => $exception->getDeclineCode()]], 402);
         } catch (InvalidRequestException $exception) {

13) /home/barney/projects/matchbot/src/Application/Actions/Donations/Confirm.php:137    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         } catch (CardException $exception) {
             $exceptionClass = get_class($exception);
             $this->logger->info(sprintf('Stripe %s on Confirm for donation %s (%s): %s', $exceptionClass, $donation->getUuid(), $paymentIntentId, $exception->getMessage()));
-            $this->entityManager->rollback();
+            
             return new JsonResponse(['error' => ['message' => $exception->getMessage(), 'code' => $exception->getStripeCode(), 'decline_code' => $exception->getDeclineCode()]], 402);
         } catch (InvalidRequestException $exception) {
             // We've seen card test bots, and no humans, try to reuse payment methods like this as of Oct '23. For now

14) /home/barney/projects/matchbot/src/Application/Actions/Donations/Confirm.php:157    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             // not be used again. To use a PaymentMethod multiple times, you must attach it to a Customer first."
             $paymentMethodReuseAttempted = str_contains($exception->getMessage(), 'The provided PaymentMethod was previously used');
             if ($paymentMethodReuseAttempted) {
-                $this->logger->warning(sprintf('Stripe InvalidRequestException on Confirm for donation %s (%s): %s', $donation->getUuid(), $paymentIntentId, $exception->getMessage()));
+                
                 $this->entityManager->rollback();
                 return new JsonResponse(['error' => ['message' => 'Payment method cannot be used again', 'code' => $exception->getStripeCode()]], 402);
             }

15) /home/barney/projects/matchbot/src/Application/Actions/Donations/Confirm.php:164    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             $paymentMethodReuseAttempted = str_contains($exception->getMessage(), 'The provided PaymentMethod was previously used');
             if ($paymentMethodReuseAttempted) {
                 $this->logger->warning(sprintf('Stripe InvalidRequestException on Confirm for donation %s (%s): %s', $donation->getUuid(), $paymentIntentId, $exception->getMessage()));
-                $this->entityManager->rollback();
+                
                 return new JsonResponse(['error' => ['message' => 'Payment method cannot be used again', 'code' => $exception->getStripeCode()]], 402);
             }
             if (!$this->errorMessageFromStripeIsExpected($exception)) {

16) /home/barney/projects/matchbot/src/Application/Actions/Donations/Confirm.php:196    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             $this->entityManager->rollback();
             return new JsonResponse(['error' => ['message' => $exception->getMessage(), 'code' => $exception->getStripeCode()]], 402);
         } catch (ApiErrorException $exception) {
-            $this->logger->error(sprintf('Stripe %s on Confirm for donation %s (%s): %s', get_class($exception), $donation->getUuid(), $paymentIntentId, $exception->getMessage()));
+            
             $this->entityManager->rollback();
             return new JsonResponse(['error' => ['message' => $exception->getMessage(), 'code' => $exception->getStripeCode()]], 500);
         }

17) /home/barney/projects/matchbot/src/Application/Actions/Donations/Confirm.php:204    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             return new JsonResponse(['error' => ['message' => $exception->getMessage(), 'code' => $exception->getStripeCode()]], 402);
         } catch (ApiErrorException $exception) {
             $this->logger->error(sprintf('Stripe %s on Confirm for donation %s (%s): %s', get_class($exception), $donation->getUuid(), $paymentIntentId, $exception->getMessage()));
-            $this->entityManager->rollback();
+            
             return new JsonResponse(['error' => ['message' => $exception->getMessage(), 'code' => $exception->getStripeCode()]], 500);
         }
         $updatedIntent = $this->stripeClient->paymentIntents->retrieve($paymentIntentId);

18) /home/barney/projects/matchbot/src/Application/Actions/Donations/Confirm.php:216    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             return new JsonResponse(['error' => ['message' => $exception->getMessage(), 'code' => $exception->getStripeCode()]], 500);
         }
         $updatedIntent = $this->stripeClient->paymentIntents->retrieve($paymentIntentId);
-        $this->entityManager->flush();
+        
         return new JsonResponse(['paymentIntent' => ['status' => $updatedIntent->status, 'client_secret' => $updatedIntent->status === 'requires_action' ? $updatedIntent->client_secret : null]]);
     }
 }

20) /home/barney/projects/matchbot/src/Application/Actions/UpdatePaymentMethod.php:62    [M] DecrementInteger

--- Original
+++ New
@@ @@
         $body = (string) $request->getBody();
         // We don't need to know the details inside the billing details - we are just a thin layer between the front end
         // and Stripe here.
-        $newBillingDetails = json_decode($body, true, 512, \JSON_THROW_ON_ERROR);
+        $newBillingDetails = json_decode($body, true, 511, \JSON_THROW_ON_ERROR);
         assert(is_array($newBillingDetails));
         try {
             // see https://stripe.com/docs/api/payment_methods/update

21) /home/barney/projects/matchbot/src/Application/Actions/UpdatePaymentMethod.php:62    [M] IncrementInteger

--- Original
+++ New
@@ @@
         $body = (string) $request->getBody();
         // We don't need to know the details inside the billing details - we are just a thin layer between the front end
         // and Stripe here.
-        $newBillingDetails = json_decode($body, true, 512, \JSON_THROW_ON_ERROR);
+        $newBillingDetails = json_decode($body, true, 513, \JSON_THROW_ON_ERROR);
         assert(is_array($newBillingDetails));
         try {
             // see https://stripe.com/docs/api/payment_methods/update

28) /home/barney/projects/matchbot/src/Application/Commands/ClaimGiftAid.php:57    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             foreach ($toClaim as $donation) {
                 $stamps = [new BusNameStamp('claimbot.donation.claim'), new TransportMessageIdStamp("claimbot.donation.claim.{$donation->getUuid()}")];
                 $this->bus->dispatch(new Envelope($donation->toClaimBotModel(), $stamps));
-                $donation->setTbgGiftAidRequestQueuedAt(new \DateTime());
+                
                 $this->entityManager->persist($donation);
             }
             $this->entityManager->flush();

31) /home/barney/projects/matchbot/src/Application/Commands/DeleteStalePaymentDetails.php:72    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             // Get all *card* type payment methods for this customer – condition (3).
             $paymentMethods = $this->stripeClient->paymentMethods->all(['customer' => $customer->id, 'type' => 'card', 'limit' => static::STRIPE_PAGE_SIZE]);
             foreach ($paymentMethods->autoPagingIterator() as $paymentMethod) {
-                // Soft-delete / prevent reuse of the payment method.
-                $this->logger->info(sprintf('Detaching payment method %s, previously of customer %s', $paymentMethod->id, $customer->id));
+                
                 $this->stripeClient->paymentMethods->detach($paymentMethod->id);
                 $methodsDeleted++;
             }

32) /home/barney/projects/matchbot/src/Application/Commands/DeleteStalePaymentDetails.php:88    [M] DecrementInteger

--- Original
+++ New
@@ @@
             $this->stripeClient->customers->update($customer->id, ['metadata' => ['paymentMethodsCleared' => $this->initDate->format('Y-m-d H:i:s')]]);
         }
         $timeTaken = microtime(true) - $startTime;
-        $timeTaken = round($timeTaken, 2);
+        $timeTaken = round($timeTaken, 1);
         $output->writeln("Deleted {$methodsDeleted} payment methods from Stripe, having checked {$customerCount} customers. Time Taken: {$timeTaken}s");
         return 0;
     }
 }

34) /home/barney/projects/matchbot/src/Application/Commands/DeleteStalePaymentDetails.php:88    [M] RoundingFamily

--- Original
+++ New
@@ @@
             $this->stripeClient->customers->update($customer->id, ['metadata' => ['paymentMethodsCleared' => $this->initDate->format('Y-m-d H:i:s')]]);
         }
         $timeTaken = microtime(true) - $startTime;
-        $timeTaken = round($timeTaken, 2);
+        $timeTaken = floor($timeTaken);
         $output->writeln("Deleted {$methodsDeleted} payment methods from Stripe, having checked {$customerCount} customers. Time Taken: {$timeTaken}s");
         return 0;
     }
 }

38) /home/barney/projects/matchbot/src/Application/Messenger/Handler/GiftAidResultHandler.php:22    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     }
     public function __invoke(Messages\Donation $donationMessage) : void
     {
-        $this->logger->info(sprintf('Donation ID %s Gift Aid claim result returned by ClaimBot', $donationMessage->id));
+        
         /** @var Donation $donation */
         $donation = $this->donationRepository->findOneBy(['uuid' => $donationMessage->id]);
         if ($donationMessage->response_success === false) {

40) /home/barney/projects/matchbot/src/Domain/Charity.php:201    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         $this->regulatorNumber = $regulatorNumber;
     }
-    public function setTbgApprovedToClaimGiftAid(bool $tbgApprovedToClaimGiftAid) : void
+    protected function setTbgApprovedToClaimGiftAid(bool $tbgApprovedToClaimGiftAid) : void
     {
         $this->tbgApprovedToClaimGiftAid = $tbgApprovedToClaimGiftAid;
     }

41) /home/barney/projects/matchbot/src/Domain/Charity.php:209    [M] PublicVisibility

--- Original
+++ New
@@ @@
     /**
      * @throws \UnexpectedValueException if $giftAidOnboardingStatus is not listed in self::POSSIBLE_GIFT_AID_STATUSES
      */
-    public function updateFromSfPull(string $charityName, ?string $stripeAccountId, ?string $hmrcReferenceNumber, ?string $giftAidOnboardingStatus, ?string $regulator, ?string $regulatorNumber, DateTime $time) : void
+    protected function updateFromSfPull(string $charityName, ?string $stripeAccountId, ?string $hmrcReferenceNumber, ?string $giftAidOnboardingStatus, ?string $regulator, ?string $regulatorNumber, DateTime $time) : void
     {
         if (!is_null($giftAidOnboardingStatus) && !in_array($giftAidOnboardingStatus, self::POSSIBLE_GIFT_AID_STATUSES, true)) {
             throw new \UnexpectedValueException();

43) /home/barney/projects/matchbot/src/Domain/Charity.php:226    [M] LogicalNot

--- Original
+++ New
@@ @@
         }
         $this->setName($charityName);
         $this->setStripeAccountId($stripeAccountId);
-        $tbgCanClaimGiftAid = !empty($hmrcReferenceNumber) && in_array($giftAidOnboardingStatus, self::GIFT_AID_ONBOARDED_STATUSES, true);
+        $tbgCanClaimGiftAid = empty($hmrcReferenceNumber) && in_array($giftAidOnboardingStatus, self::GIFT_AID_ONBOARDED_STATUSES, true);
         $tbgApprovedToClaimGiftAid = !empty($hmrcReferenceNumber) && $giftAidOnboardingStatus === self::GIFT_AID_APPROVED_STATUS;
         $this->setTbgClaimingGiftAid($tbgCanClaimGiftAid);
         $this->setTbgApprovedToClaimGiftAid($tbgApprovedToClaimGiftAid);

44) /home/barney/projects/matchbot/src/Domain/Charity.php:226    [M] LogicalAnd

--- Original
+++ New
@@ @@
         }
         $this->setName($charityName);
         $this->setStripeAccountId($stripeAccountId);
-        $tbgCanClaimGiftAid = !empty($hmrcReferenceNumber) && in_array($giftAidOnboardingStatus, self::GIFT_AID_ONBOARDED_STATUSES, true);
+        $tbgCanClaimGiftAid = !empty($hmrcReferenceNumber) || in_array($giftAidOnboardingStatus, self::GIFT_AID_ONBOARDED_STATUSES, true);
         $tbgApprovedToClaimGiftAid = !empty($hmrcReferenceNumber) && $giftAidOnboardingStatus === self::GIFT_AID_APPROVED_STATUS;
         $this->setTbgClaimingGiftAid($tbgCanClaimGiftAid);
         $this->setTbgApprovedToClaimGiftAid($tbgApprovedToClaimGiftAid);

45) /home/barney/projects/matchbot/src/Domain/Charity.php:226    [M] LogicalAndAllSubExprNegation

--- Original
+++ New
@@ @@
         }
         $this->setName($charityName);
         $this->setStripeAccountId($stripeAccountId);
-        $tbgCanClaimGiftAid = !empty($hmrcReferenceNumber) && in_array($giftAidOnboardingStatus, self::GIFT_AID_ONBOARDED_STATUSES, true);
+        $tbgCanClaimGiftAid = empty($hmrcReferenceNumber) && !in_array($giftAidOnboardingStatus, self::GIFT_AID_ONBOARDED_STATUSES, true);
         $tbgApprovedToClaimGiftAid = !empty($hmrcReferenceNumber) && $giftAidOnboardingStatus === self::GIFT_AID_APPROVED_STATUS;
         $this->setTbgClaimingGiftAid($tbgCanClaimGiftAid);
         $this->setTbgApprovedToClaimGiftAid($tbgApprovedToClaimGiftAid);

46) /home/barney/projects/matchbot/src/Domain/Charity.php:226    [M] LogicalAndNegation

--- Original
+++ New
@@ @@
         }
         $this->setName($charityName);
         $this->setStripeAccountId($stripeAccountId);
-        $tbgCanClaimGiftAid = !empty($hmrcReferenceNumber) && in_array($giftAidOnboardingStatus, self::GIFT_AID_ONBOARDED_STATUSES, true);
+        $tbgCanClaimGiftAid = !(!empty($hmrcReferenceNumber) && in_array($giftAidOnboardingStatus, self::GIFT_AID_ONBOARDED_STATUSES, true));
         $tbgApprovedToClaimGiftAid = !empty($hmrcReferenceNumber) && $giftAidOnboardingStatus === self::GIFT_AID_APPROVED_STATUS;
         $this->setTbgClaimingGiftAid($tbgCanClaimGiftAid);
         $this->setTbgApprovedToClaimGiftAid($tbgApprovedToClaimGiftAid);

47) /home/barney/projects/matchbot/src/Domain/Charity.php:226    [M] LogicalAndSingleSubExprNegation

--- Original
+++ New
@@ @@
         }
         $this->setName($charityName);
         $this->setStripeAccountId($stripeAccountId);
-        $tbgCanClaimGiftAid = !empty($hmrcReferenceNumber) && in_array($giftAidOnboardingStatus, self::GIFT_AID_ONBOARDED_STATUSES, true);
+        $tbgCanClaimGiftAid = !empty($hmrcReferenceNumber) && !in_array($giftAidOnboardingStatus, self::GIFT_AID_ONBOARDED_STATUSES, true);
         $tbgApprovedToClaimGiftAid = !empty($hmrcReferenceNumber) && $giftAidOnboardingStatus === self::GIFT_AID_APPROVED_STATUS;
         $this->setTbgClaimingGiftAid($tbgCanClaimGiftAid);
         $this->setTbgApprovedToClaimGiftAid($tbgApprovedToClaimGiftAid);

48) /home/barney/projects/matchbot/src/Domain/Charity.php:230    [M] LogicalNot

--- Original
+++ New
@@ @@
         $this->setName($charityName);
         $this->setStripeAccountId($stripeAccountId);
         $tbgCanClaimGiftAid = !empty($hmrcReferenceNumber) && in_array($giftAidOnboardingStatus, self::GIFT_AID_ONBOARDED_STATUSES, true);
-        $tbgApprovedToClaimGiftAid = !empty($hmrcReferenceNumber) && $giftAidOnboardingStatus === self::GIFT_AID_APPROVED_STATUS;
+        $tbgApprovedToClaimGiftAid = empty($hmrcReferenceNumber) && $giftAidOnboardingStatus === self::GIFT_AID_APPROVED_STATUS;
         $this->setTbgClaimingGiftAid($tbgCanClaimGiftAid);
         $this->setTbgApprovedToClaimGiftAid($tbgApprovedToClaimGiftAid);
         // May be null. Should be set to its string value if provided even if the charity is now opted out for new

49) /home/barney/projects/matchbot/src/Domain/Charity.php:230    [M] LogicalAnd

--- Original
+++ New
@@ @@
         $this->setName($charityName);
         $this->setStripeAccountId($stripeAccountId);
         $tbgCanClaimGiftAid = !empty($hmrcReferenceNumber) && in_array($giftAidOnboardingStatus, self::GIFT_AID_ONBOARDED_STATUSES, true);
-        $tbgApprovedToClaimGiftAid = !empty($hmrcReferenceNumber) && $giftAidOnboardingStatus === self::GIFT_AID_APPROVED_STATUS;
+        $tbgApprovedToClaimGiftAid = !empty($hmrcReferenceNumber) || $giftAidOnboardingStatus === self::GIFT_AID_APPROVED_STATUS;
         $this->setTbgClaimingGiftAid($tbgCanClaimGiftAid);
         $this->setTbgApprovedToClaimGiftAid($tbgApprovedToClaimGiftAid);
         // May be null. Should be set to its string value if provided even if the charity is now opted out for new

50) /home/barney/projects/matchbot/src/Domain/Charity.php:230    [M] LogicalAndAllSubExprNegation

--- Original
+++ New
@@ @@
         $this->setName($charityName);
         $this->setStripeAccountId($stripeAccountId);
         $tbgCanClaimGiftAid = !empty($hmrcReferenceNumber) && in_array($giftAidOnboardingStatus, self::GIFT_AID_ONBOARDED_STATUSES, true);
-        $tbgApprovedToClaimGiftAid = !empty($hmrcReferenceNumber) && $giftAidOnboardingStatus === self::GIFT_AID_APPROVED_STATUS;
+        $tbgApprovedToClaimGiftAid = empty($hmrcReferenceNumber) && !($giftAidOnboardingStatus === self::GIFT_AID_APPROVED_STATUS);
         $this->setTbgClaimingGiftAid($tbgCanClaimGiftAid);
         $this->setTbgApprovedToClaimGiftAid($tbgApprovedToClaimGiftAid);
         // May be null. Should be set to its string value if provided even if the charity is now opted out for new

51) /home/barney/projects/matchbot/src/Domain/Charity.php:230    [M] LogicalAndNegation

--- Original
+++ New
@@ @@
         $this->setName($charityName);
         $this->setStripeAccountId($stripeAccountId);
         $tbgCanClaimGiftAid = !empty($hmrcReferenceNumber) && in_array($giftAidOnboardingStatus, self::GIFT_AID_ONBOARDED_STATUSES, true);
-        $tbgApprovedToClaimGiftAid = !empty($hmrcReferenceNumber) && $giftAidOnboardingStatus === self::GIFT_AID_APPROVED_STATUS;
+        $tbgApprovedToClaimGiftAid = !(!empty($hmrcReferenceNumber) && $giftAidOnboardingStatus === self::GIFT_AID_APPROVED_STATUS);
         $this->setTbgClaimingGiftAid($tbgCanClaimGiftAid);
         $this->setTbgApprovedToClaimGiftAid($tbgApprovedToClaimGiftAid);
         // May be null. Should be set to its string value if provided even if the charity is now opted out for new

52) /home/barney/projects/matchbot/src/Domain/Charity.php:231    [M] Identical

--- Original
+++ New
@@ @@
         $this->setName($charityName);
         $this->setStripeAccountId($stripeAccountId);
         $tbgCanClaimGiftAid = !empty($hmrcReferenceNumber) && in_array($giftAidOnboardingStatus, self::GIFT_AID_ONBOARDED_STATUSES, true);
-        $tbgApprovedToClaimGiftAid = !empty($hmrcReferenceNumber) && $giftAidOnboardingStatus === self::GIFT_AID_APPROVED_STATUS;
+        $tbgApprovedToClaimGiftAid = !empty($hmrcReferenceNumber) && $giftAidOnboardingStatus !== self::GIFT_AID_APPROVED_STATUS;
         $this->setTbgClaimingGiftAid($tbgCanClaimGiftAid);
         $this->setTbgApprovedToClaimGiftAid($tbgApprovedToClaimGiftAid);
         // May be null. Should be set to its string value if provided even if the charity is now opted out for new

53) /home/barney/projects/matchbot/src/Domain/Charity.php:234    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $this->setStripeAccountId($stripeAccountId);
         $tbgCanClaimGiftAid = !empty($hmrcReferenceNumber) && in_array($giftAidOnboardingStatus, self::GIFT_AID_ONBOARDED_STATUSES, true);
         $tbgApprovedToClaimGiftAid = !empty($hmrcReferenceNumber) && $giftAidOnboardingStatus === self::GIFT_AID_APPROVED_STATUS;
-        $this->setTbgClaimingGiftAid($tbgCanClaimGiftAid);
+        
         $this->setTbgApprovedToClaimGiftAid($tbgApprovedToClaimGiftAid);
         // May be null. Should be set to its string value if provided even if the charity is now opted out for new
         // claims, because there could still be historic donations that should be claimed by TBG.

55) /home/barney/projects/matchbot/src/Domain/Charity.php:239    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $tbgApprovedToClaimGiftAid = !empty($hmrcReferenceNumber) && $giftAidOnboardingStatus === self::GIFT_AID_APPROVED_STATUS;
         $this->setTbgClaimingGiftAid($tbgCanClaimGiftAid);
         $this->setTbgApprovedToClaimGiftAid($tbgApprovedToClaimGiftAid);
-        // May be null. Should be set to its string value if provided even if the charity is now opted out for new
-        // claims, because there could still be historic donations that should be claimed by TBG.
-        $this->setHmrcReferenceNumber($hmrcReferenceNumber);
+        
         $this->setRegulator($regulator);
         $this->setRegulatorNumber($regulatorNumber);
         $this->setSalesforceLastPull($time);
     }
 }

56) /home/barney/projects/matchbot/src/Domain/Charity.php:241    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         // May be null. Should be set to its string value if provided even if the charity is now opted out for new
         // claims, because there could still be historic donations that should be claimed by TBG.
         $this->setHmrcReferenceNumber($hmrcReferenceNumber);
-        $this->setRegulator($regulator);
+        
         $this->setRegulatorNumber($regulatorNumber);
         $this->setSalesforceLastPull($time);
     }
 }

58) /home/barney/projects/matchbot/src/Domain/Charity.php:244    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $this->setHmrcReferenceNumber($hmrcReferenceNumber);
         $this->setRegulator($regulator);
         $this->setRegulatorNumber($regulatorNumber);
-        $this->setSalesforceLastPull($time);
+        
     }
 }

59) /home/barney/projects/matchbot/src/Domain/DonationStatus.php:26    [M] MatchArmRemoval

--- Original
+++ New
@@ @@
     public function isReversed() : bool
     {
         return match ($this) {
-            self::Refunded, self::Failed, self::Chargedback => true,
+            self::Refunded, self::Chargedback => true,
             default => false,
         };
     }

60) /home/barney/projects/matchbot/src/Domain/DonationStatus.php:26    [M] MatchArmRemoval

--- Original
+++ New
@@ @@
     public function isReversed() : bool
     {
         return match ($this) {
-            self::Refunded, self::Failed, self::Chargedback => true,
+            self::Refunded, self::Failed => true,
             default => false,
         };
     }

62) /home/barney/projects/matchbot/src/Domain/DonorName.php:28    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
      */
     private function __construct(string $first, string $last)
     {
-        Assert::lazy()->that($first, 'first')->betweenLength(1, 255)->that($last, 'last')->betweenLength(1, 255)->verifyNow();
+        
         $this->first = $first;
         $this->last = $last;
     }

63) /home/barney/projects/matchbot/src/Domain/DonorName.php:29    [M] DecrementInteger

--- Original
+++ New
@@ @@
      */
     private function __construct(string $first, string $last)
     {
-        Assert::lazy()->that($first, 'first')->betweenLength(1, 255)->that($last, 'last')->betweenLength(1, 255)->verifyNow();
+        Assert::lazy()->that($first, 'first')->betweenLength(0, 255)->that($last, 'last')->betweenLength(1, 255)->verifyNow();
         $this->first = $first;
         $this->last = $last;
     }

64) /home/barney/projects/matchbot/src/Domain/DonorName.php:29    [M] IncrementInteger

--- Original
+++ New
@@ @@
      */
     private function __construct(string $first, string $last)
     {
-        Assert::lazy()->that($first, 'first')->betweenLength(1, 255)->that($last, 'last')->betweenLength(1, 255)->verifyNow();
+        Assert::lazy()->that($first, 'first')->betweenLength(2, 255)->that($last, 'last')->betweenLength(1, 255)->verifyNow();
         $this->first = $first;
         $this->last = $last;
     }
