65) /home/barney/projects/matchbot/src/Domain/DonorName.php:29    [M] DecrementInteger

--- Original
+++ New
@@ @@
      */
     private function __construct(string $first, string $last)
     {
-        Assert::lazy()->that($first, 'first')->betweenLength(1, 255)->that($last, 'last')->betweenLength(1, 255)->verifyNow();
+        Assert::lazy()->that($first, 'first')->betweenLength(1, 254)->that($last, 'last')->betweenLength(1, 255)->verifyNow();
         $this->first = $first;
         $this->last = $last;
     }

66) /home/barney/projects/matchbot/src/Domain/DonorName.php:29    [M] IncrementInteger

--- Original
+++ New
@@ @@
      */
     private function __construct(string $first, string $last)
     {
-        Assert::lazy()->that($first, 'first')->betweenLength(1, 255)->that($last, 'last')->betweenLength(1, 255)->verifyNow();
+        Assert::lazy()->that($first, 'first')->betweenLength(1, 256)->that($last, 'last')->betweenLength(1, 255)->verifyNow();
         $this->first = $first;
         $this->last = $last;
     }

67) /home/barney/projects/matchbot/src/Domain/DonorName.php:30    [M] DecrementInteger

--- Original
+++ New
@@ @@
      */
     private function __construct(string $first, string $last)
     {
-        Assert::lazy()->that($first, 'first')->betweenLength(1, 255)->that($last, 'last')->betweenLength(1, 255)->verifyNow();
+        Assert::lazy()->that($first, 'first')->betweenLength(1, 255)->that($last, 'last')->betweenLength(0, 255)->verifyNow();
         $this->first = $first;
         $this->last = $last;
     }

68) /home/barney/projects/matchbot/src/Domain/DonorName.php:30    [M] IncrementInteger

--- Original
+++ New
@@ @@
      */
     private function __construct(string $first, string $last)
     {
-        Assert::lazy()->that($first, 'first')->betweenLength(1, 255)->that($last, 'last')->betweenLength(1, 255)->verifyNow();
+        Assert::lazy()->that($first, 'first')->betweenLength(1, 255)->that($last, 'last')->betweenLength(2, 255)->verifyNow();
         $this->first = $first;
         $this->last = $last;
     }

69) /home/barney/projects/matchbot/src/Domain/DonorName.php:30    [M] DecrementInteger

--- Original
+++ New
@@ @@
      */
     private function __construct(string $first, string $last)
     {
-        Assert::lazy()->that($first, 'first')->betweenLength(1, 255)->that($last, 'last')->betweenLength(1, 255)->verifyNow();
+        Assert::lazy()->that($first, 'first')->betweenLength(1, 255)->that($last, 'last')->betweenLength(1, 254)->verifyNow();
         $this->first = $first;
         $this->last = $last;
     }

70) /home/barney/projects/matchbot/src/Domain/DonorName.php:30    [M] IncrementInteger

--- Original
+++ New
@@ @@
      */
     private function __construct(string $first, string $last)
     {
-        Assert::lazy()->that($first, 'first')->betweenLength(1, 255)->that($last, 'last')->betweenLength(1, 255)->verifyNow();
+        Assert::lazy()->that($first, 'first')->betweenLength(1, 255)->that($last, 'last')->betweenLength(1, 256)->verifyNow();
         $this->first = $first;
         $this->last = $last;
     }

72) /home/barney/projects/matchbot/src/Domain/Money.php:21    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
      */
     private function __construct(private readonly int $amountInPence, private readonly Currency $currency)
     {
-        Assertion::between($this->amountInPence, 0, 2000000000);
+        
     }
     public static function fromPence(int $amountInPence, Currency $currency) : self
     {

73) /home/barney/projects/matchbot/src/Domain/Money.php:23    [M] DecrementInteger

--- Original
+++ New
@@ @@
      */
     private function __construct(private readonly int $amountInPence, private readonly Currency $currency)
     {
-        Assertion::between($this->amountInPence, 0, 2000000000);
+        Assertion::between($this->amountInPence, -1, 2000000000);
     }
     public static function fromPence(int $amountInPence, Currency $currency) : self
     {

74) /home/barney/projects/matchbot/src/Domain/Money.php:23    [M] IncrementInteger

--- Original
+++ New
@@ @@
      */
     private function __construct(private readonly int $amountInPence, private readonly Currency $currency)
     {
-        Assertion::between($this->amountInPence, 0, 2000000000);
+        Assertion::between($this->amountInPence, 1, 2000000000);
     }
     public static function fromPence(int $amountInPence, Currency $currency) : self
     {

75) /home/barney/projects/matchbot/src/Domain/Money.php:24    [M] DecrementInteger

--- Original
+++ New
@@ @@
      */
     private function __construct(private readonly int $amountInPence, private readonly Currency $currency)
     {
-        Assertion::between($this->amountInPence, 0, 2000000000);
+        Assertion::between($this->amountInPence, 0, 1999999999);
     }
     public static function fromPence(int $amountInPence, Currency $currency) : self
     {

76) /home/barney/projects/matchbot/src/Domain/Money.php:24    [M] IncrementInteger

--- Original
+++ New
@@ @@
      */
     private function __construct(private readonly int $amountInPence, private readonly Currency $currency)
     {
-        Assertion::between($this->amountInPence, 0, 2000000000);
+        Assertion::between($this->amountInPence, 0, 2000000001);
     }
     public static function fromPence(int $amountInPence, Currency $currency) : self
     {

78) /home/barney/projects/matchbot/src/Domain/StripeCustomerId.php:23    [M] DecrementInteger

--- Original
+++ New
@@ @@
     {
         $this->stripeCustomerId = $stripeCustomerId;
         Assertion::notEmpty($this->stripeCustomerId);
-        Assertion::maxLength($this->stripeCustomerId, 255);
+        Assertion::maxLength($this->stripeCustomerId, 254);
         Assertion::regex($this->stripeCustomerId, '/^cus_[a-zA-Z0-9]+$/');
         // e.g. cus_df64s36cf
     }

81) /home/barney/projects/matchbot/src/Domain/StripeCustomerId.php:24    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $this->stripeCustomerId = $stripeCustomerId;
         Assertion::notEmpty($this->stripeCustomerId);
         Assertion::maxLength($this->stripeCustomerId, 255);
-        Assertion::regex($this->stripeCustomerId, '/^cus_[a-zA-Z0-9]+$/');
+        
         // e.g. cus_df64s36cf
     }
     /**

4) /home/barney/projects/matchbot/src/Application/Actions/ActionError.php:33    [M] PublicVisibility

--- Original
+++ New
@@ @@
     /**
      * @return string
      */
-    #[Pure]
-    public function getType() : string
+    protected function getType() : string
     {
         return $this->type;
     }

5) /home/barney/projects/matchbot/src/Application/Actions/ActionError.php:43    [M] PublicVisibility

--- Original
+++ New
@@ @@
      * @param string $type
      * @return self
      */
-    public function setType(string $type) : self
+    protected function setType(string $type) : self
     {
         $this->type = $type;
         return $this;

6) /home/barney/projects/matchbot/src/Application/Actions/ActionError.php:52    [M] PublicVisibility

--- Original
+++ New
@@ @@
     /**
      * @return null|string
      */
-    #[Pure]
-    public function getDescription() : string|null
+    protected function getDescription() : string|null
     {
         return $this->description;
     }

7) /home/barney/projects/matchbot/src/Application/Actions/ActionError.php:62    [M] PublicVisibility

--- Original
+++ New
@@ @@
      * @param string|null $description
      * @return self
      */
-    public function setDescription(?string $description = null) : self
+    protected function setDescription(?string $description = null) : self
     {
         $this->description = $description;
         return $this;

8) /home/barney/projects/matchbot/src/Application/Actions/ActionPayload.php:32    [M] PublicVisibility

--- Original
+++ New
@@ @@
     /**
      * @return array|null|object
      */
-    #[Pure]
-    public function getData() : object|array|null
+    protected function getData() : object|array|null
     {
         return $this->data;
     }

9) /home/barney/projects/matchbot/src/Application/Actions/ActionPayload.php:41    [M] PublicVisibility

--- Original
+++ New
@@ @@
     /**
      * @return ActionError|null
      */
-    #[Pure]
-    public function getError() : ?ActionError
+    protected function getError() : ?ActionError
     {
         return $this->error;
     }

10) /home/barney/projects/matchbot/src/Application/Actions/DeletePaymentMethod.php:66    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         try {
             $this->stripeClient->paymentMethods->detach($paymentMethodId);
         } catch (InvalidRequestException $e) {
-            $this->logger->error("Failed to delete payment method, error: " . $e->getMessage(), compact('customerId', 'paymentMethodId'));
+            
             return $this->respondWithData($response, ['error' => "Could not delete payment method"], 400);
         }
         return $this->respondWithData($response, data: [], statusCode: StatusCodeInterface::STATUS_NO_CONTENT);
     }
 }

11) /home/barney/projects/matchbot/src/Application/Actions/DeletePaymentMethod.php:67    [M] Concat

--- Original
+++ New
@@ @@
         try {
             $this->stripeClient->paymentMethods->detach($paymentMethodId);
         } catch (InvalidRequestException $e) {
-            $this->logger->error("Failed to delete payment method, error: " . $e->getMessage(), compact('customerId', 'paymentMethodId'));
+            $this->logger->error($e->getMessage() . "Failed to delete payment method, error: ", compact('customerId', 'paymentMethodId'));
             return $this->respondWithData($response, ['error' => "Could not delete payment method"], 400);
         }
         return $this->respondWithData($response, data: [], statusCode: StatusCodeInterface::STATUS_NO_CONTENT);
     }
 }

12) /home/barney/projects/matchbot/src/Application/Actions/DeletePaymentMethod.php:67    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         try {
             $this->stripeClient->paymentMethods->detach($paymentMethodId);
         } catch (InvalidRequestException $e) {
-            $this->logger->error("Failed to delete payment method, error: " . $e->getMessage(), compact('customerId', 'paymentMethodId'));
+            $this->logger->error($e->getMessage(), compact('customerId', 'paymentMethodId'));
             return $this->respondWithData($response, ['error' => "Could not delete payment method"], 400);
         }
         return $this->respondWithData($response, data: [], statusCode: StatusCodeInterface::STATUS_NO_CONTENT);
     }
 }

13) /home/barney/projects/matchbot/src/Application/Actions/DeletePaymentMethod.php:67    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         try {
             $this->stripeClient->paymentMethods->detach($paymentMethodId);
         } catch (InvalidRequestException $e) {
-            $this->logger->error("Failed to delete payment method, error: " . $e->getMessage(), compact('customerId', 'paymentMethodId'));
+            $this->logger->error("Failed to delete payment method, error: ", compact('customerId', 'paymentMethodId'));
             return $this->respondWithData($response, ['error' => "Could not delete payment method"], 400);
         }
         return $this->respondWithData($response, data: [], statusCode: StatusCodeInterface::STATUS_NO_CONTENT);
     }
 }

14) /home/barney/projects/matchbot/src/Application/Actions/DeletePaymentMethod.php:70    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
             $this->stripeClient->paymentMethods->detach($paymentMethodId);
         } catch (InvalidRequestException $e) {
             $this->logger->error("Failed to delete payment method, error: " . $e->getMessage(), compact('customerId', 'paymentMethodId'));
-            return $this->respondWithData($response, ['error' => "Could not delete payment method"], 400);
+            return $this->respondWithData($response, [], 400);
         }
         return $this->respondWithData($response, data: [], statusCode: StatusCodeInterface::STATUS_NO_CONTENT);
     }
 }

15) /home/barney/projects/matchbot/src/Application/Actions/DeletePaymentMethod.php:70    [M] DecrementInteger

--- Original
+++ New
@@ @@
             $this->stripeClient->paymentMethods->detach($paymentMethodId);
         } catch (InvalidRequestException $e) {
             $this->logger->error("Failed to delete payment method, error: " . $e->getMessage(), compact('customerId', 'paymentMethodId'));
-            return $this->respondWithData($response, ['error' => "Could not delete payment method"], 400);
+            return $this->respondWithData($response, ['error' => "Could not delete payment method"], 399);
         }
         return $this->respondWithData($response, data: [], statusCode: StatusCodeInterface::STATUS_NO_CONTENT);
     }
 }

16) /home/barney/projects/matchbot/src/Application/Actions/DeletePaymentMethod.php:70    [M] IncrementInteger

--- Original
+++ New
@@ @@
             $this->stripeClient->paymentMethods->detach($paymentMethodId);
         } catch (InvalidRequestException $e) {
             $this->logger->error("Failed to delete payment method, error: " . $e->getMessage(), compact('customerId', 'paymentMethodId'));
-            return $this->respondWithData($response, ['error' => "Could not delete payment method"], 400);
+            return $this->respondWithData($response, ['error' => "Could not delete payment method"], 401);
         }
         return $this->respondWithData($response, data: [], statusCode: StatusCodeInterface::STATUS_NO_CONTENT);
     }
 }

17) /home/barney/projects/matchbot/src/Application/Actions/Donations/Confirm.php:49    [M] Foreach_

--- Original
+++ New
@@ @@
     private function errorMessageFromStripeIsExpected(InvalidRequestException $exception) : bool
     {
         $exceptionMessage = $exception->getMessage();
-        foreach (self::EXPECTED_STRIPE_INVALID_REQUEST_MESSAGES as $expectedMessage) {
+        foreach (array() as $expectedMessage) {
             if (str_contains($exceptionMessage, $expectedMessage)) {
                 return true;
             }

18) /home/barney/projects/matchbot/src/Application/Actions/Donations/Confirm.php:50    [M] IfNegation

--- Original
+++ New
@@ @@
     {
         $exceptionMessage = $exception->getMessage();
         foreach (self::EXPECTED_STRIPE_INVALID_REQUEST_MESSAGES as $expectedMessage) {
-            if (str_contains($exceptionMessage, $expectedMessage)) {
+            if (!str_contains($exceptionMessage, $expectedMessage)) {
                 return true;
             }
         }

25) /home/barney/projects/matchbot/src/Application/Actions/Donations/Confirm.php:174    [M] LogicalNot

--- Original
+++ New
@@ @@
                 $this->entityManager->rollback();
                 return new JsonResponse(['error' => ['message' => 'Payment method cannot be used again', 'code' => $exception->getStripeCode()]], 402);
             }
-            if (!$this->errorMessageFromStripeIsExpected($exception)) {
+            if ($this->errorMessageFromStripeIsExpected($exception)) {
                 throw $exception;
             }
             $exceptionClass = get_class($exception);

27) /home/barney/projects/matchbot/src/Application/Actions/Donations/Confirm.php:179    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
                 throw $exception;
             }
             $exceptionClass = get_class($exception);
-            $this->logger->warning(sprintf('Stripe %s on Confirm for donation %s (%s): %s', $exceptionClass, $donation->getUuid(), $paymentIntentId, $exception->getMessage()));
+            
             $this->entityManager->rollback();
             return new JsonResponse(['error' => ['message' => $exception->getMessage(), 'code' => $exception->getStripeCode()]], 402);
         } catch (ApiErrorException $exception) {

28) /home/barney/projects/matchbot/src/Application/Actions/Donations/Confirm.php:187    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             }
             $exceptionClass = get_class($exception);
             $this->logger->warning(sprintf('Stripe %s on Confirm for donation %s (%s): %s', $exceptionClass, $donation->getUuid(), $paymentIntentId, $exception->getMessage()));
-            $this->entityManager->rollback();
+            
             return new JsonResponse(['error' => ['message' => $exception->getMessage(), 'code' => $exception->getStripeCode()]], 402);
         } catch (ApiErrorException $exception) {
             $this->logger->error(sprintf('Stripe %s on Confirm for donation %s (%s): %s', get_class($exception), $donation->getUuid(), $paymentIntentId, $exception->getMessage()));

29) /home/barney/projects/matchbot/src/Application/Actions/Donations/Confirm.php:189    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
             $exceptionClass = get_class($exception);
             $this->logger->warning(sprintf('Stripe %s on Confirm for donation %s (%s): %s', $exceptionClass, $donation->getUuid(), $paymentIntentId, $exception->getMessage()));
             $this->entityManager->rollback();
-            return new JsonResponse(['error' => ['message' => $exception->getMessage(), 'code' => $exception->getStripeCode()]], 402);
+            return new JsonResponse([], 402);
         } catch (ApiErrorException $exception) {
             $this->logger->error(sprintf('Stripe %s on Confirm for donation %s (%s): %s', get_class($exception), $donation->getUuid(), $paymentIntentId, $exception->getMessage()));
             $this->entityManager->rollback();

30) /home/barney/projects/matchbot/src/Application/Actions/Donations/Confirm.php:190    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
             $exceptionClass = get_class($exception);
             $this->logger->warning(sprintf('Stripe %s on Confirm for donation %s (%s): %s', $exceptionClass, $donation->getUuid(), $paymentIntentId, $exception->getMessage()));
             $this->entityManager->rollback();
-            return new JsonResponse(['error' => ['message' => $exception->getMessage(), 'code' => $exception->getStripeCode()]], 402);
+            return new JsonResponse(['error' => ['code' => $exception->getStripeCode()]], 402);
         } catch (ApiErrorException $exception) {
             $this->logger->error(sprintf('Stripe %s on Confirm for donation %s (%s): %s', get_class($exception), $donation->getUuid(), $paymentIntentId, $exception->getMessage()));
             $this->entityManager->rollback();

31) /home/barney/projects/matchbot/src/Application/Actions/Donations/Confirm.php:191    [M] ArrayItem

--- Original
+++ New
@@ @@
             $exceptionClass = get_class($exception);
             $this->logger->warning(sprintf('Stripe %s on Confirm for donation %s (%s): %s', $exceptionClass, $donation->getUuid(), $paymentIntentId, $exception->getMessage()));
             $this->entityManager->rollback();
-            return new JsonResponse(['error' => ['message' => $exception->getMessage(), 'code' => $exception->getStripeCode()]], 402);
+            return new JsonResponse(['error' => ['message' > $exception->getMessage(), 'code' => $exception->getStripeCode()]], 402);
         } catch (ApiErrorException $exception) {
             $this->logger->error(sprintf('Stripe %s on Confirm for donation %s (%s): %s', get_class($exception), $donation->getUuid(), $paymentIntentId, $exception->getMessage()));
             $this->entityManager->rollback();

32) /home/barney/projects/matchbot/src/Application/Actions/Donations/Confirm.php:192    [M] ArrayItem

--- Original
+++ New
@@ @@
             $exceptionClass = get_class($exception);
             $this->logger->warning(sprintf('Stripe %s on Confirm for donation %s (%s): %s', $exceptionClass, $donation->getUuid(), $paymentIntentId, $exception->getMessage()));
             $this->entityManager->rollback();
-            return new JsonResponse(['error' => ['message' => $exception->getMessage(), 'code' => $exception->getStripeCode()]], 402);
+            return new JsonResponse(['error' => ['message' => $exception->getMessage(), 'code' > $exception->getStripeCode()]], 402);
         } catch (ApiErrorException $exception) {
             $this->logger->error(sprintf('Stripe %s on Confirm for donation %s (%s): %s', get_class($exception), $donation->getUuid(), $paymentIntentId, $exception->getMessage()));
             $this->entityManager->rollback();

33) /home/barney/projects/matchbot/src/Application/Actions/Donations/Confirm.php:194    [M] DecrementInteger

--- Original
+++ New
@@ @@
             $exceptionClass = get_class($exception);
             $this->logger->warning(sprintf('Stripe %s on Confirm for donation %s (%s): %s', $exceptionClass, $donation->getUuid(), $paymentIntentId, $exception->getMessage()));
             $this->entityManager->rollback();
-            return new JsonResponse(['error' => ['message' => $exception->getMessage(), 'code' => $exception->getStripeCode()]], 402);
+            return new JsonResponse(['error' => ['message' => $exception->getMessage(), 'code' => $exception->getStripeCode()]], 401);
         } catch (ApiErrorException $exception) {
             $this->logger->error(sprintf('Stripe %s on Confirm for donation %s (%s): %s', get_class($exception), $donation->getUuid(), $paymentIntentId, $exception->getMessage()));
             $this->entityManager->rollback();

34) /home/barney/projects/matchbot/src/Application/Actions/Donations/Confirm.php:194    [M] IncrementInteger

--- Original
+++ New
@@ @@
             $exceptionClass = get_class($exception);
             $this->logger->warning(sprintf('Stripe %s on Confirm for donation %s (%s): %s', $exceptionClass, $donation->getUuid(), $paymentIntentId, $exception->getMessage()));
             $this->entityManager->rollback();
-            return new JsonResponse(['error' => ['message' => $exception->getMessage(), 'code' => $exception->getStripeCode()]], 402);
+            return new JsonResponse(['error' => ['message' => $exception->getMessage(), 'code' => $exception->getStripeCode()]], 403);
         } catch (ApiErrorException $exception) {
             $this->logger->error(sprintf('Stripe %s on Confirm for donation %s (%s): %s', get_class($exception), $donation->getUuid(), $paymentIntentId, $exception->getMessage()));
             $this->entityManager->rollback();

36) /home/barney/projects/matchbot/src/Application/Actions/Donations/Create.php:143    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
                 return $this->respond($response, new ActionPayload(503, null, $error));
             } catch (\Throwable $t) {
                 $this->matchingAdapter->releaseNewlyAllocatedFunds();
-                // we have to also remove the FundingWithdrawls from MySQL - otherwise the redis amount would be reduced again when the donation expires.
-                $this->donationRepository->removeAllFundingWithdrawalsForDonation($donation);
+                
                 throw $t;
             }
         }

37) /home/barney/projects/matchbot/src/Application/Actions/Donations/Create.php:145    [M] Throw_

--- Original
+++ New
@@ @@
                 $this->matchingAdapter->releaseNewlyAllocatedFunds();
                 // we have to also remove the FundingWithdrawls from MySQL - otherwise the redis amount would be reduced again when the donation expires.
                 $this->donationRepository->removeAllFundingWithdrawalsForDonation($donation);
-                throw $t;
+                $t;
             }
         }
         if ($donation->getPsp() === 'stripe') {

38) /home/barney/projects/matchbot/src/Application/Actions/Donations/Create.php:219    [M] Ternary

--- Original
+++ New
@@ @@
                     $message,
                     // this message is an issue the charity needs to fix, we can't fix it for them.
                     'Your destination account needs to have at least one of the following capabilities enabled'
-                ) ? Logger::WARNING : Logger::ERROR;
+                ) ? Logger::ERROR : Logger::WARNING;
                 $error = new ActionError(ActionError::SERVER_ERROR, 'Could not make Stripe Payment Intent (B)');
                 return $this->respond($response, new ActionPayload(500, null, $error));

44) /home/barney/projects/matchbot/src/Application/Actions/Donations/Get.php:33    [M] Throw_

--- Original
+++ New
@@ @@
     protected function action(Request $request, Response $response, array $args) : Response
     {
         if (empty($args['donationId'])) {
-            // When MatchBot made a donation, this is now a UUID
-            throw new DomainRecordNotFoundException('Missing donation ID');
+            new DomainRecordNotFoundException('Missing donation ID');
         }
         /** @var Donation $donation */
         $donation = $this->donationRepository->findOneBy(['uuid' => $args['donationId']]);

45) /home/barney/projects/matchbot/src/Application/Actions/Donations/Update.php:63    [M] Throw_

--- Original
+++ New
@@ @@
     protected function action(Request $request, Response $response, array $args) : Response
     {
         if (empty($args['donationId']) || !is_string($args['donationId'])) {
-            // When MatchBot made a donation, this is now a UUID
-            throw new DomainRecordNotFoundException('Missing donation ID');
+            new DomainRecordNotFoundException('Missing donation ID');
         }
         $body = (string) $request->getBody();
         try {

47) /home/barney/projects/matchbot/src/Application/Actions/Donations/Update.php:92    [M] Throw_

--- Original
+++ New
@@ @@
         }
         if (getenv('APP_ENV') !== 'production' && str_starts_with($donationData->firstName ?? '', 'Please throw')) {
             $this->logger->critical("Testing a critical log message for BG2-2297");
-            throw new \Exception("{$donationData->firstName} requested an exception for test purposes");
+            new \Exception("{$donationData->firstName} requested an exception for test purposes");
         }
         if (!isset($donationData->status)) {
             return $this->validationError($response, "Donation ID {$args['donationId']} could not be updated with missing status", 'New status is required');

48) /home/barney/projects/matchbot/src/Application/Actions/Donations/Update.php:157    [M] GreaterThanOrEqualTo

--- Original
+++ New
@@ @@
                 $this->logger->warning(sprintf('Caught LockWaitTimeoutException in Update for donation %s, retry count %d', $args['donationId'], $retryCount));
                 $microseconds = (int) (100000 * 2 ** $retryCount);
                 // pause for 0.1, 0.2, 0.4 and then 0.8s before giving up.
-                \assert($microseconds >= 0);
+                \assert($microseconds > 0);
                 \usleep($microseconds);
                 $retryCount++;
                 $this->entityManager->rollback();

49) /home/barney/projects/matchbot/src/Application/Actions/Donations/Update.php:157    [M] GreaterThanOrEqualToNegotiation

--- Original
+++ New
@@ @@
                 $this->logger->warning(sprintf('Caught LockWaitTimeoutException in Update for donation %s, retry count %d', $args['donationId'], $retryCount));
                 $microseconds = (int) (100000 * 2 ** $retryCount);
                 // pause for 0.1, 0.2, 0.4 and then 0.8s before giving up.
-                \assert($microseconds >= 0);
+                \assert($microseconds < 0);
                 \usleep($microseconds);
                 $retryCount++;
                 $this->entityManager->rollback();

50) /home/barney/projects/matchbot/src/Application/Actions/Donations/Update.php:174    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             } catch (InvalidRequestException $invalidRequestException) {
                 if (str_starts_with(haystack: $invalidRequestException->getMessage(), needle: "This PaymentIntent's amount could not be updated because it has a status of canceled")) {
                     \assert(isset($donation), "If we've got as far as Stripe throwing an exception we must have a Donation");
-                    $this->logger->warning(sprintf('Stripe rejected payment intent update as PI was cancelled, presumably by stripe' . ' itself very recently. Donation UUID %s', $donation->getUuid()));
+                    
                     $this->entityManager->rollback();
                     return $this->validationError($response, "Donation ID {$args['donationId']} could not be updated", 'This donation payment intent has been cancelled. You may wish to start a fresh donation.');
                 }

51) /home/barney/projects/matchbot/src/Application/Actions/Donations/Update.php:175    [M] Concat

--- Original
+++ New
@@ @@
             } catch (InvalidRequestException $invalidRequestException) {
                 if (str_starts_with(haystack: $invalidRequestException->getMessage(), needle: "This PaymentIntent's amount could not be updated because it has a status of canceled")) {
                     \assert(isset($donation), "If we've got as far as Stripe throwing an exception we must have a Donation");
-                    $this->logger->warning(sprintf('Stripe rejected payment intent update as PI was cancelled, presumably by stripe' . ' itself very recently. Donation UUID %s', $donation->getUuid()));
+                    $this->logger->warning(sprintf(' itself very recently. Donation UUID %s' . 'Stripe rejected payment intent update as PI was cancelled, presumably by stripe', $donation->getUuid()));
                     $this->entityManager->rollback();
                     return $this->validationError($response, "Donation ID {$args['donationId']} could not be updated", 'This donation payment intent has been cancelled. You may wish to start a fresh donation.');
                 }
