52) /home/barney/projects/matchbot/src/Application/Actions/Donations/Update.php:175    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             } catch (InvalidRequestException $invalidRequestException) {
                 if (str_starts_with(haystack: $invalidRequestException->getMessage(), needle: "This PaymentIntent's amount could not be updated because it has a status of canceled")) {
                     \assert(isset($donation), "If we've got as far as Stripe throwing an exception we must have a Donation");
-                    $this->logger->warning(sprintf('Stripe rejected payment intent update as PI was cancelled, presumably by stripe' . ' itself very recently. Donation UUID %s', $donation->getUuid()));
+                    $this->logger->warning(sprintf(' itself very recently. Donation UUID %s', $donation->getUuid()));
                     $this->entityManager->rollback();
                     return $this->validationError($response, "Donation ID {$args['donationId']} could not be updated", 'This donation payment intent has been cancelled. You may wish to start a fresh donation.');
                 }

53) /home/barney/projects/matchbot/src/Application/Actions/Donations/Update.php:175    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             } catch (InvalidRequestException $invalidRequestException) {
                 if (str_starts_with(haystack: $invalidRequestException->getMessage(), needle: "This PaymentIntent's amount could not be updated because it has a status of canceled")) {
                     \assert(isset($donation), "If we've got as far as Stripe throwing an exception we must have a Donation");
-                    $this->logger->warning(sprintf('Stripe rejected payment intent update as PI was cancelled, presumably by stripe' . ' itself very recently. Donation UUID %s', $donation->getUuid()));
+                    $this->logger->warning(sprintf('Stripe rejected payment intent update as PI was cancelled, presumably by stripe', $donation->getUuid()));
                     $this->entityManager->rollback();
                     return $this->validationError($response, "Donation ID {$args['donationId']} could not be updated", 'This donation payment intent has been cancelled. You may wish to start a fresh donation.');
                 }

54) /home/barney/projects/matchbot/src/Application/Actions/Donations/Update.php:179    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
                 if (str_starts_with(haystack: $invalidRequestException->getMessage(), needle: "This PaymentIntent's amount could not be updated because it has a status of canceled")) {
                     \assert(isset($donation), "If we've got as far as Stripe throwing an exception we must have a Donation");
                     $this->logger->warning(sprintf('Stripe rejected payment intent update as PI was cancelled, presumably by stripe' . ' itself very recently. Donation UUID %s', $donation->getUuid()));
-                    $this->entityManager->rollback();
+                    
                     return $this->validationError($response, "Donation ID {$args['donationId']} could not be updated", 'This donation payment intent has been cancelled. You may wish to start a fresh donation.');
                 }
                 throw $invalidRequestException;

55) /home/barney/projects/matchbot/src/Application/Actions/Donations/Update.php:192    [M] Throw_

--- Original
+++ New
@@ @@
                 throw $invalidRequestException;
             }
         }
-        throw new \Exception("Retry count exceeded trying to update donation {$args['donationId']} , retried {$retryCount} times");
+        new \Exception("Retry count exceeded trying to update donation {$args['donationId']} , retried {$retryCount} times");
     }
     /**
      * Assumes it will be called only after starting a transaction pre-donation-select.

56) /home/barney/projects/matchbot/src/Application/Actions/Donations/Update.php:244    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             return $this->validationError($response, "Required boolean field 'giftAid' not set", null, true);
         }
         if ($donation->getDonationStatus() === DonationStatus::Cancelled) {
-            // this guard clause is technically not needed, and impossible to unit test, as this is covered by two
-            // previous clauses:
-            //
-            // - if donation from the DB is cancelled and the request sends a non-cancelled status we bail out all other
-            //      status changes are not supported
-            // - if donation from the DB is cancelled and the request is sending a cancelled status as well then we do
-            //      nothing.
-            //
-            // But worth keeping here IMHO just in case the other parts change.
-            $this->entityManager->rollback();
+            
             return $this->validationError($response, "Can not update cancelled donation", null, true);
         }
         // These 3 fields are currently set up early in the journey, but are harmless and more flexible

57) /home/barney/projects/matchbot/src/Application/Actions/Donations/Update.php:246    [M] TrueValue

--- Original
+++ New
@@ @@
             //
             // But worth keeping here IMHO just in case the other parts change.
             $this->entityManager->rollback();
-            return $this->validationError($response, "Can not update cancelled donation", null, true);
+            return $this->validationError($response, "Can not update cancelled donation", null, false);
         }
         // These 3 fields are currently set up early in the journey, but are harmless and more flexible
         // to support setting later. The frontend will probably leave these set and do a no-op update

58) /home/barney/projects/matchbot/src/Application/Actions/Donations/Update.php:297    [M] Throw_

--- Original
+++ New
@@ @@
                 $this->updatePaymentIntent($donation);
             } catch (RateLimitException $exception) {
                 if ($exception->getStripeCode() !== 'lock_timeout') {
-                    throw $exception;
+                    $exception;
                     // Only re-try when object level lock failed.
                 }
                 $this->logger->info(sprintf('Stripe lock "rate limit" hit while updating payment intent for donation %s – retrying in 1s...', $donation->getUuid()));

59) /home/barney/projects/matchbot/src/Application/Actions/Donations/Update.php:358    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
                     // seen before with a distinct message, but both options give the client an HTTP 500,
                     // as we expect neither with our updated guard conditions.
                     if (str_starts_with($exception->getMessage(), "You cannot confirm this PaymentIntent because it's missing a payment method")) {
-                        $this->logger->error(sprintf('Stripe Payment Intent for donation ID %s was missing a payment method, so we could not confirm it', $donation->getUuid()));
+                        
                         $error = new ActionError(ActionError::SERVER_ERROR, 'Could not confirm Stripe Payment Intent');
                         return $this->respond($response, new ActionPayload(500, null, $error));
                     }

60) /home/barney/projects/matchbot/src/Application/Actions/Donations/Update.php:364    [M] DecrementInteger

--- Original
+++ New
@@ @@
                     if (str_starts_with($exception->getMessage(), "You cannot confirm this PaymentIntent because it's missing a payment method")) {
                         $this->logger->error(sprintf('Stripe Payment Intent for donation ID %s was missing a payment method, so we could not confirm it', $donation->getUuid()));
                         $error = new ActionError(ActionError::SERVER_ERROR, 'Could not confirm Stripe Payment Intent');
-                        return $this->respond($response, new ActionPayload(500, null, $error));
+                        return $this->respond($response, new ActionPayload(499, null, $error));
                     }
                     throw $exception;
                 }

61) /home/barney/projects/matchbot/src/Application/Actions/Donations/Update.php:364    [M] IncrementInteger

--- Original
+++ New
@@ @@
                     if (str_starts_with($exception->getMessage(), "You cannot confirm this PaymentIntent because it's missing a payment method")) {
                         $this->logger->error(sprintf('Stripe Payment Intent for donation ID %s was missing a payment method, so we could not confirm it', $donation->getUuid()));
                         $error = new ActionError(ActionError::SERVER_ERROR, 'Could not confirm Stripe Payment Intent');
-                        return $this->respond($response, new ActionPayload(500, null, $error));
+                        return $this->respond($response, new ActionPayload(501, null, $error));
                     }
                     throw $exception;
                 }

63) /home/barney/projects/matchbot/src/Application/Actions/DonorAccount/Create.php:43    [M] DecrementInteger

--- Original
+++ New
@@ @@
     {
         try {
             $json = $request->getBody()->getContents();
-            $requestBody = json_decode($json, true, 512, JSON_THROW_ON_ERROR);
+            $requestBody = json_decode($json, true, 511, JSON_THROW_ON_ERROR);
         } catch (\JsonException) {
             throw new HttpBadRequestException($request, 'Cannot parse request body as JSON');
         }

64) /home/barney/projects/matchbot/src/Application/Actions/DonorAccount/Create.php:43    [M] IncrementInteger

--- Original
+++ New
@@ @@
     {
         try {
             $json = $request->getBody()->getContents();
-            $requestBody = json_decode($json, true, 512, JSON_THROW_ON_ERROR);
+            $requestBody = json_decode($json, true, 513, JSON_THROW_ON_ERROR);
         } catch (\JsonException) {
             throw new HttpBadRequestException($request, 'Cannot parse request body as JSON');
         }

66) /home/barney/projects/matchbot/src/Application/Actions/DonorAccount/Create.php:54    [M] Coalesce

--- Original
+++ New
@@ @@
         \assert(is_array($requestBody));
         $stripeCustomerIdString = $request->getAttribute(PersonManagementAuthMiddleware::PSP_ATTRIBUTE_NAME);
         \assert(is_string($stripeCustomerIdString));
-        $emailAddressString = $requestBody['emailAddress'] ?? throw new HttpBadRequestException($request, 'Expected emailAddress');
+        $emailAddressString = throw new HttpBadRequestException($request, 'Expected emailAddress') ?? $requestBody['emailAddress'];
         \assert(is_string($emailAddressString));
         /** @var array{firstName: string, lastName: string} $donorNameArray */
         $donorNameArray = $requestBody['donorName'] ?? throw new HttpBadRequestException($request, 'Expected donorName');

68) /home/barney/projects/matchbot/src/Application/Actions/DonorAccount/Create.php:64    [M] Catch_

--- Original
+++ New
@@ @@
             $emailAddress = EmailAddress::of($emailAddressString);
             $donorName = DonorName::of($donorNameArray['firstName'], $donorNameArray['lastName']);
             $stripeCustomerId = StripeCustomerId::of($stripeCustomerIdString);
-        } catch (AssertionFailedException|LazyAssertionException $e) {
+        } catch (LazyAssertionException $e) {
             return $this->validationError($response, $e->getMessage());
         }
         $donorAccount = new DonorAccount($emailAddress, $donorName, $stripeCustomerId);

69) /home/barney/projects/matchbot/src/Application/Actions/DonorAccount/Create.php:64    [M] Catch_

--- Original
+++ New
@@ @@
             $emailAddress = EmailAddress::of($emailAddressString);
             $donorName = DonorName::of($donorNameArray['firstName'], $donorNameArray['lastName']);
             $stripeCustomerId = StripeCustomerId::of($stripeCustomerIdString);
-        } catch (AssertionFailedException|LazyAssertionException $e) {
+        } catch (AssertionFailedException $e) {
             return $this->validationError($response, $e->getMessage());
         }
         $donorAccount = new DonorAccount($emailAddress, $donorName, $stripeCustomerId);

71) /home/barney/projects/matchbot/src/Application/Actions/DonorAccount/Create.php:82    [M] Concat

--- Original
+++ New
@@ @@
         try {
             $this->donorAccountRepository->save($donorAccount);
         } catch (UniqueConstraintViolationException $e) {
-            return $this->validationError($response, "Donor Account already exists for stripe account " . $donorAccount->stripeCustomerId->stripeCustomerId);
+            return $this->validationError($response, $donorAccount->stripeCustomerId->stripeCustomerId . "Donor Account already exists for stripe account ");
         }
         return new \Slim\Psr7\Response(201);
     }
 }

72) /home/barney/projects/matchbot/src/Application/Actions/DonorAccount/Create.php:82    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         try {
             $this->donorAccountRepository->save($donorAccount);
         } catch (UniqueConstraintViolationException $e) {
-            return $this->validationError($response, "Donor Account already exists for stripe account " . $donorAccount->stripeCustomerId->stripeCustomerId);
+            return $this->validationError($response, $donorAccount->stripeCustomerId->stripeCustomerId);
         }
         return new \Slim\Psr7\Response(201);
     }
 }

73) /home/barney/projects/matchbot/src/Application/Actions/DonorAccount/Create.php:82    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         try {
             $this->donorAccountRepository->save($donorAccount);
         } catch (UniqueConstraintViolationException $e) {
-            return $this->validationError($response, "Donor Account already exists for stripe account " . $donorAccount->stripeCustomerId->stripeCustomerId);
+            return $this->validationError($response, "Donor Account already exists for stripe account ");
         }
         return new \Slim\Psr7\Response(201);
     }
 }

74) /home/barney/projects/matchbot/src/Application/Actions/DonorAccount/Create.php:86    [M] DecrementInteger

--- Original
+++ New
@@ @@
         } catch (UniqueConstraintViolationException $e) {
             return $this->validationError($response, "Donor Account already exists for stripe account " . $donorAccount->stripeCustomerId->stripeCustomerId);
         }
-        return new \Slim\Psr7\Response(201);
+        return new \Slim\Psr7\Response(200);
     }
 }

75) /home/barney/projects/matchbot/src/Application/Actions/DonorAccount/Create.php:86    [M] IncrementInteger

--- Original
+++ New
@@ @@
         } catch (UniqueConstraintViolationException $e) {
             return $this->validationError($response, "Donor Account already exists for stripe account " . $donorAccount->stripeCustomerId->stripeCustomerId);
         }
-        return new \Slim\Psr7\Response(201);
+        return new \Slim\Psr7\Response(202);
     }
 }

77) /home/barney/projects/matchbot/src/Application/Actions/Hooks/Stripe.php:67    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
              * @link https://stripe.com/docs/connect/webhooks
              */
             $method = $connect ? 'info' : 'warning';
-            $this->logger->{$method}(sprintf('Skipping non-live %s webhook in Production', $this->event->type));
+            
             return $this->respond($response, new ActionPayload(204));
         }
         return null;
     }
 }

78) /home/barney/projects/matchbot/src/Application/Actions/Hooks/Stripe.php:69    [M] DecrementInteger

--- Original
+++ New
@@ @@
              */
             $method = $connect ? 'info' : 'warning';
             $this->logger->{$method}(sprintf('Skipping non-live %s webhook in Production', $this->event->type));
-            return $this->respond($response, new ActionPayload(204));
+            return $this->respond($response, new ActionPayload(203));
         }
         return null;
     }
 }

79) /home/barney/projects/matchbot/src/Application/Actions/Hooks/Stripe.php:69    [M] IncrementInteger

--- Original
+++ New
@@ @@
              */
             $method = $connect ? 'info' : 'warning';
             $this->logger->{$method}(sprintf('Skipping non-live %s webhook in Production', $this->event->type));
-            return $this->respond($response, new ActionPayload(204));
+            return $this->respond($response, new ActionPayload(205));
         }
         return null;
     }
 }

80) /home/barney/projects/matchbot/src/Application/Actions/Hooks/StripePaymentsUpdate.php:149    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             }
             $this->logger->info(sprintf('Set donation %s Collected based on hook for charge ID %s', $donation->getUuid(), $charge->id));
         } else {
-            $this->logger->error(sprintf('Ignoring unsupported status %s for donation %s on charge ID %s', $charge->status, $donation->getUuid(), $charge->id));
+            
             $this->entityManager->rollback();
             return $this->validationError($response, sprintf('Unsupported Status "%s"', $charge->status));
         }

81) /home/barney/projects/matchbot/src/Application/Actions/Hooks/StripePaymentsUpdate.php:155    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             $this->logger->info(sprintf('Set donation %s Collected based on hook for charge ID %s', $donation->getUuid(), $charge->id));
         } else {
             $this->logger->error(sprintf('Ignoring unsupported status %s for donation %s on charge ID %s', $charge->status, $donation->getUuid(), $charge->id));
-            $this->entityManager->rollback();
+            
             return $this->validationError($response, sprintf('Unsupported Status "%s"', $charge->status));
         }
         $this->entityManager->persist($donation);

86) /home/barney/projects/matchbot/src/Application/Actions/Hooks/StripePaymentsUpdate.php:340    [M] ArrayItem

--- Original
+++ New
@@ @@
     {
         $paymentIntent = $event->data->object;
         \assert($paymentIntent instanceof PaymentIntent);
-        $donation = $this->donationRepository->findOneBy(['transactionId' => $paymentIntent->id]);
+        $donation = $this->donationRepository->findOneBy(['transactionId' > $paymentIntent->id]);
         if ($donation === null) {
             if (getenv('APP_ENV') !== 'production') {
                 // outside of production we expect Stripe to combine things from multiple test environments

87) /home/barney/projects/matchbot/src/Application/Actions/Hooks/StripePaymentsUpdate.php:340    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     {
         $paymentIntent = $event->data->object;
         \assert($paymentIntent instanceof PaymentIntent);
-        $donation = $this->donationRepository->findOneBy(['transactionId' => $paymentIntent->id]);
+        $donation = $this->donationRepository->findOneBy([]);
         if ($donation === null) {
             if (getenv('APP_ENV') !== 'production') {
                 // outside of production we expect Stripe to combine things from multiple test environments

88) /home/barney/projects/matchbot/src/Application/Actions/Hooks/StripePaymentsUpdate.php:342    [M] Identical

--- Original
+++ New
@@ @@
         $paymentIntent = $event->data->object;
         \assert($paymentIntent instanceof PaymentIntent);
         $donation = $this->donationRepository->findOneBy(['transactionId' => $paymentIntent->id]);
-        if ($donation === null) {
+        if ($donation !== null) {
             if (getenv('APP_ENV') !== 'production') {
                 // outside of production we expect Stripe to combine things from multiple test environments
                 // (staging & regtest) into one, so we may get irrelevant cancellation requests. We don't want

94) /home/barney/projects/matchbot/src/Application/Actions/Hooks/StripePaymentsUpdate.php:352    [M] Identical

--- Original
+++ New
@@ @@
             }
             return $this->respond($response, new ActionPayload(404));
         }
-        if (DonationStatus::Cancelled === $donation->getDonationStatus()) {
+        if (DonationStatus::Cancelled !== $donation->getDonationStatus()) {
             return $this->respond($response, new ActionPayload(204, ['reason' => 'Donation is already cancelled']));
         }
         $this->logger->info(sprintf('Received Stripe cancellation request, Donation UUID %s, payment intent ID %s', $donation->getUuid(), $paymentIntent->id));

97) /home/barney/projects/matchbot/src/Application/Actions/Hooks/StripePaymentsUpdate.php:353    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
             return $this->respond($response, new ActionPayload(404));
         }
         if (DonationStatus::Cancelled === $donation->getDonationStatus()) {
-            return $this->respond($response, new ActionPayload(204, ['reason' => 'Donation is already cancelled']));
+            return $this->respond($response, new ActionPayload(204, []));
         }
         $this->logger->info(sprintf('Received Stripe cancellation request, Donation UUID %s, payment intent ID %s', $donation->getUuid(), $paymentIntent->id));
         try {

98) /home/barney/projects/matchbot/src/Application/Actions/Hooks/StripePaymentsUpdate.php:356    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         if (DonationStatus::Cancelled === $donation->getDonationStatus()) {
             return $this->respond($response, new ActionPayload(204, ['reason' => 'Donation is already cancelled']));
         }
-        $this->logger->info(sprintf('Received Stripe cancellation request, Donation UUID %s, payment intent ID %s', $donation->getUuid(), $paymentIntent->id));
+        
         try {
             $donation->cancel();
         } catch (\UnexpectedValueException) {

103) /home/barney/projects/matchbot/src/Application/Actions/Hooks/StripePaymentsUpdate.php:369    [M] FalseValue

--- Original
+++ New
@@ @@
             return $this->respond($response, new ActionPayload(400));
         }
         $this->entityManager->flush();
-        $this->donationRepository->push($donation, false);
+        $this->donationRepository->push($donation, true);
         // Attempt immediate sync to Salesforce
         return $this->respond($response, new ActionPayload(200));
     }

104) /home/barney/projects/matchbot/src/Application/Actions/Hooks/StripePaymentsUpdate.php:369    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             return $this->respond($response, new ActionPayload(400));
         }
         $this->entityManager->flush();
-        $this->donationRepository->push($donation, false);
+        
         // Attempt immediate sync to Salesforce
         return $this->respond($response, new ActionPayload(200));
     }

105) /home/barney/projects/matchbot/src/Application/Actions/Hooks/StripePaymentsUpdate.php:371    [M] DecrementInteger

--- Original
+++ New
@@ @@
         $this->entityManager->flush();
         $this->donationRepository->push($donation, false);
         // Attempt immediate sync to Salesforce
-        return $this->respond($response, new ActionPayload(200));
+        return $this->respond($response, new ActionPayload(199));
     }
     /**
      * @param int $refundedOrDisputedAmount In small currency unit, e.g. pence or cents.

106) /home/barney/projects/matchbot/src/Application/Actions/Hooks/StripePaymentsUpdate.php:371    [M] IncrementInteger

--- Original
+++ New
@@ @@
         $this->entityManager->flush();
         $this->donationRepository->push($donation, false);
         // Attempt immediate sync to Salesforce
-        return $this->respond($response, new ActionPayload(200));
+        return $this->respond($response, new ActionPayload(201));
     }
     /**
      * @param int $refundedOrDisputedAmount In small currency unit, e.g. pence or cents.

107) /home/barney/projects/matchbot/src/Application/Actions/Hooks/StripePaymentsUpdate.php:413    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         $txn = $this->stripeClient->balanceTransactions->retrieve($balanceTransactionId);
         if (count($txn->fee_details) !== 1) {
-            $this->logger->warning(sprintf('StripeChargeUpdate::getFee: Unexpected composite fee with %d parts: %s', count($txn->fee_details), json_encode($txn->fee_details)));
+            
         }
         if ($txn->fee_details[0]->currency !== strtolower($expectedCurrencyCode)) {
             // `fee` should presumably still be in parent account's currency, so don't bail out.

108) /home/barney/projects/matchbot/src/Application/Actions/Hooks/StripePaymentsUpdate.php:422    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             $this->logger->warning(sprintf('StripeChargeUpdate::getFee: Unexpected composite fee with %d parts: %s', count($txn->fee_details), json_encode($txn->fee_details)));
         }
         if ($txn->fee_details[0]->currency !== strtolower($expectedCurrencyCode)) {
-            // `fee` should presumably still be in parent account's currency, so don't bail out.
-            $this->logger->warning(sprintf('StripeChargeUpdate::getFee: Unexpected fee currency %s', $txn->fee_details[0]->currency));
+            
         }
         if ($txn->fee_details[0]->type !== 'stripe_fee') {
             $this->logger->warning(sprintf('StripeChargeUpdate::getFee: Unexpected type %s', $txn->fee_details[0]->type));

109) /home/barney/projects/matchbot/src/Application/Actions/Hooks/StripePaymentsUpdate.php:424    [M] IncrementInteger

--- Original
+++ New
@@ @@
         }
         if ($txn->fee_details[0]->currency !== strtolower($expectedCurrencyCode)) {
             // `fee` should presumably still be in parent account's currency, so don't bail out.
-            $this->logger->warning(sprintf('StripeChargeUpdate::getFee: Unexpected fee currency %s', $txn->fee_details[0]->currency));
+            $this->logger->warning(sprintf('StripeChargeUpdate::getFee: Unexpected fee currency %s', $txn->fee_details[1]->currency));
         }
         if ($txn->fee_details[0]->type !== 'stripe_fee') {
             $this->logger->warning(sprintf('StripeChargeUpdate::getFee: Unexpected type %s', $txn->fee_details[0]->type));

110) /home/barney/projects/matchbot/src/Application/Actions/Hooks/StripePaymentsUpdate.php:429    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             $this->logger->warning(sprintf('StripeChargeUpdate::getFee: Unexpected fee currency %s', $txn->fee_details[0]->currency));
         }
         if ($txn->fee_details[0]->type !== 'stripe_fee') {
-            $this->logger->warning(sprintf('StripeChargeUpdate::getFee: Unexpected type %s', $txn->fee_details[0]->type));
+            
         }
         return $txn->fee;
     }

111) /home/barney/projects/matchbot/src/Application/Actions/Hooks/StripePaymentsUpdate.php:431    [M] IncrementInteger

--- Original
+++ New
@@ @@
             $this->logger->warning(sprintf('StripeChargeUpdate::getFee: Unexpected fee currency %s', $txn->fee_details[0]->currency));
         }
         if ($txn->fee_details[0]->type !== 'stripe_fee') {
-            $this->logger->warning(sprintf('StripeChargeUpdate::getFee: Unexpected type %s', $txn->fee_details[0]->type));
+            $this->logger->warning(sprintf('StripeChargeUpdate::getFee: Unexpected type %s', $txn->fee_details[1]->type));
         }
         return $txn->fee;
     }

113) /home/barney/projects/matchbot/src/Application/Actions/Hooks/StripePaymentsUpdate.php:475    [M] NotIdentical

--- Original
+++ New
@@ @@
         /** @var array{customer: string, currency: string, net_amount: int, ending_balance: int, type: string} $webhookObject */
         $webhookObject = $event->data->toArray()['object'];
         $stripeAccountId = StripeCustomerId::of($webhookObject['customer']);
-        if ($webhookObject['type'] !== 'funded') {
+        if ($webhookObject['type'] === 'funded') {
             return $this->respond($response, new ActionPayload(200));
         }
         $donorAccount = $this->donorAccountRepository->findByStripeIdOrNull($stripeAccountId);

117) /home/barney/projects/matchbot/src/Application/Actions/Hooks/StripePaymentsUpdate.php:487    [M] NotIdentical

--- Original
+++ New
@@ @@
         $app_env = getenv('APP_ENV');
         if ($donorAccount === null) {
             \assert(is_string($app_env));
-            if ($app_env !== "regression" && $app_env !== "staging") {
+            if ($app_env === "regression" && $app_env !== "staging") {
                 // We expect the regression and staging environments to generate irrelevent webhooks to each other,
                 // so we don't need to notify Slack about the unexpected webhooks there.
                 $this->chatter->send(new ChatMessage("{$app_env}: Cash Balance update received for unknown account: " . $stripeAccountId->stripeCustomerId));

118) /home/barney/projects/matchbot/src/Application/Actions/Hooks/StripePaymentsUpdate.php:487    [M] NotIdentical

--- Original
+++ New
@@ @@
         $app_env = getenv('APP_ENV');
         if ($donorAccount === null) {
             \assert(is_string($app_env));
-            if ($app_env !== "regression" && $app_env !== "staging") {
+            if ($app_env !== "regression" && $app_env === "staging") {
                 // We expect the regression and staging environments to generate irrelevent webhooks to each other,
                 // so we don't need to notify Slack about the unexpected webhooks there.
                 $this->chatter->send(new ChatMessage("{$app_env}: Cash Balance update received for unknown account: " . $stripeAccountId->stripeCustomerId));
