120) /home/barney/projects/matchbot/src/Application/Actions/Hooks/StripePaymentsUpdate.php:487    [M] LogicalAndAllSubExprNegation

--- Original
+++ New
@@ @@
         $app_env = getenv('APP_ENV');
         if ($donorAccount === null) {
             \assert(is_string($app_env));
-            if ($app_env !== "regression" && $app_env !== "staging") {
+            if (!($app_env !== "regression") && !($app_env !== "staging")) {
                 // We expect the regression and staging environments to generate irrelevent webhooks to each other,
                 // so we don't need to notify Slack about the unexpected webhooks there.
                 $this->chatter->send(new ChatMessage("{$app_env}: Cash Balance update received for unknown account: " . $stripeAccountId->stripeCustomerId));

122) /home/barney/projects/matchbot/src/Application/Actions/Hooks/StripePaymentsUpdate.php:490    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         if ($donorAccount === null) {
             \assert(is_string($app_env));
             if ($app_env !== "regression" && $app_env !== "staging") {
-                // We expect the regression and staging environments to generate irrelevent webhooks to each other,
-                // so we don't need to notify Slack about the unexpected webhooks there.
-                $this->chatter->send(new ChatMessage("{$app_env}: Cash Balance update received for unknown account: " . $stripeAccountId->stripeCustomerId));
+                
             }
             return $this->respond($response, new ActionPayload(200));
         }

123) /home/barney/projects/matchbot/src/Application/Actions/Hooks/StripePaymentsUpdate.php:491    [M] Concat

--- Original
+++ New
@@ @@
             if ($app_env !== "regression" && $app_env !== "staging") {
                 // We expect the regression and staging environments to generate irrelevent webhooks to each other,
                 // so we don't need to notify Slack about the unexpected webhooks there.
-                $this->chatter->send(new ChatMessage("{$app_env}: Cash Balance update received for unknown account: " . $stripeAccountId->stripeCustomerId));
+                $this->chatter->send(new ChatMessage($stripeAccountId->stripeCustomerId . "{$app_env}: Cash Balance update received for unknown account: "));
             }
             return $this->respond($response, new ActionPayload(200));
         }

124) /home/barney/projects/matchbot/src/Application/Actions/Hooks/StripePaymentsUpdate.php:491    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             if ($app_env !== "regression" && $app_env !== "staging") {
                 // We expect the regression and staging environments to generate irrelevent webhooks to each other,
                 // so we don't need to notify Slack about the unexpected webhooks there.
-                $this->chatter->send(new ChatMessage("{$app_env}: Cash Balance update received for unknown account: " . $stripeAccountId->stripeCustomerId));
+                $this->chatter->send(new ChatMessage($stripeAccountId->stripeCustomerId));
             }
             return $this->respond($response, new ActionPayload(200));
         }

125) /home/barney/projects/matchbot/src/Application/Actions/Hooks/StripePaymentsUpdate.php:491    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             if ($app_env !== "regression" && $app_env !== "staging") {
                 // We expect the regression and staging environments to generate irrelevent webhooks to each other,
                 // so we don't need to notify Slack about the unexpected webhooks there.
-                $this->chatter->send(new ChatMessage("{$app_env}: Cash Balance update received for unknown account: " . $stripeAccountId->stripeCustomerId));
+                $this->chatter->send(new ChatMessage("{$app_env}: Cash Balance update received for unknown account: "));
             }
             return $this->respond($response, new ActionPayload(200));
         }

126) /home/barney/projects/matchbot/src/Application/Actions/Hooks/StripePaymentsUpdate.php:495    [M] DecrementInteger

--- Original
+++ New
@@ @@
                 // so we don't need to notify Slack about the unexpected webhooks there.
                 $this->chatter->send(new ChatMessage("{$app_env}: Cash Balance update received for unknown account: " . $stripeAccountId->stripeCustomerId));
             }
-            return $this->respond($response, new ActionPayload(200));
+            return $this->respond($response, new ActionPayload(199));
         }
         $this->donationFundsNotifier->notifyRecieptOfAccountFunds($donorAccount, $transferAmount, $endingBalance);
         $donorAccountId = $donorAccount->getId();

127) /home/barney/projects/matchbot/src/Application/Actions/Hooks/StripePaymentsUpdate.php:495    [M] IncrementInteger

--- Original
+++ New
@@ @@
                 // so we don't need to notify Slack about the unexpected webhooks there.
                 $this->chatter->send(new ChatMessage("{$app_env}: Cash Balance update received for unknown account: " . $stripeAccountId->stripeCustomerId));
             }
-            return $this->respond($response, new ActionPayload(200));
+            return $this->respond($response, new ActionPayload(201));
         }
         $this->donationFundsNotifier->notifyRecieptOfAccountFunds($donorAccount, $transferAmount, $endingBalance);
         $donorAccountId = $donorAccount->getId();

128) /home/barney/projects/matchbot/src/Application/Actions/Hooks/StripePaymentsUpdate.php:498    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             }
             return $this->respond($response, new ActionPayload(200));
         }
-        $this->donationFundsNotifier->notifyRecieptOfAccountFunds($donorAccount, $transferAmount, $endingBalance);
+        
         $donorAccountId = $donorAccount->getId();
         \assert(is_int($donorAccountId));
         // must be an int since it was persisted before.

129) /home/barney/projects/matchbot/src/Application/Actions/Hooks/StripePaymentsUpdate.php:502    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $this->donationFundsNotifier->notifyRecieptOfAccountFunds($donorAccount, $transferAmount, $endingBalance);
         $donorAccountId = $donorAccount->getId();
         \assert(is_int($donorAccountId));
-        // must be an int since it was persisted before.
-        $this->logger->info('Sent notification of receipt of account funds for Stripe Account: ' . $stripeAccountId->stripeCustomerId . ", transfer Amount" . $transferAmount->format() . ", new balance" . $endingBalance->format() . ", DonorAccount #" . $donorAccountId);
+        
         return $this->respond($response, new ActionPayload(200));
     }
 }

130) /home/barney/projects/matchbot/src/Application/Actions/Hooks/StripePaymentsUpdate.php:503    [M] Concat

--- Original
+++ New
@@ @@
         $donorAccountId = $donorAccount->getId();
         \assert(is_int($donorAccountId));
         // must be an int since it was persisted before.
-        $this->logger->info('Sent notification of receipt of account funds for Stripe Account: ' . $stripeAccountId->stripeCustomerId . ", transfer Amount" . $transferAmount->format() . ", new balance" . $endingBalance->format() . ", DonorAccount #" . $donorAccountId);
+        $this->logger->info($stripeAccountId->stripeCustomerId . 'Sent notification of receipt of account funds for Stripe Account: ' . ", transfer Amount" . $transferAmount->format() . ", new balance" . $endingBalance->format() . ", DonorAccount #" . $donorAccountId);
         return $this->respond($response, new ActionPayload(200));
     }
 }

131) /home/barney/projects/matchbot/src/Application/Actions/Hooks/StripePaymentsUpdate.php:503    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         $donorAccountId = $donorAccount->getId();
         \assert(is_int($donorAccountId));
         // must be an int since it was persisted before.
-        $this->logger->info('Sent notification of receipt of account funds for Stripe Account: ' . $stripeAccountId->stripeCustomerId . ", transfer Amount" . $transferAmount->format() . ", new balance" . $endingBalance->format() . ", DonorAccount #" . $donorAccountId);
+        $this->logger->info($stripeAccountId->stripeCustomerId . ", transfer Amount" . $transferAmount->format() . ", new balance" . $endingBalance->format() . ", DonorAccount #" . $donorAccountId);
         return $this->respond($response, new ActionPayload(200));
     }
 }

132) /home/barney/projects/matchbot/src/Application/Actions/Hooks/StripePaymentsUpdate.php:503    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         $donorAccountId = $donorAccount->getId();
         \assert(is_int($donorAccountId));
         // must be an int since it was persisted before.
-        $this->logger->info('Sent notification of receipt of account funds for Stripe Account: ' . $stripeAccountId->stripeCustomerId . ", transfer Amount" . $transferAmount->format() . ", new balance" . $endingBalance->format() . ", DonorAccount #" . $donorAccountId);
+        $this->logger->info('Sent notification of receipt of account funds for Stripe Account: ' . ", transfer Amount" . $transferAmount->format() . ", new balance" . $endingBalance->format() . ", DonorAccount #" . $donorAccountId);
         return $this->respond($response, new ActionPayload(200));
     }
 }

133) /home/barney/projects/matchbot/src/Application/Actions/Hooks/StripePaymentsUpdate.php:503    [M] Concat

--- Original
+++ New
@@ @@
         $donorAccountId = $donorAccount->getId();
         \assert(is_int($donorAccountId));
         // must be an int since it was persisted before.
-        $this->logger->info('Sent notification of receipt of account funds for Stripe Account: ' . $stripeAccountId->stripeCustomerId . ", transfer Amount" . $transferAmount->format() . ", new balance" . $endingBalance->format() . ", DonorAccount #" . $donorAccountId);
+        $this->logger->info('Sent notification of receipt of account funds for Stripe Account: ' . ", transfer Amount" . $stripeAccountId->stripeCustomerId . $transferAmount->format() . ", new balance" . $endingBalance->format() . ", DonorAccount #" . $donorAccountId);
         return $this->respond($response, new ActionPayload(200));
     }
 }

134) /home/barney/projects/matchbot/src/Application/Actions/Hooks/StripePaymentsUpdate.php:503    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         $donorAccountId = $donorAccount->getId();
         \assert(is_int($donorAccountId));
         // must be an int since it was persisted before.
-        $this->logger->info('Sent notification of receipt of account funds for Stripe Account: ' . $stripeAccountId->stripeCustomerId . ", transfer Amount" . $transferAmount->format() . ", new balance" . $endingBalance->format() . ", DonorAccount #" . $donorAccountId);
+        $this->logger->info('Sent notification of receipt of account funds for Stripe Account: ' . $stripeAccountId->stripeCustomerId . $transferAmount->format() . ", new balance" . $endingBalance->format() . ", DonorAccount #" . $donorAccountId);
         return $this->respond($response, new ActionPayload(200));
     }
 }

135) /home/barney/projects/matchbot/src/Application/Actions/Hooks/StripePaymentsUpdate.php:503    [M] Concat

--- Original
+++ New
@@ @@
         $donorAccountId = $donorAccount->getId();
         \assert(is_int($donorAccountId));
         // must be an int since it was persisted before.
-        $this->logger->info('Sent notification of receipt of account funds for Stripe Account: ' . $stripeAccountId->stripeCustomerId . ", transfer Amount" . $transferAmount->format() . ", new balance" . $endingBalance->format() . ", DonorAccount #" . $donorAccountId);
+        $this->logger->info('Sent notification of receipt of account funds for Stripe Account: ' . $stripeAccountId->stripeCustomerId . $transferAmount->format() . ", transfer Amount" . ", new balance" . $endingBalance->format() . ", DonorAccount #" . $donorAccountId);
         return $this->respond($response, new ActionPayload(200));
     }
 }

136) /home/barney/projects/matchbot/src/Application/Actions/Hooks/StripePaymentsUpdate.php:503    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         $donorAccountId = $donorAccount->getId();
         \assert(is_int($donorAccountId));
         // must be an int since it was persisted before.
-        $this->logger->info('Sent notification of receipt of account funds for Stripe Account: ' . $stripeAccountId->stripeCustomerId . ", transfer Amount" . $transferAmount->format() . ", new balance" . $endingBalance->format() . ", DonorAccount #" . $donorAccountId);
+        $this->logger->info('Sent notification of receipt of account funds for Stripe Account: ' . $stripeAccountId->stripeCustomerId . ", transfer Amount" . ", new balance" . $endingBalance->format() . ", DonorAccount #" . $donorAccountId);
         return $this->respond($response, new ActionPayload(200));
     }
 }

137) /home/barney/projects/matchbot/src/Application/Actions/Hooks/StripePaymentsUpdate.php:503    [M] Concat

--- Original
+++ New
@@ @@
         $donorAccountId = $donorAccount->getId();
         \assert(is_int($donorAccountId));
         // must be an int since it was persisted before.
-        $this->logger->info('Sent notification of receipt of account funds for Stripe Account: ' . $stripeAccountId->stripeCustomerId . ", transfer Amount" . $transferAmount->format() . ", new balance" . $endingBalance->format() . ", DonorAccount #" . $donorAccountId);
+        $this->logger->info('Sent notification of receipt of account funds for Stripe Account: ' . $stripeAccountId->stripeCustomerId . ", transfer Amount" . ", new balance" . $transferAmount->format() . $endingBalance->format() . ", DonorAccount #" . $donorAccountId);
         return $this->respond($response, new ActionPayload(200));
     }
 }

138) /home/barney/projects/matchbot/src/Application/Actions/Hooks/StripePaymentsUpdate.php:503    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         $donorAccountId = $donorAccount->getId();
         \assert(is_int($donorAccountId));
         // must be an int since it was persisted before.
-        $this->logger->info('Sent notification of receipt of account funds for Stripe Account: ' . $stripeAccountId->stripeCustomerId . ", transfer Amount" . $transferAmount->format() . ", new balance" . $endingBalance->format() . ", DonorAccount #" . $donorAccountId);
+        $this->logger->info('Sent notification of receipt of account funds for Stripe Account: ' . $stripeAccountId->stripeCustomerId . ", transfer Amount" . $transferAmount->format() . $endingBalance->format() . ", DonorAccount #" . $donorAccountId);
         return $this->respond($response, new ActionPayload(200));
     }
 }

139) /home/barney/projects/matchbot/src/Application/Actions/Hooks/StripePaymentsUpdate.php:503    [M] Concat

--- Original
+++ New
@@ @@
         $donorAccountId = $donorAccount->getId();
         \assert(is_int($donorAccountId));
         // must be an int since it was persisted before.
-        $this->logger->info('Sent notification of receipt of account funds for Stripe Account: ' . $stripeAccountId->stripeCustomerId . ", transfer Amount" . $transferAmount->format() . ", new balance" . $endingBalance->format() . ", DonorAccount #" . $donorAccountId);
+        $this->logger->info('Sent notification of receipt of account funds for Stripe Account: ' . $stripeAccountId->stripeCustomerId . ", transfer Amount" . $transferAmount->format() . $endingBalance->format() . ", new balance" . ", DonorAccount #" . $donorAccountId);
         return $this->respond($response, new ActionPayload(200));
     }
 }

140) /home/barney/projects/matchbot/src/Application/Actions/Hooks/StripePaymentsUpdate.php:503    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         $donorAccountId = $donorAccount->getId();
         \assert(is_int($donorAccountId));
         // must be an int since it was persisted before.
-        $this->logger->info('Sent notification of receipt of account funds for Stripe Account: ' . $stripeAccountId->stripeCustomerId . ", transfer Amount" . $transferAmount->format() . ", new balance" . $endingBalance->format() . ", DonorAccount #" . $donorAccountId);
+        $this->logger->info('Sent notification of receipt of account funds for Stripe Account: ' . $stripeAccountId->stripeCustomerId . ", transfer Amount" . $transferAmount->format() . ", new balance" . ", DonorAccount #" . $donorAccountId);
         return $this->respond($response, new ActionPayload(200));
     }
 }

141) /home/barney/projects/matchbot/src/Application/Actions/Hooks/StripePaymentsUpdate.php:503    [M] Concat

--- Original
+++ New
@@ @@
         $donorAccountId = $donorAccount->getId();
         \assert(is_int($donorAccountId));
         // must be an int since it was persisted before.
-        $this->logger->info('Sent notification of receipt of account funds for Stripe Account: ' . $stripeAccountId->stripeCustomerId . ", transfer Amount" . $transferAmount->format() . ", new balance" . $endingBalance->format() . ", DonorAccount #" . $donorAccountId);
+        $this->logger->info('Sent notification of receipt of account funds for Stripe Account: ' . $stripeAccountId->stripeCustomerId . ", transfer Amount" . $transferAmount->format() . ", new balance" . ", DonorAccount #" . $endingBalance->format() . $donorAccountId);
         return $this->respond($response, new ActionPayload(200));
     }
 }

142) /home/barney/projects/matchbot/src/Application/Actions/Hooks/StripePaymentsUpdate.php:503    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         $donorAccountId = $donorAccount->getId();
         \assert(is_int($donorAccountId));
         // must be an int since it was persisted before.
-        $this->logger->info('Sent notification of receipt of account funds for Stripe Account: ' . $stripeAccountId->stripeCustomerId . ", transfer Amount" . $transferAmount->format() . ", new balance" . $endingBalance->format() . ", DonorAccount #" . $donorAccountId);
+        $this->logger->info('Sent notification of receipt of account funds for Stripe Account: ' . $stripeAccountId->stripeCustomerId . ", transfer Amount" . $transferAmount->format() . ", new balance" . $endingBalance->format() . $donorAccountId);
         return $this->respond($response, new ActionPayload(200));
     }
 }

143) /home/barney/projects/matchbot/src/Application/Actions/Hooks/StripePaymentsUpdate.php:503    [M] Concat

--- Original
+++ New
@@ @@
         $donorAccountId = $donorAccount->getId();
         \assert(is_int($donorAccountId));
         // must be an int since it was persisted before.
-        $this->logger->info('Sent notification of receipt of account funds for Stripe Account: ' . $stripeAccountId->stripeCustomerId . ", transfer Amount" . $transferAmount->format() . ", new balance" . $endingBalance->format() . ", DonorAccount #" . $donorAccountId);
+        $this->logger->info('Sent notification of receipt of account funds for Stripe Account: ' . $stripeAccountId->stripeCustomerId . ", transfer Amount" . $transferAmount->format() . ", new balance" . $endingBalance->format() . $donorAccountId . ", DonorAccount #");
         return $this->respond($response, new ActionPayload(200));
     }
 }

144) /home/barney/projects/matchbot/src/Application/Actions/Hooks/StripePaymentsUpdate.php:503    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         $donorAccountId = $donorAccount->getId();
         \assert(is_int($donorAccountId));
         // must be an int since it was persisted before.
-        $this->logger->info('Sent notification of receipt of account funds for Stripe Account: ' . $stripeAccountId->stripeCustomerId . ", transfer Amount" . $transferAmount->format() . ", new balance" . $endingBalance->format() . ", DonorAccount #" . $donorAccountId);
+        $this->logger->info('Sent notification of receipt of account funds for Stripe Account: ' . $stripeAccountId->stripeCustomerId . ", transfer Amount" . $transferAmount->format() . ", new balance" . $endingBalance->format() . ", DonorAccount #");
         return $this->respond($response, new ActionPayload(200));
     }
 }

145) /home/barney/projects/matchbot/src/Application/Actions/Hooks/StripePaymentsUpdate.php:509    [M] DecrementInteger

--- Original
+++ New
@@ @@
         \assert(is_int($donorAccountId));
         // must be an int since it was persisted before.
         $this->logger->info('Sent notification of receipt of account funds for Stripe Account: ' . $stripeAccountId->stripeCustomerId . ", transfer Amount" . $transferAmount->format() . ", new balance" . $endingBalance->format() . ", DonorAccount #" . $donorAccountId);
-        return $this->respond($response, new ActionPayload(200));
+        return $this->respond($response, new ActionPayload(199));
     }
 }

146) /home/barney/projects/matchbot/src/Application/Actions/Hooks/StripePaymentsUpdate.php:509    [M] IncrementInteger

--- Original
+++ New
@@ @@
         \assert(is_int($donorAccountId));
         // must be an int since it was persisted before.
         $this->logger->info('Sent notification of receipt of account funds for Stripe Account: ' . $stripeAccountId->stripeCustomerId . ", transfer Amount" . $transferAmount->format() . ", new balance" . $endingBalance->format() . ", DonorAccount #" . $donorAccountId);
-        return $this->respond($response, new ActionPayload(200));
+        return $this->respond($response, new ActionPayload(201));
     }
 }

147) /home/barney/projects/matchbot/src/Application/Actions/Hooks/StripePayoutUpdate.php:112    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $object = $event->data->object;
         $payoutId = $object->id;
         if (!$object->automatic) {
-            // If we try to use the `payout` filter attribute in the `balanceTransactions` call
-            // in the manual payout case, Stripe errors out with "Balance transaction history
-            // can only be filtered on automatic transfers, not manual".
-            $this->logger->warning(sprintf('Skipping processing of manual Payout ID %s', $payoutId));
+            
             return $this->respond($response, new ActionPayload(204));
         }
         $message = (new StripePayout())->setConnectAccountId($event->account)->setPayoutId($payoutId);

150) /home/barney/projects/matchbot/src/Application/Actions/UpdatePaymentMethod.php:45    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $allPaymentMethodsOfCustomer = $this->stripeClient->customers->allPaymentMethods($customerId)->toArray()['data'];
         $allCustomersPaymentMethodIds = array_map(static fn(array $pm): string => $pm['id'], $allPaymentMethodsOfCustomer);
         if (!in_array($paymentMethodId, $allCustomersPaymentMethodIds, true)) {
-            $this->logger->warning("Refusing to update stripe payment method as not found for customer", compact('customerId', 'paymentMethodId'));
+            
             return $this->respondWithData($response, ['error' => 'Payment method not found'], StatusCodeInterface::STATUS_BAD_REQUEST);
         }
         $body = (string) $request->getBody();

151) /home/barney/projects/matchbot/src/Application/Actions/UpdatePaymentMethod.php:52    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         $allCustomersPaymentMethodIds = array_map(static fn(array $pm): string => $pm['id'], $allPaymentMethodsOfCustomer);
         if (!in_array($paymentMethodId, $allCustomersPaymentMethodIds, true)) {
             $this->logger->warning("Refusing to update stripe payment method as not found for customer", compact('customerId', 'paymentMethodId'));
-            return $this->respondWithData($response, ['error' => 'Payment method not found'], StatusCodeInterface::STATUS_BAD_REQUEST);
+            return $this->respondWithData($response, [], StatusCodeInterface::STATUS_BAD_REQUEST);
         }
         $body = (string) $request->getBody();
         // We don't need to know the details inside the billing details - we are just a thin layer between the front end

152) /home/barney/projects/matchbot/src/Application/Actions/UpdatePaymentMethod.php:76    [M] Identical

--- Original
+++ New
@@ @@
             // will not be able to update their card and can choose to delete it and add a new card for their
             // next donation. Donor will see the message in frontend.
             $exceptionClass = get_class($e);
-            $isExpectedExceptionMessage = $e->getMessage() === "Your card's security code is incorrect.";
+            $isExpectedExceptionMessage = $e->getMessage() !== "Your card's security code is incorrect.";
             $this->logger->log(level: $isExpectedExceptionMessage ? LogLevel::INFO : LogLevel::ERROR, message: "Failed to update payment method, {$exceptionClass}: " . $e->getMessage(), context: compact('customerId', 'paymentMethodId'));
             return $this->respondWithData($response, ['error' => $e->getMessage()], 400);
         }

153) /home/barney/projects/matchbot/src/Application/Actions/UpdatePaymentMethod.php:78    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             // next donation. Donor will see the message in frontend.
             $exceptionClass = get_class($e);
             $isExpectedExceptionMessage = $e->getMessage() === "Your card's security code is incorrect.";
-            $this->logger->log(level: $isExpectedExceptionMessage ? LogLevel::INFO : LogLevel::ERROR, message: "Failed to update payment method, {$exceptionClass}: " . $e->getMessage(), context: compact('customerId', 'paymentMethodId'));
+            
             return $this->respondWithData($response, ['error' => $e->getMessage()], 400);
         }
         return $this->respondWithData($response, data: [], statusCode: StatusCodeInterface::STATUS_NO_CONTENT);
     }
 }

154) /home/barney/projects/matchbot/src/Application/Actions/UpdatePaymentMethod.php:79    [M] Ternary

--- Original
+++ New
@@ @@
             // next donation. Donor will see the message in frontend.
             $exceptionClass = get_class($e);
             $isExpectedExceptionMessage = $e->getMessage() === "Your card's security code is incorrect.";
-            $this->logger->log(level: $isExpectedExceptionMessage ? LogLevel::INFO : LogLevel::ERROR, message: "Failed to update payment method, {$exceptionClass}: " . $e->getMessage(), context: compact('customerId', 'paymentMethodId'));
+            $this->logger->log(level: $isExpectedExceptionMessage ? LogLevel::ERROR : LogLevel::INFO, message: "Failed to update payment method, {$exceptionClass}: " . $e->getMessage(), context: compact('customerId', 'paymentMethodId'));
             return $this->respondWithData($response, ['error' => $e->getMessage()], 400);
         }
         return $this->respondWithData($response, data: [], statusCode: StatusCodeInterface::STATUS_NO_CONTENT);
     }
 }

155) /home/barney/projects/matchbot/src/Application/Actions/UpdatePaymentMethod.php:80    [M] Concat

--- Original
+++ New
@@ @@
             // next donation. Donor will see the message in frontend.
             $exceptionClass = get_class($e);
             $isExpectedExceptionMessage = $e->getMessage() === "Your card's security code is incorrect.";
-            $this->logger->log(level: $isExpectedExceptionMessage ? LogLevel::INFO : LogLevel::ERROR, message: "Failed to update payment method, {$exceptionClass}: " . $e->getMessage(), context: compact('customerId', 'paymentMethodId'));
+            $this->logger->log(level: $isExpectedExceptionMessage ? LogLevel::INFO : LogLevel::ERROR, message: $e->getMessage() . "Failed to update payment method, {$exceptionClass}: ", context: compact('customerId', 'paymentMethodId'));
             return $this->respondWithData($response, ['error' => $e->getMessage()], 400);
         }
         return $this->respondWithData($response, data: [], statusCode: StatusCodeInterface::STATUS_NO_CONTENT);
     }
 }

156) /home/barney/projects/matchbot/src/Application/Actions/UpdatePaymentMethod.php:80    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             // next donation. Donor will see the message in frontend.
             $exceptionClass = get_class($e);
             $isExpectedExceptionMessage = $e->getMessage() === "Your card's security code is incorrect.";
-            $this->logger->log(level: $isExpectedExceptionMessage ? LogLevel::INFO : LogLevel::ERROR, message: "Failed to update payment method, {$exceptionClass}: " . $e->getMessage(), context: compact('customerId', 'paymentMethodId'));
+            $this->logger->log(level: $isExpectedExceptionMessage ? LogLevel::INFO : LogLevel::ERROR, message: $e->getMessage(), context: compact('customerId', 'paymentMethodId'));
             return $this->respondWithData($response, ['error' => $e->getMessage()], 400);
         }
         return $this->respondWithData($response, data: [], statusCode: StatusCodeInterface::STATUS_NO_CONTENT);
     }
 }
