157) /home/barney/projects/matchbot/src/Application/Actions/UpdatePaymentMethod.php:80    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             // next donation. Donor will see the message in frontend.
             $exceptionClass = get_class($e);
             $isExpectedExceptionMessage = $e->getMessage() === "Your card's security code is incorrect.";
-            $this->logger->log(level: $isExpectedExceptionMessage ? LogLevel::INFO : LogLevel::ERROR, message: "Failed to update payment method, {$exceptionClass}: " . $e->getMessage(), context: compact('customerId', 'paymentMethodId'));
+            $this->logger->log(level: $isExpectedExceptionMessage ? LogLevel::INFO : LogLevel::ERROR, message: "Failed to update payment method, {$exceptionClass}: ", context: compact('customerId', 'paymentMethodId'));
             return $this->respondWithData($response, ['error' => $e->getMessage()], 400);
         }
         return $this->respondWithData($response, data: [], statusCode: StatusCodeInterface::STATUS_NO_CONTENT);
     }
 }

158) /home/barney/projects/matchbot/src/Application/Actions/UpdatePaymentMethod.php:83    [M] ArrayItem

--- Original
+++ New
@@ @@
             $exceptionClass = get_class($e);
             $isExpectedExceptionMessage = $e->getMessage() === "Your card's security code is incorrect.";
             $this->logger->log(level: $isExpectedExceptionMessage ? LogLevel::INFO : LogLevel::ERROR, message: "Failed to update payment method, {$exceptionClass}: " . $e->getMessage(), context: compact('customerId', 'paymentMethodId'));
-            return $this->respondWithData($response, ['error' => $e->getMessage()], 400);
+            return $this->respondWithData($response, ['error' > $e->getMessage()], 400);
         }
         return $this->respondWithData($response, data: [], statusCode: StatusCodeInterface::STATUS_NO_CONTENT);
     }
 }

159) /home/barney/projects/matchbot/src/Application/Actions/UpdatePaymentMethod.php:83    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
             $exceptionClass = get_class($e);
             $isExpectedExceptionMessage = $e->getMessage() === "Your card's security code is incorrect.";
             $this->logger->log(level: $isExpectedExceptionMessage ? LogLevel::INFO : LogLevel::ERROR, message: "Failed to update payment method, {$exceptionClass}: " . $e->getMessage(), context: compact('customerId', 'paymentMethodId'));
-            return $this->respondWithData($response, ['error' => $e->getMessage()], 400);
+            return $this->respondWithData($response, [], 400);
         }
         return $this->respondWithData($response, data: [], statusCode: StatusCodeInterface::STATUS_NO_CONTENT);
     }
 }

160) /home/barney/projects/matchbot/src/Application/Actions/UpdatePaymentMethod.php:83    [M] DecrementInteger

--- Original
+++ New
@@ @@
             $exceptionClass = get_class($e);
             $isExpectedExceptionMessage = $e->getMessage() === "Your card's security code is incorrect.";
             $this->logger->log(level: $isExpectedExceptionMessage ? LogLevel::INFO : LogLevel::ERROR, message: "Failed to update payment method, {$exceptionClass}: " . $e->getMessage(), context: compact('customerId', 'paymentMethodId'));
-            return $this->respondWithData($response, ['error' => $e->getMessage()], 400);
+            return $this->respondWithData($response, ['error' => $e->getMessage()], 399);
         }
         return $this->respondWithData($response, data: [], statusCode: StatusCodeInterface::STATUS_NO_CONTENT);
     }
 }

161) /home/barney/projects/matchbot/src/Application/Actions/UpdatePaymentMethod.php:83    [M] IncrementInteger

--- Original
+++ New
@@ @@
             $exceptionClass = get_class($e);
             $isExpectedExceptionMessage = $e->getMessage() === "Your card's security code is incorrect.";
             $this->logger->log(level: $isExpectedExceptionMessage ? LogLevel::INFO : LogLevel::ERROR, message: "Failed to update payment method, {$exceptionClass}: " . $e->getMessage(), context: compact('customerId', 'paymentMethodId'));
-            return $this->respondWithData($response, ['error' => $e->getMessage()], 400);
+            return $this->respondWithData($response, ['error' => $e->getMessage()], 401);
         }
         return $this->respondWithData($response, data: [], statusCode: StatusCodeInterface::STATUS_NO_CONTENT);
     }
 }

186) /home/barney/projects/matchbot/src/Application/Commands/LockingCommand.php:40    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             $return = $this->doExecute($input, $output);
             $this->releaseLock();
         } else {
-            $message = $this->getName() . ' did nothing as another instance had the lock.';
+            $message = $this->getName();
             $output->writeln($message);
             $this->logger->warning($message);
             return 0;

189) /home/barney/projects/matchbot/src/Application/Commands/LockingCommand.php:43    [M] DecrementInteger

--- Original
+++ New
@@ @@
             $message = $this->getName() . ' did nothing as another instance had the lock.';
             $output->writeln($message);
             $this->logger->warning($message);
-            return 0;
+            return -1;
             // Log at warning level to help monitoring volume but don't fire error alarms.
         }
         $this->finish($output);

190) /home/barney/projects/matchbot/src/Application/Commands/LockingCommand.php:43    [M] IncrementInteger

--- Original
+++ New
@@ @@
             $message = $this->getName() . ' did nothing as another instance had the lock.';
             $output->writeln($message);
             $this->logger->warning($message);
-            return 0;
+            return 1;
             // Log at warning level to help monitoring volume but don't fire error alarms.
         }
         $this->finish($output);

191) /home/barney/projects/matchbot/src/Application/Commands/ResetMatching.php:39    [M] Throw_

--- Original
+++ New
@@ @@
     protected function doExecute(InputInterface $input, OutputInterface $output) : int
     {
         if (getenv('APP_ENV') === 'production') {
-            // Erroring in one command stops the Composer script running the next one too, so this
-            // should also eliminate the possibility of Composer `matchbot:reset` clearing the
-            // Production database if run there in error.
-            throw new \RuntimeException('Reset not supported on Production');
+            new \RuntimeException('Reset not supported on Production');
         }
         try {
             $fundings = $this->campaignFundingRepository->findAll();

194) /home/barney/projects/matchbot/src/Application/Commands/ScheduledOutOfSyncFundsCheck.php:44    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     protected function doExecute(InputInterface $input, OutputInterface $output) : int
     {
         $bufferedOutput = new BufferedOutput();
-        $arrayInput = new ArrayInput(['mode' => 'check'], new InputDefinition([new InputArgument('mode', InputArgument::REQUIRED)]));
+        $arrayInput = new ArrayInput([], new InputDefinition([new InputArgument('mode', InputArgument::REQUIRED)]));
         parent::doExecute($arrayInput, $bufferedOutput);
         $chatMessage = new ChatMessage('Out of sync funds check');
         $message = 'Out of sync funds check completed' . ($this->outOfSyncFundFound ? " OUT OF SYNC FUNDS DETECTED" : " no out of sync funds detected");

195) /home/barney/projects/matchbot/src/Application/Commands/ScheduledOutOfSyncFundsCheck.php:44    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     protected function doExecute(InputInterface $input, OutputInterface $output) : int
     {
         $bufferedOutput = new BufferedOutput();
-        $arrayInput = new ArrayInput(['mode' => 'check'], new InputDefinition([new InputArgument('mode', InputArgument::REQUIRED)]));
+        $arrayInput = new ArrayInput(['mode' => 'check'], new InputDefinition([]));
         parent::doExecute($arrayInput, $bufferedOutput);
         $chatMessage = new ChatMessage('Out of sync funds check');
         $message = 'Out of sync funds check completed' . ($this->outOfSyncFundFound ? " OUT OF SYNC FUNDS DETECTED" : " no out of sync funds detected");

196) /home/barney/projects/matchbot/src/Application/Commands/ScheduledOutOfSyncFundsCheck.php:46    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         $bufferedOutput = new BufferedOutput();
         $arrayInput = new ArrayInput(['mode' => 'check'], new InputDefinition([new InputArgument('mode', InputArgument::REQUIRED)]));
-        parent::doExecute($arrayInput, $bufferedOutput);
+        
         $chatMessage = new ChatMessage('Out of sync funds check');
         $message = 'Out of sync funds check completed' . ($this->outOfSyncFundFound ? " OUT OF SYNC FUNDS DETECTED" : " no out of sync funds detected");
         $output->writeln($message);

197) /home/barney/projects/matchbot/src/Application/Commands/ScheduledOutOfSyncFundsCheck.php:49    [M] Ternary

--- Original
+++ New
@@ @@
         $arrayInput = new ArrayInput(['mode' => 'check'], new InputDefinition([new InputArgument('mode', InputArgument::REQUIRED)]));
         parent::doExecute($arrayInput, $bufferedOutput);
         $chatMessage = new ChatMessage('Out of sync funds check');
-        $message = 'Out of sync funds check completed' . ($this->outOfSyncFundFound ? " OUT OF SYNC FUNDS DETECTED" : " no out of sync funds detected");
+        $message = 'Out of sync funds check completed' . ($this->outOfSyncFundFound ? " no out of sync funds detected" : " OUT OF SYNC FUNDS DETECTED");
         $output->writeln($message);
         if ($this->outOfSyncFundFound) {
             $env = getenv('APP_ENV');

199) /home/barney/projects/matchbot/src/Application/Commands/ScheduledOutOfSyncFundsCheck.php:49    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         $arrayInput = new ArrayInput(['mode' => 'check'], new InputDefinition([new InputArgument('mode', InputArgument::REQUIRED)]));
         parent::doExecute($arrayInput, $bufferedOutput);
         $chatMessage = new ChatMessage('Out of sync funds check');
-        $message = 'Out of sync funds check completed' . ($this->outOfSyncFundFound ? " OUT OF SYNC FUNDS DETECTED" : " no out of sync funds detected");
+        $message = $this->outOfSyncFundFound ? " OUT OF SYNC FUNDS DETECTED" : " no out of sync funds detected";
         $output->writeln($message);
         if ($this->outOfSyncFundFound) {
             $env = getenv('APP_ENV');

202) /home/barney/projects/matchbot/src/Application/Commands/ScheduledOutOfSyncFundsCheck.php:61    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             $env = getenv('APP_ENV');
             \assert(is_string($env));
             $options = (new SlackOptions())->block(new SlackHeaderBlock(sprintf('[%s] %s', $env, $message)))->block((new SlackSectionBlock())->text($bufferedOutput->fetch()));
-            $chatMessage->options($options);
+            
             $this->chatter->send($chatMessage);
         }
         return 0;
     }
 }

203) /home/barney/projects/matchbot/src/Application/Commands/ScheduledOutOfSyncFundsCheck.php:63    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             \assert(is_string($env));
             $options = (new SlackOptions())->block(new SlackHeaderBlock(sprintf('[%s] %s', $env, $message)))->block((new SlackSectionBlock())->text($bufferedOutput->fetch()));
             $chatMessage->options($options);
-            $this->chatter->send($chatMessage);
+            
         }
         return 0;
     }
 }

204) /home/barney/projects/matchbot/src/Application/Commands/ScheduledOutOfSyncFundsCheck.php:66    [M] DecrementInteger

--- Original
+++ New
@@ @@
             $chatMessage->options($options);
             $this->chatter->send($chatMessage);
         }
-        return 0;
+        return -1;
     }
 }

205) /home/barney/projects/matchbot/src/Application/Commands/ScheduledOutOfSyncFundsCheck.php:66    [M] IncrementInteger

--- Original
+++ New
@@ @@
             $chatMessage->options($options);
             $this->chatter->send($chatMessage);
         }
-        return 0;
+        return 1;
     }
 }

208) /home/barney/projects/matchbot/src/Application/Commands/UpdateCampaigns.php:64    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
                     // before, but no longer meets the requirements to run it. Our Saleforce APIs
                     // will then 404 and no longer return current data for the campaign.
                     if ($campaign->getEndDate() < new \DateTime()) {
-                        $this->logger->info(sprintf('Skipping unknown PRODUCTION campaign %s whose end date had passed – charity inactive?', $campaign->getSalesforceId()));
+                        
                     } else {
                         $this->logger->error(sprintf('Skipping unknown PRODUCTION campaign %s – charity inactive?', $campaign->getSalesforceId()));
                     }

209) /home/barney/projects/matchbot/src/Application/Commands/UpdateCampaigns.php:69    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
                     if ($campaign->getEndDate() < new \DateTime()) {
                         $this->logger->info(sprintf('Skipping unknown PRODUCTION campaign %s whose end date had passed – charity inactive?', $campaign->getSalesforceId()));
                     } else {
-                        $this->logger->error(sprintf('Skipping unknown PRODUCTION campaign %s – charity inactive?', $campaign->getSalesforceId()));
+                        
                     }
                 } else {
                     // Chances are a sandbox refresh has led to this campaign being deleted in the Salesforce sandbox.

210) /home/barney/projects/matchbot/src/Application/Commands/UpdateCampaigns.php:79    [M] Concat

--- Original
+++ New
@@ @@
                     $output->writeln('Skipping unknown sandbox campaign ' . $campaign->getSalesforceId());
                 }
             } catch (DomainCurrencyMustNotChangeException $exception) {
-                $output->writeln('Skipping invalid currency change campaign ' . $campaign->getSalesforceId());
+                $output->writeln($campaign->getSalesforceId() . 'Skipping invalid currency change campaign ');
             } catch (TransferException $exception) {
                 $this->logger->info(sprintf('Retrying campaign %s due to transfer error "%s"', $campaign->getSalesforceId(), $exception->getMessage()));
                 try {

211) /home/barney/projects/matchbot/src/Application/Commands/UpdateCampaigns.php:79    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
                     $output->writeln('Skipping unknown sandbox campaign ' . $campaign->getSalesforceId());
                 }
             } catch (DomainCurrencyMustNotChangeException $exception) {
-                $output->writeln('Skipping invalid currency change campaign ' . $campaign->getSalesforceId());
+                $output->writeln($campaign->getSalesforceId());
             } catch (TransferException $exception) {
                 $this->logger->info(sprintf('Retrying campaign %s due to transfer error "%s"', $campaign->getSalesforceId(), $exception->getMessage()));
                 try {

215) /home/barney/projects/matchbot/src/Application/Fees/Calculator.php:44    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
     {
         $this->pspFeeSettings = $settings[$psp]['fee'];
         if (!in_array($this->cardBrand, [...self::STRIPE_CARD_BRANDS, null], true)) {
-            throw new \UnexpectedValueException('Unexpected card brand, expected brands are ' . implode(', ', self::STRIPE_CARD_BRANDS));
+            throw new \UnexpectedValueException(implode(', ', self::STRIPE_CARD_BRANDS));
         }
     }
     public function getCoreFee() : string

216) /home/barney/projects/matchbot/src/Application/Fees/Calculator.php:44    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
     {
         $this->pspFeeSettings = $settings[$psp]['fee'];
         if (!in_array($this->cardBrand, [...self::STRIPE_CARD_BRANDS, null], true)) {
-            throw new \UnexpectedValueException('Unexpected card brand, expected brands are ' . implode(', ', self::STRIPE_CARD_BRANDS));
+            throw new \UnexpectedValueException('Unexpected card brand, expected brands are ');
         }
     }
     public function getCoreFee() : string

218) /home/barney/projects/matchbot/src/Application/Handlers/HttpErrorHandler.php:29    [M] DecrementInteger

--- Original
+++ New
@@ @@
     protected function respond() : Response
     {
         $exception = $this->exception;
-        $statusCode = 500;
+        $statusCode = 499;
         $error = new ActionError(ActionError::SERVER_ERROR, 'An internal error has occurred while processing your request.');
         if ($exception instanceof HttpException) {
             $statusCode = $exception->getCode();

219) /home/barney/projects/matchbot/src/Application/Handlers/HttpErrorHandler.php:29    [M] IncrementInteger

--- Original
+++ New
@@ @@
     protected function respond() : Response
     {
         $exception = $this->exception;
-        $statusCode = 500;
+        $statusCode = 501;
         $error = new ActionError(ActionError::SERVER_ERROR, 'An internal error has occurred while processing your request.');
         if ($exception instanceof HttpException) {
             $statusCode = $exception->getCode();

220) /home/barney/projects/matchbot/src/Application/Handlers/HttpErrorHandler.php:35    [M] InstanceOf_

--- Original
+++ New
@@ @@
         $exception = $this->exception;
         $statusCode = 500;
         $error = new ActionError(ActionError::SERVER_ERROR, 'An internal error has occurred while processing your request.');
-        if ($exception instanceof HttpException) {
+        if (true) {
             $statusCode = $exception->getCode();
             $error->setDescription($exception->getMessage());
             if ($exception instanceof HttpNotFoundException) {

221) /home/barney/projects/matchbot/src/Application/Handlers/HttpErrorHandler.php:35    [M] InstanceOf_

--- Original
+++ New
@@ @@
         $exception = $this->exception;
         $statusCode = 500;
         $error = new ActionError(ActionError::SERVER_ERROR, 'An internal error has occurred while processing your request.');
-        if ($exception instanceof HttpException) {
+        if (false) {
             $statusCode = $exception->getCode();
             $error->setDescription($exception->getMessage());
             if ($exception instanceof HttpNotFoundException) {

222) /home/barney/projects/matchbot/src/Application/Handlers/HttpErrorHandler.php:37    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $error = new ActionError(ActionError::SERVER_ERROR, 'An internal error has occurred while processing your request.');
         if ($exception instanceof HttpException) {
             $statusCode = $exception->getCode();
-            $error->setDescription($exception->getMessage());
+            
             if ($exception instanceof HttpNotFoundException) {
                 $error->setType(ActionError::RESOURCE_NOT_FOUND);
             } elseif ($exception instanceof HttpMethodNotAllowedException) {

223) /home/barney/projects/matchbot/src/Application/Handlers/HttpErrorHandler.php:39    [M] InstanceOf_

--- Original
+++ New
@@ @@
         if ($exception instanceof HttpException) {
             $statusCode = $exception->getCode();
             $error->setDescription($exception->getMessage());
-            if ($exception instanceof HttpNotFoundException) {
+            if (true) {
                 $error->setType(ActionError::RESOURCE_NOT_FOUND);
             } elseif ($exception instanceof HttpMethodNotAllowedException) {
                 $error->setType(ActionError::NOT_ALLOWED);

224) /home/barney/projects/matchbot/src/Application/Handlers/HttpErrorHandler.php:39    [M] InstanceOf_

--- Original
+++ New
@@ @@
         if ($exception instanceof HttpException) {
             $statusCode = $exception->getCode();
             $error->setDescription($exception->getMessage());
-            if ($exception instanceof HttpNotFoundException) {
+            if (false) {
                 $error->setType(ActionError::RESOURCE_NOT_FOUND);
             } elseif ($exception instanceof HttpMethodNotAllowedException) {
                 $error->setType(ActionError::NOT_ALLOWED);

225) /home/barney/projects/matchbot/src/Application/Handlers/HttpErrorHandler.php:40    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             $statusCode = $exception->getCode();
             $error->setDescription($exception->getMessage());
             if ($exception instanceof HttpNotFoundException) {
-                $error->setType(ActionError::RESOURCE_NOT_FOUND);
+                
             } elseif ($exception instanceof HttpMethodNotAllowedException) {
                 $error->setType(ActionError::NOT_ALLOWED);
             } elseif ($exception instanceof HttpUnauthorizedException) {

226) /home/barney/projects/matchbot/src/Application/Handlers/HttpErrorHandler.php:41    [M] InstanceOf_

--- Original
+++ New
@@ @@
             $error->setDescription($exception->getMessage());
             if ($exception instanceof HttpNotFoundException) {
                 $error->setType(ActionError::RESOURCE_NOT_FOUND);
-            } elseif ($exception instanceof HttpMethodNotAllowedException) {
+            } elseif (true) {
                 $error->setType(ActionError::NOT_ALLOWED);
             } elseif ($exception instanceof HttpUnauthorizedException) {
                 $error->setType(ActionError::UNAUTHENTICATED);

227) /home/barney/projects/matchbot/src/Application/Handlers/HttpErrorHandler.php:41    [M] InstanceOf_

--- Original
+++ New
@@ @@
             $error->setDescription($exception->getMessage());
             if ($exception instanceof HttpNotFoundException) {
                 $error->setType(ActionError::RESOURCE_NOT_FOUND);
-            } elseif ($exception instanceof HttpMethodNotAllowedException) {
+            } elseif (false) {
                 $error->setType(ActionError::NOT_ALLOWED);
             } elseif ($exception instanceof HttpUnauthorizedException) {
                 $error->setType(ActionError::UNAUTHENTICATED);

228) /home/barney/projects/matchbot/src/Application/Handlers/HttpErrorHandler.php:42    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             if ($exception instanceof HttpNotFoundException) {
                 $error->setType(ActionError::RESOURCE_NOT_FOUND);
             } elseif ($exception instanceof HttpMethodNotAllowedException) {
-                $error->setType(ActionError::NOT_ALLOWED);
+                
             } elseif ($exception instanceof HttpUnauthorizedException) {
                 $error->setType(ActionError::UNAUTHENTICATED);
             } elseif ($exception instanceof HttpForbiddenException) {

240) /home/barney/projects/matchbot/src/Application/Handlers/HttpErrorHandler.php:50    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             } elseif ($exception instanceof HttpBadRequestException) {
                 $error->setType(ActionError::BAD_REQUEST);
             } elseif ($exception instanceof HttpNotImplementedException) {
-                $error->setType(ActionError::NOT_IMPLEMENTED);
+                
             }
         }
         if (!$exception instanceof HttpException && ($exception instanceof Exception || $exception instanceof Throwable) && $this->displayErrorDetails) {

241) /home/barney/projects/matchbot/src/Application/Handlers/HttpErrorHandler.php:55    [M] InstanceOf_

--- Original
+++ New
@@ @@
                 $error->setType(ActionError::NOT_IMPLEMENTED);
             }
         }
-        if (!$exception instanceof HttpException && ($exception instanceof Exception || $exception instanceof Throwable) && $this->displayErrorDetails) {
+        if (!true && ($exception instanceof Exception || $exception instanceof Throwable) && $this->displayErrorDetails) {
             $error->setDescription($exception->getMessage());
         }
         $payload = new ActionPayload($statusCode, null, $error);

242) /home/barney/projects/matchbot/src/Application/Handlers/HttpErrorHandler.php:55    [M] InstanceOf_

--- Original
+++ New
@@ @@
                 $error->setType(ActionError::NOT_IMPLEMENTED);
             }
         }
-        if (!$exception instanceof HttpException && ($exception instanceof Exception || $exception instanceof Throwable) && $this->displayErrorDetails) {
+        if (!false && ($exception instanceof Exception || $exception instanceof Throwable) && $this->displayErrorDetails) {
             $error->setDescription($exception->getMessage());
         }
         $payload = new ActionPayload($statusCode, null, $error);

243) /home/barney/projects/matchbot/src/Application/Handlers/HttpErrorHandler.php:55    [M] LogicalNot

--- Original
+++ New
@@ @@
                 $error->setType(ActionError::NOT_IMPLEMENTED);
             }
         }
-        if (!$exception instanceof HttpException && ($exception instanceof Exception || $exception instanceof Throwable) && $this->displayErrorDetails) {
+        if ($exception instanceof HttpException && ($exception instanceof Exception || $exception instanceof Throwable) && $this->displayErrorDetails) {
             $error->setDescription($exception->getMessage());
         }
         $payload = new ActionPayload($statusCode, null, $error);

244) /home/barney/projects/matchbot/src/Application/Handlers/HttpErrorHandler.php:55    [M] LogicalAnd

--- Original
+++ New
@@ @@
                 $error->setType(ActionError::NOT_IMPLEMENTED);
             }
         }
-        if (!$exception instanceof HttpException && ($exception instanceof Exception || $exception instanceof Throwable) && $this->displayErrorDetails) {
+        if ((!$exception instanceof HttpException || ($exception instanceof Exception || $exception instanceof Throwable)) && $this->displayErrorDetails) {
             $error->setDescription($exception->getMessage());
         }
         $payload = new ActionPayload($statusCode, null, $error);

245) /home/barney/projects/matchbot/src/Application/Handlers/HttpErrorHandler.php:55    [M] LogicalAnd

--- Original
+++ New
@@ @@
                 $error->setType(ActionError::NOT_IMPLEMENTED);
             }
         }
-        if (!$exception instanceof HttpException && ($exception instanceof Exception || $exception instanceof Throwable) && $this->displayErrorDetails) {
+        if (!$exception instanceof HttpException && ($exception instanceof Exception || $exception instanceof Throwable) || $this->displayErrorDetails) {
             $error->setDescription($exception->getMessage());
         }
         $payload = new ActionPayload($statusCode, null, $error);

246) /home/barney/projects/matchbot/src/Application/Handlers/HttpErrorHandler.php:55    [M] LogicalAndAllSubExprNegation

--- Original
+++ New
@@ @@
                 $error->setType(ActionError::NOT_IMPLEMENTED);
             }
         }
-        if (!$exception instanceof HttpException && ($exception instanceof Exception || $exception instanceof Throwable) && $this->displayErrorDetails) {
+        if ($exception instanceof HttpException && !($exception instanceof Exception || $exception instanceof Throwable) && !$this->displayErrorDetails) {
             $error->setDescription($exception->getMessage());
         }
         $payload = new ActionPayload($statusCode, null, $error);

247) /home/barney/projects/matchbot/src/Application/Handlers/HttpErrorHandler.php:55    [M] LogicalAndNegation

--- Original
+++ New
@@ @@
                 $error->setType(ActionError::NOT_IMPLEMENTED);
             }
         }
-        if (!$exception instanceof HttpException && ($exception instanceof Exception || $exception instanceof Throwable) && $this->displayErrorDetails) {
+        if (!(!$exception instanceof HttpException && ($exception instanceof Exception || $exception instanceof Throwable) && $this->displayErrorDetails)) {
             $error->setDescription($exception->getMessage());
         }
         $payload = new ActionPayload($statusCode, null, $error);

248) /home/barney/projects/matchbot/src/Application/Handlers/HttpErrorHandler.php:56    [M] InstanceOf_

--- Original
+++ New
@@ @@
                 $error->setType(ActionError::NOT_IMPLEMENTED);
             }
         }
-        if (!$exception instanceof HttpException && ($exception instanceof Exception || $exception instanceof Throwable) && $this->displayErrorDetails) {
+        if (!$exception instanceof HttpException && (true || $exception instanceof Throwable) && $this->displayErrorDetails) {
             $error->setDescription($exception->getMessage());
         }
         $payload = new ActionPayload($statusCode, null, $error);

249) /home/barney/projects/matchbot/src/Application/Handlers/HttpErrorHandler.php:56    [M] InstanceOf_

--- Original
+++ New
@@ @@
                 $error->setType(ActionError::NOT_IMPLEMENTED);
             }
         }
-        if (!$exception instanceof HttpException && ($exception instanceof Exception || $exception instanceof Throwable) && $this->displayErrorDetails) {
+        if (!$exception instanceof HttpException && (false || $exception instanceof Throwable) && $this->displayErrorDetails) {
             $error->setDescription($exception->getMessage());
         }
         $payload = new ActionPayload($statusCode, null, $error);
