250) /home/barney/projects/matchbot/src/Application/Handlers/HttpErrorHandler.php:56    [M] InstanceOf_

--- Original
+++ New
@@ @@
                 $error->setType(ActionError::NOT_IMPLEMENTED);
             }
         }
-        if (!$exception instanceof HttpException && ($exception instanceof Exception || $exception instanceof Throwable) && $this->displayErrorDetails) {
+        if (!$exception instanceof HttpException && ($exception instanceof Exception || true) && $this->displayErrorDetails) {
             $error->setDescription($exception->getMessage());
         }
         $payload = new ActionPayload($statusCode, null, $error);

251) /home/barney/projects/matchbot/src/Application/Handlers/HttpErrorHandler.php:56    [M] InstanceOf_

--- Original
+++ New
@@ @@
                 $error->setType(ActionError::NOT_IMPLEMENTED);
             }
         }
-        if (!$exception instanceof HttpException && ($exception instanceof Exception || $exception instanceof Throwable) && $this->displayErrorDetails) {
+        if (!$exception instanceof HttpException && ($exception instanceof Exception || false) && $this->displayErrorDetails) {
             $error->setDescription($exception->getMessage());
         }
         $payload = new ActionPayload($statusCode, null, $error);

252) /home/barney/projects/matchbot/src/Application/Handlers/HttpErrorHandler.php:56    [M] LogicalOr

--- Original
+++ New
@@ @@
                 $error->setType(ActionError::NOT_IMPLEMENTED);
             }
         }
-        if (!$exception instanceof HttpException && ($exception instanceof Exception || $exception instanceof Throwable) && $this->displayErrorDetails) {
+        if (!$exception instanceof HttpException && ($exception instanceof Exception && $exception instanceof Throwable) && $this->displayErrorDetails) {
             $error->setDescription($exception->getMessage());
         }
         $payload = new ActionPayload($statusCode, null, $error);

253) /home/barney/projects/matchbot/src/Application/Handlers/HttpErrorHandler.php:56    [M] LogicalOrAllSubExprNegation

--- Original
+++ New
@@ @@
                 $error->setType(ActionError::NOT_IMPLEMENTED);
             }
         }
-        if (!$exception instanceof HttpException && ($exception instanceof Exception || $exception instanceof Throwable) && $this->displayErrorDetails) {
+        if (!$exception instanceof HttpException && (!$exception instanceof Exception || !$exception instanceof Throwable) && $this->displayErrorDetails) {
             $error->setDescription($exception->getMessage());
         }
         $payload = new ActionPayload($statusCode, null, $error);

254) /home/barney/projects/matchbot/src/Application/Handlers/HttpErrorHandler.php:56    [M] LogicalOrNegation

--- Original
+++ New
@@ @@
                 $error->setType(ActionError::NOT_IMPLEMENTED);
             }
         }
-        if (!$exception instanceof HttpException && ($exception instanceof Exception || $exception instanceof Throwable) && $this->displayErrorDetails) {
+        if (!$exception instanceof HttpException && !($exception instanceof Exception || $exception instanceof Throwable) && $this->displayErrorDetails) {
             $error->setDescription($exception->getMessage());
         }
         $payload = new ActionPayload($statusCode, null, $error);

255) /home/barney/projects/matchbot/src/Application/Handlers/HttpErrorHandler.php:59    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             }
         }
         if (!$exception instanceof HttpException && ($exception instanceof Exception || $exception instanceof Throwable) && $this->displayErrorDetails) {
-            $error->setDescription($exception->getMessage());
+            
         }
         $payload = new ActionPayload($statusCode, null, $error);
         $encodedPayload = json_encode($payload, JSON_PRETTY_PRINT);

256) /home/barney/projects/matchbot/src/Application/Handlers/HttpErrorHandler.php:66    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $payload = new ActionPayload($statusCode, null, $error);
         $encodedPayload = json_encode($payload, JSON_PRETTY_PRINT);
         $response = $this->responseFactory->createResponse($statusCode);
-        $response->getBody()->write($encodedPayload);
+        
         if (!$this->exception instanceof HttpException) {
             $this->logError(sprintf("%s: %s \n#\n %s \n %s", get_class($this->exception), $this->exception->getMessage(), $this->exception->getFile() . ":" . $this->exception->getLine(), $this->exception->getTraceAsString()));
         }

257) /home/barney/projects/matchbot/src/Application/Handlers/HttpErrorHandler.php:68    [M] InstanceOf_

--- Original
+++ New
@@ @@
         $encodedPayload = json_encode($payload, JSON_PRETTY_PRINT);
         $response = $this->responseFactory->createResponse($statusCode);
         $response->getBody()->write($encodedPayload);
-        if (!$this->exception instanceof HttpException) {
+        if (!true) {
             $this->logError(sprintf("%s: %s \n#\n %s \n %s", get_class($this->exception), $this->exception->getMessage(), $this->exception->getFile() . ":" . $this->exception->getLine(), $this->exception->getTraceAsString()));
         }
         return $response->withHeader('Content-Type', 'application/json');
     }
 }

258) /home/barney/projects/matchbot/src/Application/Handlers/HttpErrorHandler.php:68    [M] InstanceOf_

--- Original
+++ New
@@ @@
         $encodedPayload = json_encode($payload, JSON_PRETTY_PRINT);
         $response = $this->responseFactory->createResponse($statusCode);
         $response->getBody()->write($encodedPayload);
-        if (!$this->exception instanceof HttpException) {
+        if (!false) {
             $this->logError(sprintf("%s: %s \n#\n %s \n %s", get_class($this->exception), $this->exception->getMessage(), $this->exception->getFile() . ":" . $this->exception->getLine(), $this->exception->getTraceAsString()));
         }
         return $response->withHeader('Content-Type', 'application/json');
     }
 }

259) /home/barney/projects/matchbot/src/Application/Handlers/HttpErrorHandler.php:68    [M] LogicalNot

--- Original
+++ New
@@ @@
         $encodedPayload = json_encode($payload, JSON_PRETTY_PRINT);
         $response = $this->responseFactory->createResponse($statusCode);
         $response->getBody()->write($encodedPayload);
-        if (!$this->exception instanceof HttpException) {
+        if ($this->exception instanceof HttpException) {
             $this->logError(sprintf("%s: %s \n#\n %s \n %s", get_class($this->exception), $this->exception->getMessage(), $this->exception->getFile() . ":" . $this->exception->getLine(), $this->exception->getTraceAsString()));
         }
         return $response->withHeader('Content-Type', 'application/json');
     }
 }

260) /home/barney/projects/matchbot/src/Application/Handlers/HttpErrorHandler.php:69    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $response = $this->responseFactory->createResponse($statusCode);
         $response->getBody()->write($encodedPayload);
         if (!$this->exception instanceof HttpException) {
-            $this->logError(sprintf("%s: %s \n#\n %s \n %s", get_class($this->exception), $this->exception->getMessage(), $this->exception->getFile() . ":" . $this->exception->getLine(), $this->exception->getTraceAsString()));
+            
         }
         return $response->withHeader('Content-Type', 'application/json');
     }
 }

261) /home/barney/projects/matchbot/src/Application/Handlers/HttpErrorHandler.php:73    [M] Concat

--- Original
+++ New
@@ @@
         $response = $this->responseFactory->createResponse($statusCode);
         $response->getBody()->write($encodedPayload);
         if (!$this->exception instanceof HttpException) {
-            $this->logError(sprintf("%s: %s \n#\n %s \n %s", get_class($this->exception), $this->exception->getMessage(), $this->exception->getFile() . ":" . $this->exception->getLine(), $this->exception->getTraceAsString()));
+            $this->logError(sprintf("%s: %s \n#\n %s \n %s", get_class($this->exception), $this->exception->getMessage(), ":" . $this->exception->getFile() . $this->exception->getLine(), $this->exception->getTraceAsString()));
         }
         return $response->withHeader('Content-Type', 'application/json');
     }
 }

262) /home/barney/projects/matchbot/src/Application/Handlers/HttpErrorHandler.php:73    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         $response = $this->responseFactory->createResponse($statusCode);
         $response->getBody()->write($encodedPayload);
         if (!$this->exception instanceof HttpException) {
-            $this->logError(sprintf("%s: %s \n#\n %s \n %s", get_class($this->exception), $this->exception->getMessage(), $this->exception->getFile() . ":" . $this->exception->getLine(), $this->exception->getTraceAsString()));
+            $this->logError(sprintf("%s: %s \n#\n %s \n %s", get_class($this->exception), $this->exception->getMessage(), ":" . $this->exception->getLine(), $this->exception->getTraceAsString()));
         }
         return $response->withHeader('Content-Type', 'application/json');
     }
 }

263) /home/barney/projects/matchbot/src/Application/Handlers/HttpErrorHandler.php:73    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         $response = $this->responseFactory->createResponse($statusCode);
         $response->getBody()->write($encodedPayload);
         if (!$this->exception instanceof HttpException) {
-            $this->logError(sprintf("%s: %s \n#\n %s \n %s", get_class($this->exception), $this->exception->getMessage(), $this->exception->getFile() . ":" . $this->exception->getLine(), $this->exception->getTraceAsString()));
+            $this->logError(sprintf("%s: %s \n#\n %s \n %s", get_class($this->exception), $this->exception->getMessage(), $this->exception->getFile() . $this->exception->getLine(), $this->exception->getTraceAsString()));
         }
         return $response->withHeader('Content-Type', 'application/json');
     }
 }

264) /home/barney/projects/matchbot/src/Application/Handlers/HttpErrorHandler.php:73    [M] Concat

--- Original
+++ New
@@ @@
         $response = $this->responseFactory->createResponse($statusCode);
         $response->getBody()->write($encodedPayload);
         if (!$this->exception instanceof HttpException) {
-            $this->logError(sprintf("%s: %s \n#\n %s \n %s", get_class($this->exception), $this->exception->getMessage(), $this->exception->getFile() . ":" . $this->exception->getLine(), $this->exception->getTraceAsString()));
+            $this->logError(sprintf("%s: %s \n#\n %s \n %s", get_class($this->exception), $this->exception->getMessage(), $this->exception->getFile() . $this->exception->getLine() . ":", $this->exception->getTraceAsString()));
         }
         return $response->withHeader('Content-Type', 'application/json');
     }
 }

265) /home/barney/projects/matchbot/src/Application/Handlers/HttpErrorHandler.php:73    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         $response = $this->responseFactory->createResponse($statusCode);
         $response->getBody()->write($encodedPayload);
         if (!$this->exception instanceof HttpException) {
-            $this->logError(sprintf("%s: %s \n#\n %s \n %s", get_class($this->exception), $this->exception->getMessage(), $this->exception->getFile() . ":" . $this->exception->getLine(), $this->exception->getTraceAsString()));
+            $this->logError(sprintf("%s: %s \n#\n %s \n %s", get_class($this->exception), $this->exception->getMessage(), $this->exception->getFile() . ":", $this->exception->getTraceAsString()));
         }
         return $response->withHeader('Content-Type', 'application/json');
     }
 }

266) /home/barney/projects/matchbot/src/Application/Handlers/ShutdownHandler.php:25    [M] IfNegation

--- Original
+++ New
@@ @@
     public function __invoke()
     {
         $error = error_get_last();
-        if ($error) {
+        if (!$error) {
             $errorFile = $error['file'];
             $errorLine = $error['line'];
             $errorMessage = $error['message'];

269) /home/barney/projects/matchbot/src/Application/Handlers/ShutdownHandler.php:58    [M] Identical

--- Original
+++ New
@@ @@
             // Skip emitting a shutdown response from native warnings on non-dev envs, since events like Redis
             // connection failures cause these. These are already logged and if error-like output is emitted
             // alongside `/ping`'s more helpful output, its response body is left malformatted.
-            $isServiceResolutionWarning = $errorType === E_WARNING && str_contains($message, 'getaddrinfo failed: Name or service not known');
+            $isServiceResolutionWarning = $errorType !== E_WARNING && str_contains($message, 'getaddrinfo failed: Name or service not known');
             if ($isServiceResolutionWarning) {
                 return;
             }

270) /home/barney/projects/matchbot/src/Application/Handlers/ShutdownHandler.php:58    [M] LogicalAnd

--- Original
+++ New
@@ @@
             // Skip emitting a shutdown response from native warnings on non-dev envs, since events like Redis
             // connection failures cause these. These are already logged and if error-like output is emitted
             // alongside `/ping`'s more helpful output, its response body is left malformatted.
-            $isServiceResolutionWarning = $errorType === E_WARNING && str_contains($message, 'getaddrinfo failed: Name or service not known');
+            $isServiceResolutionWarning = $errorType === E_WARNING || str_contains($message, 'getaddrinfo failed: Name or service not known');
             if ($isServiceResolutionWarning) {
                 return;
             }

271) /home/barney/projects/matchbot/src/Application/Handlers/ShutdownHandler.php:58    [M] LogicalAndAllSubExprNegation

--- Original
+++ New
@@ @@
             // Skip emitting a shutdown response from native warnings on non-dev envs, since events like Redis
             // connection failures cause these. These are already logged and if error-like output is emitted
             // alongside `/ping`'s more helpful output, its response body is left malformatted.
-            $isServiceResolutionWarning = $errorType === E_WARNING && str_contains($message, 'getaddrinfo failed: Name or service not known');
+            $isServiceResolutionWarning = !($errorType === E_WARNING) && !str_contains($message, 'getaddrinfo failed: Name or service not known');
             if ($isServiceResolutionWarning) {
                 return;
             }

272) /home/barney/projects/matchbot/src/Application/Handlers/ShutdownHandler.php:58    [M] LogicalAndNegation

--- Original
+++ New
@@ @@
             // Skip emitting a shutdown response from native warnings on non-dev envs, since events like Redis
             // connection failures cause these. These are already logged and if error-like output is emitted
             // alongside `/ping`'s more helpful output, its response body is left malformatted.
-            $isServiceResolutionWarning = $errorType === E_WARNING && str_contains($message, 'getaddrinfo failed: Name or service not known');
+            $isServiceResolutionWarning = !($errorType === E_WARNING && str_contains($message, 'getaddrinfo failed: Name or service not known'));
             if ($isServiceResolutionWarning) {
                 return;
             }

273) /home/barney/projects/matchbot/src/Application/Handlers/ShutdownHandler.php:58    [M] LogicalAndSingleSubExprNegation

--- Original
+++ New
@@ @@
             // Skip emitting a shutdown response from native warnings on non-dev envs, since events like Redis
             // connection failures cause these. These are already logged and if error-like output is emitted
             // alongside `/ping`'s more helpful output, its response body is left malformatted.
-            $isServiceResolutionWarning = $errorType === E_WARNING && str_contains($message, 'getaddrinfo failed: Name or service not known');
+            $isServiceResolutionWarning = $errorType === E_WARNING && !str_contains($message, 'getaddrinfo failed: Name or service not known');
             if ($isServiceResolutionWarning) {
                 return;
             }

274) /home/barney/projects/matchbot/src/Application/Handlers/ShutdownHandler.php:61    [M] IfNegation

--- Original
+++ New
@@ @@
             // connection failures cause these. These are already logged and if error-like output is emitted
             // alongside `/ping`'s more helpful output, its response body is left malformatted.
             $isServiceResolutionWarning = $errorType === E_WARNING && str_contains($message, 'getaddrinfo failed: Name or service not known');
-            if ($isServiceResolutionWarning) {
+            if (!$isServiceResolutionWarning) {
                 return;
             }
             if ($errorType === E_DEPRECATED) {

275) /home/barney/projects/matchbot/src/Application/Handlers/ShutdownHandler.php:65    [M] Identical

--- Original
+++ New
@@ @@
             if ($isServiceResolutionWarning) {
                 return;
             }
-            if ($errorType === E_DEPRECATED) {
+            if ($errorType !== E_DEPRECATED) {
                 // Don't let deprecations trigger `HttpInternalServerErrorException`, at least for as
                 // long as we know our rate limit middleware has one in PHP 8.1.
                 // See https://github.com/Lansoweb/LosRateLimit/issues/11

276) /home/barney/projects/matchbot/src/Application/Handlers/ShutdownHandler.php:77    [M] FalseValue

--- Original
+++ New
@@ @@
                 $this->request,
                 $exception,
                 $this->displayErrorDetails,
-                false,
+                true,
                 // Don't log via the less flexible built-in Slim fn; HttpErrorHandler does it via LoggerInterface
                 false
             );

277) /home/barney/projects/matchbot/src/Application/Handlers/ShutdownHandler.php:78    [M] FalseValue

--- Original
+++ New
@@ @@
                 $this->displayErrorDetails,
                 false,
                 // Don't log via the less flexible built-in Slim fn; HttpErrorHandler does it via LoggerInterface
-                false
+                true
             );
             $responseEmitter = new ResponseEmitter();
             $responseEmitter->emit($response);

288) /home/barney/projects/matchbot/src/Application/Matching/LessThanRequestedAllocatedException.php:24    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     #[Pure]
     public function __construct(private string $amountAllocated, private string $fundRemainingAmount)
     {
-        parent::__construct('Less than requested was allocated');
+        
     }
     public function getAmountAllocated() : string
     {

289) /home/barney/projects/matchbot/src/Application/Matching/LessThanRequestedAllocatedException.php:27    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         parent::__construct('Less than requested was allocated');
     }
-    public function getAmountAllocated() : string
+    protected function getAmountAllocated() : string
     {
         return $this->amountAllocated;
     }
 }

290) /home/barney/projects/matchbot/src/Application/Matching/OptimisticRedisAdapter.php:48    [M] PublicVisibility

--- Original
+++ New
@@ @@
     public function __construct(private Redis $redis, private EntityManagerInterface $entityManager, private LoggerInterface $logger)
     {
     }
-    #[Pure]
-    public function doRunTransactionally(callable $function)
+    protected function doRunTransactionally(callable $function)
     {
         $result = $function();
         $this->saveFundingsToDatabase();

291) /home/barney/projects/matchbot/src/Application/Matching/OptimisticRedisAdapter.php:53    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function doRunTransactionally(callable $function)
     {
         $result = $function();
-        $this->saveFundingsToDatabase();
+        
         return $result;
     }
     public function getAmountAvailable(CampaignFunding $funding) : string

295) /home/barney/projects/matchbot/src/Application/Matching/OptimisticRedisAdapter.php:82    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     protected function doSubtractAmount(CampaignFunding $funding, string $amount) : string
     {
         $decrementFractional = $this->toCurrencyFractionalUnit($amount);
-        [$initResponse, $fundBalanceFractional] = $this->redis->multi()->set($this->buildKey($funding), $this->toCurrencyFractionalUnit($funding->getAmountAvailable()), ['nx', 'ex' => static::$storageDurationSeconds])->decrBy($this->buildKey($funding), $decrementFractional)->exec();
+        [$initResponse, $fundBalanceFractional] = $this->redis->multi()->set($this->buildKey($funding), $this->toCurrencyFractionalUnit($funding->getAmountAvailable()), ['ex' => static::$storageDurationSeconds])->decrBy($this->buildKey($funding), $decrementFractional)->exec();
         $fundBalanceFractional = (int) $fundBalanceFractional;
         if ($fundBalanceFractional < 0) {
             // We have hit the edge case where not having strict, slow locks falls down. We atomically

296) /home/barney/projects/matchbot/src/Application/Matching/OptimisticRedisAdapter.php:87    [M] CastInt

--- Original
+++ New
@@ @@
     {
         $decrementFractional = $this->toCurrencyFractionalUnit($amount);
         [$initResponse, $fundBalanceFractional] = $this->redis->multi()->set($this->buildKey($funding), $this->toCurrencyFractionalUnit($funding->getAmountAvailable()), ['nx', 'ex' => static::$storageDurationSeconds])->decrBy($this->buildKey($funding), $decrementFractional)->exec();
-        $fundBalanceFractional = (int) $fundBalanceFractional;
+        $fundBalanceFractional = $fundBalanceFractional;
         if ($fundBalanceFractional < 0) {
             // We have hit the edge case where not having strict, slow locks falls down. We atomically
             // allocated some match funds based on the amount available when we queried the database, but since our

299) /home/barney/projects/matchbot/src/Application/Matching/OptimisticRedisAdapter.php:101    [M] DecrementInteger

--- Original
+++ New
@@ @@
             //
             // So, let's do exactly that and then fail in a way that tells the caller to retry, getting the new fund
             // total first. This is essentially a DIY optimistic lock exception.
-            $retries = 0;
+            $retries = -1;
             $amountAllocatedFractional = $decrementFractional;
             while ($retries++ < $this->maxPartialAllocateTries && $fundBalanceFractional < 0) {
                 // Try deallocating just the difference until the fund has exactly zero

301) /home/barney/projects/matchbot/src/Application/Matching/OptimisticRedisAdapter.php:103    [M] LessThan

--- Original
+++ New
@@ @@
             // total first. This is essentially a DIY optimistic lock exception.
             $retries = 0;
             $amountAllocatedFractional = $decrementFractional;
-            while ($retries++ < $this->maxPartialAllocateTries && $fundBalanceFractional < 0) {
+            while ($retries++ <= $this->maxPartialAllocateTries && $fundBalanceFractional < 0) {
                 // Try deallocating just the difference until the fund has exactly zero
                 $overspendFractional = 0 - $fundBalanceFractional;
                 $fundBalanceFractional = (int) $this->redis->incrBy($this->buildKey($funding), $overspendFractional);

302) /home/barney/projects/matchbot/src/Application/Matching/OptimisticRedisAdapter.php:103    [M] LessThanNegotiation

--- Original
+++ New
@@ @@
             // total first. This is essentially a DIY optimistic lock exception.
             $retries = 0;
             $amountAllocatedFractional = $decrementFractional;
-            while ($retries++ < $this->maxPartialAllocateTries && $fundBalanceFractional < 0) {
+            while ($retries++ >= $this->maxPartialAllocateTries && $fundBalanceFractional < 0) {
                 // Try deallocating just the difference until the fund has exactly zero
                 $overspendFractional = 0 - $fundBalanceFractional;
                 $fundBalanceFractional = (int) $this->redis->incrBy($this->buildKey($funding), $overspendFractional);

303) /home/barney/projects/matchbot/src/Application/Matching/OptimisticRedisAdapter.php:103    [M] LessThan

--- Original
+++ New
@@ @@
             // total first. This is essentially a DIY optimistic lock exception.
             $retries = 0;
             $amountAllocatedFractional = $decrementFractional;
-            while ($retries++ < $this->maxPartialAllocateTries && $fundBalanceFractional < 0) {
+            while ($retries++ < $this->maxPartialAllocateTries && $fundBalanceFractional <= 0) {
                 // Try deallocating just the difference until the fund has exactly zero
                 $overspendFractional = 0 - $fundBalanceFractional;
                 $fundBalanceFractional = (int) $this->redis->incrBy($this->buildKey($funding), $overspendFractional);

304) /home/barney/projects/matchbot/src/Application/Matching/OptimisticRedisAdapter.php:103    [M] LessThanNegotiation

--- Original
+++ New
@@ @@
             // total first. This is essentially a DIY optimistic lock exception.
             $retries = 0;
             $amountAllocatedFractional = $decrementFractional;
-            while ($retries++ < $this->maxPartialAllocateTries && $fundBalanceFractional < 0) {
+            while ($retries++ < $this->maxPartialAllocateTries && $fundBalanceFractional >= 0) {
                 // Try deallocating just the difference until the fund has exactly zero
                 $overspendFractional = 0 - $fundBalanceFractional;
                 $fundBalanceFractional = (int) $this->redis->incrBy($this->buildKey($funding), $overspendFractional);

306) /home/barney/projects/matchbot/src/Application/Matching/OptimisticRedisAdapter.php:103    [M] LogicalAndAllSubExprNegation

--- Original
+++ New
@@ @@
             // total first. This is essentially a DIY optimistic lock exception.
             $retries = 0;
             $amountAllocatedFractional = $decrementFractional;
-            while ($retries++ < $this->maxPartialAllocateTries && $fundBalanceFractional < 0) {
+            while (!($retries++ < $this->maxPartialAllocateTries) && !($fundBalanceFractional < 0)) {
                 // Try deallocating just the difference until the fund has exactly zero
                 $overspendFractional = 0 - $fundBalanceFractional;
                 $fundBalanceFractional = (int) $this->redis->incrBy($this->buildKey($funding), $overspendFractional);

307) /home/barney/projects/matchbot/src/Application/Matching/OptimisticRedisAdapter.php:103    [M] LogicalAndNegation

--- Original
+++ New
@@ @@
             // total first. This is essentially a DIY optimistic lock exception.
             $retries = 0;
             $amountAllocatedFractional = $decrementFractional;
-            while ($retries++ < $this->maxPartialAllocateTries && $fundBalanceFractional < 0) {
+            while (!($retries++ < $this->maxPartialAllocateTries && $fundBalanceFractional < 0)) {
                 // Try deallocating just the difference until the fund has exactly zero
                 $overspendFractional = 0 - $fundBalanceFractional;
                 $fundBalanceFractional = (int) $this->redis->incrBy($this->buildKey($funding), $overspendFractional);

308) /home/barney/projects/matchbot/src/Application/Matching/OptimisticRedisAdapter.php:103    [M] While_

--- Original
+++ New
@@ @@
             // total first. This is essentially a DIY optimistic lock exception.
             $retries = 0;
             $amountAllocatedFractional = $decrementFractional;
-            while ($retries++ < $this->maxPartialAllocateTries && $fundBalanceFractional < 0) {
+            while (false) {
                 // Try deallocating just the difference until the fund has exactly zero
                 $overspendFractional = 0 - $fundBalanceFractional;
                 $fundBalanceFractional = (int) $this->redis->incrBy($this->buildKey($funding), $overspendFractional);

309) /home/barney/projects/matchbot/src/Application/Matching/OptimisticRedisAdapter.php:105    [M] DecrementInteger

--- Original
+++ New
@@ @@
             $amountAllocatedFractional = $decrementFractional;
             while ($retries++ < $this->maxPartialAllocateTries && $fundBalanceFractional < 0) {
                 // Try deallocating just the difference until the fund has exactly zero
-                $overspendFractional = 0 - $fundBalanceFractional;
+                $overspendFractional = -1 - $fundBalanceFractional;
                 $fundBalanceFractional = (int) $this->redis->incrBy($this->buildKey($funding), $overspendFractional);
                 $amountAllocatedFractional -= $overspendFractional;
             }

315) /home/barney/projects/matchbot/src/Application/Matching/OptimisticRedisAdapter.php:110    [M] LessThan

--- Original
+++ New
@@ @@
                 $fundBalanceFractional = (int) $this->redis->incrBy($this->buildKey($funding), $overspendFractional);
                 $amountAllocatedFractional -= $overspendFractional;
             }
-            if ($fundBalanceFractional < 0) {
+            if ($fundBalanceFractional <= 0) {
                 // We couldn't get the values to work within the maximum number of iterations, so release whatever
                 // we tried to hold back to the match pot and bail out.
                 $fundBalanceFractional = (int) $this->redis->incrBy($this->buildKey($funding), $amountAllocatedFractional);
