316) /home/barney/projects/matchbot/src/Application/Matching/OptimisticRedisAdapter.php:110    [M] LessThanNegotiation

--- Original
+++ New
@@ @@
                 $fundBalanceFractional = (int) $this->redis->incrBy($this->buildKey($funding), $overspendFractional);
                 $amountAllocatedFractional -= $overspendFractional;
             }
-            if ($fundBalanceFractional < 0) {
+            if ($fundBalanceFractional >= 0) {
                 // We couldn't get the values to work within the maximum number of iterations, so release whatever
                 // we tried to hold back to the match pot and bail out.
                 $fundBalanceFractional = (int) $this->redis->incrBy($this->buildKey($funding), $amountAllocatedFractional);

317) /home/barney/projects/matchbot/src/Application/Matching/OptimisticRedisAdapter.php:113    [M] CastInt

--- Original
+++ New
@@ @@
             if ($fundBalanceFractional < 0) {
                 // We couldn't get the values to work within the maximum number of iterations, so release whatever
                 // we tried to hold back to the match pot and bail out.
-                $fundBalanceFractional = (int) $this->redis->incrBy($this->buildKey($funding), $amountAllocatedFractional);
+                $fundBalanceFractional = $this->redis->incrBy($this->buildKey($funding), $amountAllocatedFractional);
                 $this->setFundingValue($funding, $this->toCurrencyWholeUnit($fundBalanceFractional));
                 throw new TerminalLockException("Fund {$funding->getId()} balance sub-zero after {$retries} attempts. " . "Releasing final {$amountAllocatedFractional} 'cents'");
             }

318) /home/barney/projects/matchbot/src/Application/Matching/OptimisticRedisAdapter.php:117    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
                 // We couldn't get the values to work within the maximum number of iterations, so release whatever
                 // we tried to hold back to the match pot and bail out.
                 $fundBalanceFractional = (int) $this->redis->incrBy($this->buildKey($funding), $amountAllocatedFractional);
-                $this->setFundingValue($funding, $this->toCurrencyWholeUnit($fundBalanceFractional));
+                
                 throw new TerminalLockException("Fund {$funding->getId()} balance sub-zero after {$retries} attempts. " . "Releasing final {$amountAllocatedFractional} 'cents'");
             }
             $this->setFundingValue($funding, $this->toCurrencyWholeUnit($fundBalanceFractional));

319) /home/barney/projects/matchbot/src/Application/Matching/OptimisticRedisAdapter.php:118    [M] Throw_

--- Original
+++ New
@@ @@
                 // we tried to hold back to the match pot and bail out.
                 $fundBalanceFractional = (int) $this->redis->incrBy($this->buildKey($funding), $amountAllocatedFractional);
                 $this->setFundingValue($funding, $this->toCurrencyWholeUnit($fundBalanceFractional));
-                throw new TerminalLockException("Fund {$funding->getId()} balance sub-zero after {$retries} attempts. " . "Releasing final {$amountAllocatedFractional} 'cents'");
+                new TerminalLockException("Fund {$funding->getId()} balance sub-zero after {$retries} attempts. " . "Releasing final {$amountAllocatedFractional} 'cents'");
             }
             $this->setFundingValue($funding, $this->toCurrencyWholeUnit($fundBalanceFractional));
             throw new LessThanRequestedAllocatedException($this->toCurrencyWholeUnit($amountAllocatedFractional), $this->toCurrencyWholeUnit($fundBalanceFractional));

320) /home/barney/projects/matchbot/src/Application/Matching/OptimisticRedisAdapter.php:119    [M] Concat

--- Original
+++ New
@@ @@
                 // we tried to hold back to the match pot and bail out.
                 $fundBalanceFractional = (int) $this->redis->incrBy($this->buildKey($funding), $amountAllocatedFractional);
                 $this->setFundingValue($funding, $this->toCurrencyWholeUnit($fundBalanceFractional));
-                throw new TerminalLockException("Fund {$funding->getId()} balance sub-zero after {$retries} attempts. " . "Releasing final {$amountAllocatedFractional} 'cents'");
+                throw new TerminalLockException("Releasing final {$amountAllocatedFractional} 'cents'" . "Fund {$funding->getId()} balance sub-zero after {$retries} attempts. ");
             }
             $this->setFundingValue($funding, $this->toCurrencyWholeUnit($fundBalanceFractional));
             throw new LessThanRequestedAllocatedException($this->toCurrencyWholeUnit($amountAllocatedFractional), $this->toCurrencyWholeUnit($fundBalanceFractional));

321) /home/barney/projects/matchbot/src/Application/Matching/OptimisticRedisAdapter.php:119    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
                 // we tried to hold back to the match pot and bail out.
                 $fundBalanceFractional = (int) $this->redis->incrBy($this->buildKey($funding), $amountAllocatedFractional);
                 $this->setFundingValue($funding, $this->toCurrencyWholeUnit($fundBalanceFractional));
-                throw new TerminalLockException("Fund {$funding->getId()} balance sub-zero after {$retries} attempts. " . "Releasing final {$amountAllocatedFractional} 'cents'");
+                throw new TerminalLockException("Releasing final {$amountAllocatedFractional} 'cents'");
             }
             $this->setFundingValue($funding, $this->toCurrencyWholeUnit($fundBalanceFractional));
             throw new LessThanRequestedAllocatedException($this->toCurrencyWholeUnit($amountAllocatedFractional), $this->toCurrencyWholeUnit($fundBalanceFractional));

322) /home/barney/projects/matchbot/src/Application/Matching/OptimisticRedisAdapter.php:119    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
                 // we tried to hold back to the match pot and bail out.
                 $fundBalanceFractional = (int) $this->redis->incrBy($this->buildKey($funding), $amountAllocatedFractional);
                 $this->setFundingValue($funding, $this->toCurrencyWholeUnit($fundBalanceFractional));
-                throw new TerminalLockException("Fund {$funding->getId()} balance sub-zero after {$retries} attempts. " . "Releasing final {$amountAllocatedFractional} 'cents'");
+                throw new TerminalLockException("Fund {$funding->getId()} balance sub-zero after {$retries} attempts. ");
             }
             $this->setFundingValue($funding, $this->toCurrencyWholeUnit($fundBalanceFractional));
             throw new LessThanRequestedAllocatedException($this->toCurrencyWholeUnit($amountAllocatedFractional), $this->toCurrencyWholeUnit($fundBalanceFractional));

323) /home/barney/projects/matchbot/src/Application/Matching/OptimisticRedisAdapter.php:124    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
                 $this->setFundingValue($funding, $this->toCurrencyWholeUnit($fundBalanceFractional));
                 throw new TerminalLockException("Fund {$funding->getId()} balance sub-zero after {$retries} attempts. " . "Releasing final {$amountAllocatedFractional} 'cents'");
             }
-            $this->setFundingValue($funding, $this->toCurrencyWholeUnit($fundBalanceFractional));
+            
             throw new LessThanRequestedAllocatedException($this->toCurrencyWholeUnit($amountAllocatedFractional), $this->toCurrencyWholeUnit($fundBalanceFractional));
         }
         $this->amountsSubtractedInCurrentProcess[] = ['campaignFunding' => $funding, 'amount' => $amount];

324) /home/barney/projects/matchbot/src/Application/Matching/OptimisticRedisAdapter.php:125    [M] Throw_

--- Original
+++ New
@@ @@
                 throw new TerminalLockException("Fund {$funding->getId()} balance sub-zero after {$retries} attempts. " . "Releasing final {$amountAllocatedFractional} 'cents'");
             }
             $this->setFundingValue($funding, $this->toCurrencyWholeUnit($fundBalanceFractional));
-            throw new LessThanRequestedAllocatedException($this->toCurrencyWholeUnit($amountAllocatedFractional), $this->toCurrencyWholeUnit($fundBalanceFractional));
+            new LessThanRequestedAllocatedException($this->toCurrencyWholeUnit($amountAllocatedFractional), $this->toCurrencyWholeUnit($fundBalanceFractional));
         }
         $this->amountsSubtractedInCurrentProcess[] = ['campaignFunding' => $funding, 'amount' => $amount];
         $fundBalance = $this->toCurrencyWholeUnit($fundBalanceFractional);

325) /home/barney/projects/matchbot/src/Application/Matching/OptimisticRedisAdapter.php:131    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
             $this->setFundingValue($funding, $this->toCurrencyWholeUnit($fundBalanceFractional));
             throw new LessThanRequestedAllocatedException($this->toCurrencyWholeUnit($amountAllocatedFractional), $this->toCurrencyWholeUnit($fundBalanceFractional));
         }
-        $this->amountsSubtractedInCurrentProcess[] = ['campaignFunding' => $funding, 'amount' => $amount];
+        $this->amountsSubtractedInCurrentProcess[] = ['amount' => $amount];
         $fundBalance = $this->toCurrencyWholeUnit($fundBalanceFractional);
         $this->setFundingValue($funding, $fundBalance);
         return $fundBalance;

327) /home/barney/projects/matchbot/src/Application/Matching/OptimisticRedisAdapter.php:139    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $this->setFundingValue($funding, $fundBalance);
         return $fundBalance;
     }
-    #[Pure]
-    public function doAddAmount(CampaignFunding $funding, string $amount) : string
+    protected function doAddAmount(CampaignFunding $funding, string $amount) : string
     {
         $incrementFractional = $this->toCurrencyFractionalUnit($amount);
         [$initResponse, $fundBalanceFractional] = $this->redis->multi()->set($this->buildKey($funding), $this->toCurrencyFractionalUnit($funding->getAmountAvailable()), ['nx', 'ex' => static::$storageDurationSeconds])->incrBy($this->buildKey($funding), $incrementFractional)->exec();

328) /home/barney/projects/matchbot/src/Application/Matching/OptimisticRedisAdapter.php:149    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     public function doAddAmount(CampaignFunding $funding, string $amount) : string
     {
         $incrementFractional = $this->toCurrencyFractionalUnit($amount);
-        [$initResponse, $fundBalanceFractional] = $this->redis->multi()->set($this->buildKey($funding), $this->toCurrencyFractionalUnit($funding->getAmountAvailable()), ['nx', 'ex' => static::$storageDurationSeconds])->incrBy($this->buildKey($funding), $incrementFractional)->exec();
+        [$initResponse, $fundBalanceFractional] = $this->redis->multi()->set($this->buildKey($funding), $this->toCurrencyFractionalUnit($funding->getAmountAvailable()), ['ex' => static::$storageDurationSeconds])->incrBy($this->buildKey($funding), $incrementFractional)->exec();
         $fundBalance = $this->toCurrencyWholeUnit((int) $fundBalanceFractional);
         $this->setFundingValue($funding, $fundBalance);
         return $fundBalance;

329) /home/barney/projects/matchbot/src/Application/Matching/OptimisticRedisAdapter.php:154    [M] CastInt

--- Original
+++ New
@@ @@
     {
         $incrementFractional = $this->toCurrencyFractionalUnit($amount);
         [$initResponse, $fundBalanceFractional] = $this->redis->multi()->set($this->buildKey($funding), $this->toCurrencyFractionalUnit($funding->getAmountAvailable()), ['nx', 'ex' => static::$storageDurationSeconds])->incrBy($this->buildKey($funding), $incrementFractional)->exec();
-        $fundBalance = $this->toCurrencyWholeUnit((int) $fundBalanceFractional);
+        $fundBalance = $this->toCurrencyWholeUnit($fundBalanceFractional);
         $this->setFundingValue($funding, $fundBalance);
         return $fundBalance;
     }

332) /home/barney/projects/matchbot/src/Application/Matching/OptimisticRedisAdapter.php:174    [M] DecrementInteger

--- Original
+++ New
@@ @@
      */
     private function toCurrencyFractionalUnit(string $wholeUnit) : int
     {
-        return (int) bcmul($wholeUnit, '100', 0);
+        return (int) bcmul($wholeUnit, '100', -1);
     }
     /**
      * Converts e.g. pence to pounds – but is currency-agnostic except for currently assuming

334) /home/barney/projects/matchbot/src/Application/Matching/OptimisticRedisAdapter.php:174    [M] BCMath

--- Original
+++ New
@@ @@
      */
     private function toCurrencyFractionalUnit(string $wholeUnit) : int
     {
-        return (int) bcmul($wholeUnit, '100', 0);
+        return (int) (string) ($wholeUnit * '100');
     }
     /**
      * Converts e.g. pence to pounds – but is currency-agnostic except for currently assuming

336) /home/barney/projects/matchbot/src/Application/Matching/OptimisticRedisAdapter.php:186    [M] CastString

--- Original
+++ New
@@ @@
      */
     private function toCurrencyWholeUnit(int $fractionalUnit) : string
     {
-        return bcdiv((string) $fractionalUnit, '100', 2);
+        return bcdiv($fractionalUnit, '100', 2);
     }
     private function buildKey(CampaignFunding $funding) : string
     {

339) /home/barney/projects/matchbot/src/Application/Matching/OptimisticRedisAdapter.php:186    [M] BCMath

--- Original
+++ New
@@ @@
      */
     private function toCurrencyWholeUnit(int $fractionalUnit) : string
     {
-        return bcdiv((string) $fractionalUnit, '100', 2);
+        return (string) ((string) $fractionalUnit / '100');
     }
     private function buildKey(CampaignFunding $funding) : string
     {

341) /home/barney/projects/matchbot/src/Application/Matching/OptimisticRedisAdapter.php:202    [M] Foreach_

--- Original
+++ New
@@ @@
     private function saveFundingsToDatabase() : void
     {
         $this->entityManager->transactional(function () {
-            foreach ($this->fundingsToPersist as $funding) {
+            foreach (array() as $funding) {
                 $this->entityManager->persist($funding);
             }
         });

345) /home/barney/projects/matchbot/src/Application/Matching/OptimisticRedisAdapter.php:222    [M] Foreach_

--- Original
+++ New
@@ @@
      */
     public function releaseNewlyAllocatedFunds() : void
     {
-        foreach ($this->amountsSubtractedInCurrentProcess as $fundingAndAmount) {
+        foreach (array() as $fundingAndAmount) {
             $amount = $fundingAndAmount['amount'];
             $funding = $fundingAndAmount['campaignFunding'];
             $this->logger->warning("Released newly allocated funds of {$amount} for funding# {$funding->getId()}");

346) /home/barney/projects/matchbot/src/Application/Matching/OptimisticRedisAdapter.php:226    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         foreach ($this->amountsSubtractedInCurrentProcess as $fundingAndAmount) {
             $amount = $fundingAndAmount['amount'];
             $funding = $fundingAndAmount['campaignFunding'];
-            $this->logger->warning("Released newly allocated funds of {$amount} for funding# {$funding->getId()}");
+            
             $this->addAmount($funding, $amount);
         }
     }
 }

347) /home/barney/projects/matchbot/src/Application/Matching/OptimisticRedisAdapter.php:228    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             $amount = $fundingAndAmount['amount'];
             $funding = $fundingAndAmount['campaignFunding'];
             $this->logger->warning("Released newly allocated funds of {$amount} for funding# {$funding->getId()}");
-            $this->addAmount($funding, $amount);
+            
         }
     }
 }

348) /home/barney/projects/matchbot/src/Application/Messenger/Handler/StripePayoutHandler.php:70    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         try {
             $balanceTransactions = $this->stripeClient->balanceTransactions->all($attributes, ['stripe_account' => $connectAccountId]);
         } catch (ApiErrorException $exception) {
-            $this->logger->error(sprintf('Stripe Balance Transaction lookup error for Payout ID %s, %s [%s]: %s', $payoutId, get_class($exception), $exception->getStripeCode(), $exception->getMessage()));
+            
             return;
         }
         // Auto page, iterating in reverse chronological order. https://stripe.com/docs/api/pagination/auto?lang=php

349) /home/barney/projects/matchbot/src/Application/Messenger/Handler/StripePayoutHandler.php:95    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         }
         $this->logger->info(sprintf('Payout: Getting all Connect account paid Charge IDs for Payout ID %s complete, found %s', $payoutId, count($paidChargeIds)));
         if (count($paidChargeIds) === 0) {
-            $this->logger->info(sprintf('Payout: Exited with no paid Charge IDs for Payout ID %s', $payoutId));
+            
             return;
         }
         $chargeIds = $this->getOriginalDonationChargeIds($paidChargeIds, $connectAccountId, $payoutCreated);

350) /home/barney/projects/matchbot/src/Application/Messenger/Handler/StripePayoutHandler.php:106    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         }
         $chargeIds = $this->getOriginalDonationChargeIds($paidChargeIds, $connectAccountId, $payoutCreated);
         if ($chargeIds === []) {
-            $this->logger->info(sprintf('Payout: Exited with no original donation charge IDs for Payout ID %s', $payoutId));
+            
             return;
         }
         foreach ($chargeIds as $chargeId) {

353) /home/barney/projects/matchbot/src/Application/Persistence/RetrySafeEntityManager.php:63    [M] DoWhile

--- Original
+++ New
@@ @@
                 $this->logger->error('RetrySafeEntityManager bailing out having hit ' . get_class($ex) . ': ' . $ex->getMessage());
                 throw $ex;
             }
-        } while ($retries < $this->maxLockRetries);
+        } while (false);
         $this->logger->error('RetrySafeEntityManager bailing out after ' . $this->maxLockRetries . ' tries');
         throw $ex;
     }

357) /home/barney/projects/matchbot/src/Application/Persistence/RetrySafeEntityManager.php:69    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             $this->beginTransaction();
             try {
                 $ret = $func();
-                $this->flush();
+                
                 $this->commit();
                 return $ret;
             } catch (RetryableException $ex) {

361) /home/barney/projects/matchbot/src/Application/Persistence/RetrySafeEntityManager.php:77    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             } catch (RetryableException $ex) {
                 $this->rollback();
                 $this->close();
-                $this->logger->error('EM closed. RetrySafeEntityManager::transactional rolling back from ' . get_class($ex) . $ex->__tostring());
+                
                 usleep(random_int(0, 200000));
                 // Wait between 0 and 0.2 seconds before retrying
                 $this->resetManager();

362) /home/barney/projects/matchbot/src/Application/Persistence/RetrySafeEntityManager.php:78    [M] Concat

--- Original
+++ New
@@ @@
             } catch (RetryableException $ex) {
                 $this->rollback();
                 $this->close();
-                $this->logger->error('EM closed. RetrySafeEntityManager::transactional rolling back from ' . get_class($ex) . $ex->__tostring());
+                $this->logger->error(get_class($ex) . 'EM closed. RetrySafeEntityManager::transactional rolling back from ' . $ex->__tostring());
                 usleep(random_int(0, 200000));
                 // Wait between 0 and 0.2 seconds before retrying
                 $this->resetManager();

363) /home/barney/projects/matchbot/src/Application/Persistence/RetrySafeEntityManager.php:78    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             } catch (RetryableException $ex) {
                 $this->rollback();
                 $this->close();
-                $this->logger->error('EM closed. RetrySafeEntityManager::transactional rolling back from ' . get_class($ex) . $ex->__tostring());
+                $this->logger->error(get_class($ex) . $ex->__tostring());
                 usleep(random_int(0, 200000));
                 // Wait between 0 and 0.2 seconds before retrying
                 $this->resetManager();

364) /home/barney/projects/matchbot/src/Application/Persistence/RetrySafeEntityManager.php:78    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             } catch (RetryableException $ex) {
                 $this->rollback();
                 $this->close();
-                $this->logger->error('EM closed. RetrySafeEntityManager::transactional rolling back from ' . get_class($ex) . $ex->__tostring());
+                $this->logger->error('EM closed. RetrySafeEntityManager::transactional rolling back from ' . $ex->__tostring());
                 usleep(random_int(0, 200000));
                 // Wait between 0 and 0.2 seconds before retrying
                 $this->resetManager();

365) /home/barney/projects/matchbot/src/Application/Persistence/RetrySafeEntityManager.php:78    [M] Concat

--- Original
+++ New
@@ @@
             } catch (RetryableException $ex) {
                 $this->rollback();
                 $this->close();
-                $this->logger->error('EM closed. RetrySafeEntityManager::transactional rolling back from ' . get_class($ex) . $ex->__tostring());
+                $this->logger->error('EM closed. RetrySafeEntityManager::transactional rolling back from ' . $ex->__tostring() . get_class($ex));
                 usleep(random_int(0, 200000));
                 // Wait between 0 and 0.2 seconds before retrying
                 $this->resetManager();

366) /home/barney/projects/matchbot/src/Application/Persistence/RetrySafeEntityManager.php:78    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             } catch (RetryableException $ex) {
                 $this->rollback();
                 $this->close();
-                $this->logger->error('EM closed. RetrySafeEntityManager::transactional rolling back from ' . get_class($ex) . $ex->__tostring());
+                $this->logger->error('EM closed. RetrySafeEntityManager::transactional rolling back from ' . get_class($ex));
                 usleep(random_int(0, 200000));
                 // Wait between 0 and 0.2 seconds before retrying
                 $this->resetManager();

367) /home/barney/projects/matchbot/src/Application/Persistence/RetrySafeEntityManager.php:81    [M] DecrementInteger

--- Original
+++ New
@@ @@
                 $this->rollback();
                 $this->close();
                 $this->logger->error('EM closed. RetrySafeEntityManager::transactional rolling back from ' . get_class($ex) . $ex->__tostring());
-                usleep(random_int(0, 200000));
+                usleep(random_int(-1, 200000));
                 // Wait between 0 and 0.2 seconds before retrying
                 $this->resetManager();
                 ++$retries;

368) /home/barney/projects/matchbot/src/Application/Persistence/RetrySafeEntityManager.php:81    [M] IncrementInteger

--- Original
+++ New
@@ @@
                 $this->rollback();
                 $this->close();
                 $this->logger->error('EM closed. RetrySafeEntityManager::transactional rolling back from ' . get_class($ex) . $ex->__tostring());
-                usleep(random_int(0, 200000));
+                usleep(random_int(1, 200000));
                 // Wait between 0 and 0.2 seconds before retrying
                 $this->resetManager();
                 ++$retries;

369) /home/barney/projects/matchbot/src/Application/Persistence/RetrySafeEntityManager.php:81    [M] DecrementInteger

--- Original
+++ New
@@ @@
                 $this->rollback();
                 $this->close();
                 $this->logger->error('EM closed. RetrySafeEntityManager::transactional rolling back from ' . get_class($ex) . $ex->__tostring());
-                usleep(random_int(0, 200000));
+                usleep(random_int(0, 199999));
                 // Wait between 0 and 0.2 seconds before retrying
                 $this->resetManager();
                 ++$retries;

370) /home/barney/projects/matchbot/src/Application/Persistence/RetrySafeEntityManager.php:81    [M] IncrementInteger

--- Original
+++ New
@@ @@
                 $this->rollback();
                 $this->close();
                 $this->logger->error('EM closed. RetrySafeEntityManager::transactional rolling back from ' . get_class($ex) . $ex->__tostring());
-                usleep(random_int(0, 200000));
+                usleep(random_int(0, 200001));
                 // Wait between 0 and 0.2 seconds before retrying
                 $this->resetManager();
                 ++$retries;

371) /home/barney/projects/matchbot/src/Application/Persistence/RetrySafeEntityManager.php:81    [M] FunctionCallRemoval

--- Original
+++ New
@@ @@
                 $this->rollback();
                 $this->close();
                 $this->logger->error('EM closed. RetrySafeEntityManager::transactional rolling back from ' . get_class($ex) . $ex->__tostring());
-                usleep(random_int(0, 200000));
+                
                 // Wait between 0 and 0.2 seconds before retrying
                 $this->resetManager();
                 ++$retries;

372) /home/barney/projects/matchbot/src/Application/Persistence/RetrySafeEntityManager.php:83    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
                 $this->close();
                 $this->logger->error('EM closed. RetrySafeEntityManager::transactional rolling back from ' . get_class($ex) . $ex->__tostring());
                 usleep(random_int(0, 200000));
-                // Wait between 0 and 0.2 seconds before retrying
-                $this->resetManager();
+                
                 ++$retries;
             } catch (\Exception $ex) {
                 $this->rollback();

375) /home/barney/projects/matchbot/src/Application/Persistence/RetrySafeEntityManager.php:87    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
                 ++$retries;
             } catch (\Exception $ex) {
                 $this->rollback();
-                $this->logger->error('RetrySafeEntityManager bailing out having hit ' . get_class($ex) . ': ' . $ex->getMessage());
+                
                 throw $ex;
             }
         } while ($retries < $this->maxLockRetries);

376) /home/barney/projects/matchbot/src/Application/Persistence/RetrySafeEntityManager.php:88    [M] Concat

--- Original
+++ New
@@ @@
                 ++$retries;
             } catch (\Exception $ex) {
                 $this->rollback();
-                $this->logger->error('RetrySafeEntityManager bailing out having hit ' . get_class($ex) . ': ' . $ex->getMessage());
+                $this->logger->error(get_class($ex) . 'RetrySafeEntityManager bailing out having hit ' . ': ' . $ex->getMessage());
                 throw $ex;
             }
         } while ($retries < $this->maxLockRetries);

377) /home/barney/projects/matchbot/src/Application/Persistence/RetrySafeEntityManager.php:88    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
                 ++$retries;
             } catch (\Exception $ex) {
                 $this->rollback();
-                $this->logger->error('RetrySafeEntityManager bailing out having hit ' . get_class($ex) . ': ' . $ex->getMessage());
+                $this->logger->error(get_class($ex) . ': ' . $ex->getMessage());
                 throw $ex;
             }
         } while ($retries < $this->maxLockRetries);

378) /home/barney/projects/matchbot/src/Application/Persistence/RetrySafeEntityManager.php:88    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
                 ++$retries;
             } catch (\Exception $ex) {
                 $this->rollback();
-                $this->logger->error('RetrySafeEntityManager bailing out having hit ' . get_class($ex) . ': ' . $ex->getMessage());
+                $this->logger->error('RetrySafeEntityManager bailing out having hit ' . ': ' . $ex->getMessage());
                 throw $ex;
             }
         } while ($retries < $this->maxLockRetries);

379) /home/barney/projects/matchbot/src/Application/Persistence/RetrySafeEntityManager.php:88    [M] Concat

--- Original
+++ New
@@ @@
                 ++$retries;
             } catch (\Exception $ex) {
                 $this->rollback();
-                $this->logger->error('RetrySafeEntityManager bailing out having hit ' . get_class($ex) . ': ' . $ex->getMessage());
+                $this->logger->error('RetrySafeEntityManager bailing out having hit ' . ': ' . get_class($ex) . $ex->getMessage());
                 throw $ex;
             }
         } while ($retries < $this->maxLockRetries);

380) /home/barney/projects/matchbot/src/Application/Persistence/RetrySafeEntityManager.php:88    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
                 ++$retries;
             } catch (\Exception $ex) {
                 $this->rollback();
-                $this->logger->error('RetrySafeEntityManager bailing out having hit ' . get_class($ex) . ': ' . $ex->getMessage());
+                $this->logger->error('RetrySafeEntityManager bailing out having hit ' . get_class($ex) . $ex->getMessage());
                 throw $ex;
             }
         } while ($retries < $this->maxLockRetries);
