381) /home/barney/projects/matchbot/src/Application/Persistence/RetrySafeEntityManager.php:88    [M] Concat

--- Original
+++ New
@@ @@
                 ++$retries;
             } catch (\Exception $ex) {
                 $this->rollback();
-                $this->logger->error('RetrySafeEntityManager bailing out having hit ' . get_class($ex) . ': ' . $ex->getMessage());
+                $this->logger->error('RetrySafeEntityManager bailing out having hit ' . get_class($ex) . $ex->getMessage() . ': ');
                 throw $ex;
             }
         } while ($retries < $this->maxLockRetries);

382) /home/barney/projects/matchbot/src/Application/Persistence/RetrySafeEntityManager.php:88    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
                 ++$retries;
             } catch (\Exception $ex) {
                 $this->rollback();
-                $this->logger->error('RetrySafeEntityManager bailing out having hit ' . get_class($ex) . ': ' . $ex->getMessage());
+                $this->logger->error('RetrySafeEntityManager bailing out having hit ' . get_class($ex) . ': ');
                 throw $ex;
             }
         } while ($retries < $this->maxLockRetries);

383) /home/barney/projects/matchbot/src/Application/Persistence/RetrySafeEntityManager.php:91    [M] Throw_

--- Original
+++ New
@@ @@
             } catch (\Exception $ex) {
                 $this->rollback();
                 $this->logger->error('RetrySafeEntityManager bailing out having hit ' . get_class($ex) . ': ' . $ex->getMessage());
-                throw $ex;
+                $ex;
             }
         } while ($retries < $this->maxLockRetries);
         $this->logger->error('RetrySafeEntityManager bailing out after ' . $this->maxLockRetries . ' tries');

386) /home/barney/projects/matchbot/src/Application/Persistence/RetrySafeEntityManager.php:95    [M] Concat

--- Original
+++ New
@@ @@
                 throw $ex;
             }
         } while ($retries < $this->maxLockRetries);
-        $this->logger->error('RetrySafeEntityManager bailing out after ' . $this->maxLockRetries . ' tries');
+        $this->logger->error($this->maxLockRetries . 'RetrySafeEntityManager bailing out after ' . ' tries');
         throw $ex;
     }
     /**

387) /home/barney/projects/matchbot/src/Application/Persistence/RetrySafeEntityManager.php:95    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
                 throw $ex;
             }
         } while ($retries < $this->maxLockRetries);
-        $this->logger->error('RetrySafeEntityManager bailing out after ' . $this->maxLockRetries . ' tries');
+        $this->logger->error($this->maxLockRetries . ' tries');
         throw $ex;
     }
     /**

388) /home/barney/projects/matchbot/src/Application/Persistence/RetrySafeEntityManager.php:95    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
                 throw $ex;
             }
         } while ($retries < $this->maxLockRetries);
-        $this->logger->error('RetrySafeEntityManager bailing out after ' . $this->maxLockRetries . ' tries');
+        $this->logger->error('RetrySafeEntityManager bailing out after ' . ' tries');
         throw $ex;
     }
     /**

389) /home/barney/projects/matchbot/src/Application/Persistence/RetrySafeEntityManager.php:95    [M] Concat

--- Original
+++ New
@@ @@
                 throw $ex;
             }
         } while ($retries < $this->maxLockRetries);
-        $this->logger->error('RetrySafeEntityManager bailing out after ' . $this->maxLockRetries . ' tries');
+        $this->logger->error('RetrySafeEntityManager bailing out after ' . ' tries' . $this->maxLockRetries);
         throw $ex;
     }
     /**

390) /home/barney/projects/matchbot/src/Application/Persistence/RetrySafeEntityManager.php:95    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
                 throw $ex;
             }
         } while ($retries < $this->maxLockRetries);
-        $this->logger->error('RetrySafeEntityManager bailing out after ' . $this->maxLockRetries . ' tries');
+        $this->logger->error('RetrySafeEntityManager bailing out after ' . $this->maxLockRetries);
         throw $ex;
     }
     /**

391) /home/barney/projects/matchbot/src/Application/Persistence/RetrySafeEntityManager.php:95    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
                 throw $ex;
             }
         } while ($retries < $this->maxLockRetries);
-        $this->logger->error('RetrySafeEntityManager bailing out after ' . $this->maxLockRetries . ' tries');
+        
         throw $ex;
     }
     /**

392) /home/barney/projects/matchbot/src/Application/Persistence/RetrySafeEntityManager.php:97    [M] Throw_

--- Original
+++ New
@@ @@
             }
         } while ($retries < $this->maxLockRetries);
         $this->logger->error('RetrySafeEntityManager bailing out after ' . $this->maxLockRetries . ' tries');
-        throw $ex;
+        $ex;
     }
     /**
      * Attempt a persist the normal way, and if the underlying EM is closed, make a new one

394) /home/barney/projects/matchbot/src/Client/Campaign.php:21    [M] DecrementInteger

--- Original
+++ New
@@ @@
         try {
             $response = $this->getHttpClient()->get("{$this->getSetting('campaign', 'baseUri')}/{$id}");
         } catch (RequestException $exception) {
-            if ($exception->getResponse() && $exception->getResponse()->getStatusCode() === 404) {
+            if ($exception->getResponse() && $exception->getResponse()->getStatusCode() === 403) {
                 throw new NotFoundException(sprintf('Campaign ID %s not found in SF', $id));
                 // may be safely caught in sandboxes
             }

395) /home/barney/projects/matchbot/src/Client/Campaign.php:21    [M] IncrementInteger

--- Original
+++ New
@@ @@
         try {
             $response = $this->getHttpClient()->get("{$this->getSetting('campaign', 'baseUri')}/{$id}");
         } catch (RequestException $exception) {
-            if ($exception->getResponse() && $exception->getResponse()->getStatusCode() === 404) {
+            if ($exception->getResponse() && $exception->getResponse()->getStatusCode() === 405) {
                 throw new NotFoundException(sprintf('Campaign ID %s not found in SF', $id));
                 // may be safely caught in sandboxes
             }

397) /home/barney/projects/matchbot/src/Client/Campaign.php:21    [M] LogicalAnd

--- Original
+++ New
@@ @@
         try {
             $response = $this->getHttpClient()->get("{$this->getSetting('campaign', 'baseUri')}/{$id}");
         } catch (RequestException $exception) {
-            if ($exception->getResponse() && $exception->getResponse()->getStatusCode() === 404) {
+            if ($exception->getResponse() || $exception->getResponse()->getStatusCode() === 404) {
                 throw new NotFoundException(sprintf('Campaign ID %s not found in SF', $id));
                 // may be safely caught in sandboxes
             }

399) /home/barney/projects/matchbot/src/Client/Campaign.php:21    [M] LogicalAndNegation

--- Original
+++ New
@@ @@
         try {
             $response = $this->getHttpClient()->get("{$this->getSetting('campaign', 'baseUri')}/{$id}");
         } catch (RequestException $exception) {
-            if ($exception->getResponse() && $exception->getResponse()->getStatusCode() === 404) {
+            if (!($exception->getResponse() && $exception->getResponse()->getStatusCode() === 404)) {
                 throw new NotFoundException(sprintf('Campaign ID %s not found in SF', $id));
                 // may be safely caught in sandboxes
             }

400) /home/barney/projects/matchbot/src/Client/Campaign.php:21    [M] LogicalAndSingleSubExprNegation

--- Original
+++ New
@@ @@
         try {
             $response = $this->getHttpClient()->get("{$this->getSetting('campaign', 'baseUri')}/{$id}");
         } catch (RequestException $exception) {
-            if ($exception->getResponse() && $exception->getResponse()->getStatusCode() === 404) {
+            if (!$exception->getResponse() && $exception->getResponse()->getStatusCode() === 404) {
                 throw new NotFoundException(sprintf('Campaign ID %s not found in SF', $id));
                 // may be safely caught in sandboxes
             }

401) /home/barney/projects/matchbot/src/Client/Campaign.php:22    [M] Throw_

--- Original
+++ New
@@ @@
             $response = $this->getHttpClient()->get("{$this->getSetting('campaign', 'baseUri')}/{$id}");
         } catch (RequestException $exception) {
             if ($exception->getResponse() && $exception->getResponse()->getStatusCode() === 404) {
-                throw new NotFoundException(sprintf('Campaign ID %s not found in SF', $id));
+                new NotFoundException(sprintf('Campaign ID %s not found in SF', $id));
                 // may be safely caught in sandboxes
             }
             // Otherwise, an unknown error occurred -> re-throw

402) /home/barney/projects/matchbot/src/Client/Campaign.php:26    [M] Throw_

--- Original
+++ New
@@ @@
                 throw new NotFoundException(sprintf('Campaign ID %s not found in SF', $id));
                 // may be safely caught in sandboxes
             }
-            // Otherwise, an unknown error occurred -> re-throw
-            throw $exception;
+            $exception;
         }
         $campaignResponse = json_decode((string) $response->getBody(), true);
         if (!$campaignResponse['ready']) {

403) /home/barney/projects/matchbot/src/Client/Campaign.php:29    [M] CastString

--- Original
+++ New
@@ @@
             // Otherwise, an unknown error occurred -> re-throw
             throw $exception;
         }
-        $campaignResponse = json_decode((string) $response->getBody(), true);
+        $campaignResponse = json_decode($response->getBody(), true);
         if (!$campaignResponse['ready']) {
             throw new NotFoundException(sprintf('Campaign ID %s not ready', $id));
         }

404) /home/barney/projects/matchbot/src/Client/Campaign.php:31    [M] LogicalNot

--- Original
+++ New
@@ @@
             throw $exception;
         }
         $campaignResponse = json_decode((string) $response->getBody(), true);
-        if (!$campaignResponse['ready']) {
+        if ($campaignResponse['ready']) {
             throw new NotFoundException(sprintf('Campaign ID %s not ready', $id));
         }
         return $campaignResponse;
     }
 }

406) /home/barney/projects/matchbot/src/Client/Campaign.php:35    [M] ArrayOneItem

--- Original
+++ New
@@ @@
         if (!$campaignResponse['ready']) {
             throw new NotFoundException(sprintf('Campaign ID %s not ready', $id));
         }
-        return $campaignResponse;
+        return count($campaignResponse) > 1 ? array_slice($campaignResponse, 0, 1, true) : $campaignResponse;
     }
 }

407) /home/barney/projects/matchbot/src/Client/Common.php:22    [M] ProtectedVisibility

--- Original
+++ New
@@ @@
     {
         $this->clientSettings = $settings['apiClient'];
     }
-    protected function getSetting(string $service, string $property) : string
+    private function getSetting(string $service, string $property) : string
     {
         return $this->clientSettings[$service][$property];
     }

408) /home/barney/projects/matchbot/src/Client/Common.php:27    [M] ProtectedVisibility

--- Original
+++ New
@@ @@
     {
         return $this->clientSettings[$service][$property];
     }
-    protected function getHttpClient() : Client
+    private function getHttpClient() : Client
     {
         if (!isset($this->httpClient)) {
             $this->httpClient = new Client(['timeout' => $this->clientSettings['global']['timeout']]);

410) /home/barney/projects/matchbot/src/Client/Common.php:30    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     protected function getHttpClient() : Client
     {
         if (!isset($this->httpClient)) {
-            $this->httpClient = new Client(['timeout' => $this->clientSettings['global']['timeout']]);
+            $this->httpClient = new Client([]);
         }
         return $this->httpClient;
     }
 }

412) /home/barney/projects/matchbot/src/Client/Donation.php:20    [M] IfNegation

--- Original
+++ New
@@ @@
      */
     public function create(DonationModel $donation) : string
     {
-        if (getenv('DISABLE_CLIENT_PUSH')) {
+        if (!getenv('DISABLE_CLIENT_PUSH')) {
             $this->logger->info("Client push off: Skipping create of donation {$donation->getUuid()}");
             throw new BadRequestException('Client push is off');
         }

415) /home/barney/projects/matchbot/src/Client/Donation.php:28    [M] ArrayItem

--- Original
+++ New
@@ @@
             throw new BadRequestException('Client push is off');
         }
         try {
-            $response = $this->getHttpClient()->post($this->getSetting('donation', 'baseUri'), ['json' => $donation->toApiModel()]);
+            $response = $this->getHttpClient()->post($this->getSetting('donation', 'baseUri'), ['json' > $donation->toApiModel()]);
         } catch (RequestException $ex) {
             // Sandboxes that 404 on POST may be trying to sync up donations for non-existent campaigns and
             // so have probably just been refreshed. In this case we want to update the local state of play

416) /home/barney/projects/matchbot/src/Client/Donation.php:28    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
             throw new BadRequestException('Client push is off');
         }
         try {
-            $response = $this->getHttpClient()->post($this->getSetting('donation', 'baseUri'), ['json' => $donation->toApiModel()]);
+            $response = $this->getHttpClient()->post($this->getSetting('donation', 'baseUri'), []);
         } catch (RequestException $ex) {
             // Sandboxes that 404 on POST may be trying to sync up donations for non-existent campaigns and
             // so have probably just been refreshed. In this case we want to update the local state of play

417) /home/barney/projects/matchbot/src/Client/Donation.php:37    [M] DecrementInteger

--- Original
+++ New
@@ @@
             // handling in the caller without an error level log. In production, 404s should not happen and
             // so we continue to throw a `BadRequestException` which means `DonationRepostitory::doCreate()`
             // will return false and the caller will log an error.
-            if ($ex->getCode() === 404 && getenv('APP_ENV') !== 'production') {
+            if ($ex->getCode() === 403 && getenv('APP_ENV') !== 'production') {
                 throw new NotFoundException();
             }
             $this->logger->error(sprintf('Donation create exception %s: %s. Body: %s', get_class($ex), $ex->getMessage(), $ex->getResponse() ? $ex->getResponse()->getBody() : 'N/A'));

418) /home/barney/projects/matchbot/src/Client/Donation.php:37    [M] IncrementInteger

--- Original
+++ New
@@ @@
             // handling in the caller without an error level log. In production, 404s should not happen and
             // so we continue to throw a `BadRequestException` which means `DonationRepostitory::doCreate()`
             // will return false and the caller will log an error.
-            if ($ex->getCode() === 404 && getenv('APP_ENV') !== 'production') {
+            if ($ex->getCode() === 405 && getenv('APP_ENV') !== 'production') {
                 throw new NotFoundException();
             }
             $this->logger->error(sprintf('Donation create exception %s: %s. Body: %s', get_class($ex), $ex->getMessage(), $ex->getResponse() ? $ex->getResponse()->getBody() : 'N/A'));

420) /home/barney/projects/matchbot/src/Client/Donation.php:37    [M] NotIdentical

--- Original
+++ New
@@ @@
             // handling in the caller without an error level log. In production, 404s should not happen and
             // so we continue to throw a `BadRequestException` which means `DonationRepostitory::doCreate()`
             // will return false and the caller will log an error.
-            if ($ex->getCode() === 404 && getenv('APP_ENV') !== 'production') {
+            if ($ex->getCode() === 404 && getenv('APP_ENV') === 'production') {
                 throw new NotFoundException();
             }
             $this->logger->error(sprintf('Donation create exception %s: %s. Body: %s', get_class($ex), $ex->getMessage(), $ex->getResponse() ? $ex->getResponse()->getBody() : 'N/A'));

421) /home/barney/projects/matchbot/src/Client/Donation.php:37    [M] LogicalAnd

--- Original
+++ New
@@ @@
             // handling in the caller without an error level log. In production, 404s should not happen and
             // so we continue to throw a `BadRequestException` which means `DonationRepostitory::doCreate()`
             // will return false and the caller will log an error.
-            if ($ex->getCode() === 404 && getenv('APP_ENV') !== 'production') {
+            if ($ex->getCode() === 404 || getenv('APP_ENV') !== 'production') {
                 throw new NotFoundException();
             }
             $this->logger->error(sprintf('Donation create exception %s: %s. Body: %s', get_class($ex), $ex->getMessage(), $ex->getResponse() ? $ex->getResponse()->getBody() : 'N/A'));

423) /home/barney/projects/matchbot/src/Client/Donation.php:37    [M] LogicalAndNegation

--- Original
+++ New
@@ @@
             // handling in the caller without an error level log. In production, 404s should not happen and
             // so we continue to throw a `BadRequestException` which means `DonationRepostitory::doCreate()`
             // will return false and the caller will log an error.
-            if ($ex->getCode() === 404 && getenv('APP_ENV') !== 'production') {
+            if (!($ex->getCode() === 404 && getenv('APP_ENV') !== 'production')) {
                 throw new NotFoundException();
             }
             $this->logger->error(sprintf('Donation create exception %s: %s. Body: %s', get_class($ex), $ex->getMessage(), $ex->getResponse() ? $ex->getResponse()->getBody() : 'N/A'));

425) /home/barney/projects/matchbot/src/Client/Donation.php:41    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             if ($ex->getCode() === 404 && getenv('APP_ENV') !== 'production') {
                 throw new NotFoundException();
             }
-            $this->logger->error(sprintf('Donation create exception %s: %s. Body: %s', get_class($ex), $ex->getMessage(), $ex->getResponse() ? $ex->getResponse()->getBody() : 'N/A'));
+            
             throw new BadRequestException('Donation not created');
         }
         // For now, support created response codes of 200 (behaviour as of 3/5/22) or 201 (as documented).

426) /home/barney/projects/matchbot/src/Client/Donation.php:45    [M] Ternary

--- Original
+++ New
@@ @@
             if ($ex->getCode() === 404 && getenv('APP_ENV') !== 'production') {
                 throw new NotFoundException();
             }
-            $this->logger->error(sprintf('Donation create exception %s: %s. Body: %s', get_class($ex), $ex->getMessage(), $ex->getResponse() ? $ex->getResponse()->getBody() : 'N/A'));
+            $this->logger->error(sprintf('Donation create exception %s: %s. Body: %s', get_class($ex), $ex->getMessage(), $ex->getResponse() ? 'N/A' : $ex->getResponse()->getBody()));
             throw new BadRequestException('Donation not created');
         }
         // For now, support created response codes of 200 (behaviour as of 3/5/22) or 201 (as documented).

427) /home/barney/projects/matchbot/src/Client/Donation.php:48    [M] Throw_

--- Original
+++ New
@@ @@
                 throw new NotFoundException();
             }
             $this->logger->error(sprintf('Donation create exception %s: %s. Body: %s', get_class($ex), $ex->getMessage(), $ex->getResponse() ? $ex->getResponse()->getBody() : 'N/A'));
-            throw new BadRequestException('Donation not created');
+            new BadRequestException('Donation not created');
         }
         // For now, support created response codes of 200 (behaviour as of 3/5/22) or 201 (as documented).
         if ($response->getStatusCode() > 201 || $response->getStatusCode() < 200) {

428) /home/barney/projects/matchbot/src/Client/Donation.php:52    [M] GreaterThan

--- Original
+++ New
@@ @@
             throw new BadRequestException('Donation not created');
         }
         // For now, support created response codes of 200 (behaviour as of 3/5/22) or 201 (as documented).
-        if ($response->getStatusCode() > 201 || $response->getStatusCode() < 200) {
+        if ($response->getStatusCode() >= 201 || $response->getStatusCode() < 200) {
             $this->logger->error('Donation create got non-success code ' . $response->getStatusCode());
             throw new BadRequestException('Donation not created');
         }

429) /home/barney/projects/matchbot/src/Client/Donation.php:52    [M] GreaterThanNegotiation

--- Original
+++ New
@@ @@
             throw new BadRequestException('Donation not created');
         }
         // For now, support created response codes of 200 (behaviour as of 3/5/22) or 201 (as documented).
-        if ($response->getStatusCode() > 201 || $response->getStatusCode() < 200) {
+        if ($response->getStatusCode() <= 201 || $response->getStatusCode() < 200) {
             $this->logger->error('Donation create got non-success code ' . $response->getStatusCode());
             throw new BadRequestException('Donation not created');
         }

430) /home/barney/projects/matchbot/src/Client/Donation.php:52    [M] LessThan

--- Original
+++ New
@@ @@
             throw new BadRequestException('Donation not created');
         }
         // For now, support created response codes of 200 (behaviour as of 3/5/22) or 201 (as documented).
-        if ($response->getStatusCode() > 201 || $response->getStatusCode() < 200) {
+        if ($response->getStatusCode() > 201 || $response->getStatusCode() <= 200) {
             $this->logger->error('Donation create got non-success code ' . $response->getStatusCode());
             throw new BadRequestException('Donation not created');
         }

432) /home/barney/projects/matchbot/src/Client/Donation.php:52    [M] LogicalOr

--- Original
+++ New
@@ @@
             throw new BadRequestException('Donation not created');
         }
         // For now, support created response codes of 200 (behaviour as of 3/5/22) or 201 (as documented).
-        if ($response->getStatusCode() > 201 || $response->getStatusCode() < 200) {
+        if ($response->getStatusCode() > 201 && $response->getStatusCode() < 200) {
             $this->logger->error('Donation create got non-success code ' . $response->getStatusCode());
             throw new BadRequestException('Donation not created');
         }

434) /home/barney/projects/matchbot/src/Client/Donation.php:52    [M] LogicalOrNegation

--- Original
+++ New
@@ @@
             throw new BadRequestException('Donation not created');
         }
         // For now, support created response codes of 200 (behaviour as of 3/5/22) or 201 (as documented).
-        if ($response->getStatusCode() > 201 || $response->getStatusCode() < 200) {
+        if (!($response->getStatusCode() > 201 || $response->getStatusCode() < 200)) {
             $this->logger->error('Donation create got non-success code ' . $response->getStatusCode());
             throw new BadRequestException('Donation not created');
         }

435) /home/barney/projects/matchbot/src/Client/Donation.php:53    [M] Concat

--- Original
+++ New
@@ @@
         }
         // For now, support created response codes of 200 (behaviour as of 3/5/22) or 201 (as documented).
         if ($response->getStatusCode() > 201 || $response->getStatusCode() < 200) {
-            $this->logger->error('Donation create got non-success code ' . $response->getStatusCode());
+            $this->logger->error($response->getStatusCode() . 'Donation create got non-success code ');
             throw new BadRequestException('Donation not created');
         }
         $donationCreatedResponse = json_decode((string) $response->getBody(), true);

437) /home/barney/projects/matchbot/src/Client/Donation.php:53    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         }
         // For now, support created response codes of 200 (behaviour as of 3/5/22) or 201 (as documented).
         if ($response->getStatusCode() > 201 || $response->getStatusCode() < 200) {
-            $this->logger->error('Donation create got non-success code ' . $response->getStatusCode());
+            $this->logger->error('Donation create got non-success code ');
             throw new BadRequestException('Donation not created');
         }
         $donationCreatedResponse = json_decode((string) $response->getBody(), true);

440) /home/barney/projects/matchbot/src/Client/Donation.php:57    [M] CastString

--- Original
+++ New
@@ @@
             $this->logger->error('Donation create got non-success code ' . $response->getStatusCode());
             throw new BadRequestException('Donation not created');
         }
-        $donationCreatedResponse = json_decode((string) $response->getBody(), true);
+        $donationCreatedResponse = json_decode($response->getBody(), true);
         return $donationCreatedResponse['donation']['donationId'];
     }
     /**

444) /home/barney/projects/matchbot/src/Client/Donation.php:77    [M] FalseValue

--- Original
+++ New
@@ @@
     {
         if (getenv('DISABLE_CLIENT_PUSH')) {
             $this->logger->info("Client push off: Skipping update of donation {$donation->getUuid()}");
-            return false;
+            return true;
         }
         try {
             $requestBody = $donation->toHookModel();

445) /home/barney/projects/matchbot/src/Client/Donation.php:84    [M] Concat

--- Original
+++ New
@@ @@
         }
         try {
             $requestBody = $donation->toHookModel();
-            $response = $this->getHttpClient()->put($this->getSetting('webhook', 'baseUri') . "/donation/{$donation->getSalesforceId()}", ['json' => $requestBody, 'headers' => ['X-Webhook-Verify-Hash' => $this->hash(json_encode($requestBody))]]);
+            $response = $this->getHttpClient()->put("/donation/{$donation->getSalesforceId()}" . $this->getSetting('webhook', 'baseUri'), ['json' => $requestBody, 'headers' => ['X-Webhook-Verify-Hash' => $this->hash(json_encode($requestBody))]]);
         } catch (RequestException $ex) {
             // Sandboxes that 404 on PUT have probably just been refreshed. In this case we want to
             // update the local state of play to stop them getting pushed, instead of treating this

446) /home/barney/projects/matchbot/src/Client/Donation.php:84    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         }
         try {
             $requestBody = $donation->toHookModel();
-            $response = $this->getHttpClient()->put($this->getSetting('webhook', 'baseUri') . "/donation/{$donation->getSalesforceId()}", ['json' => $requestBody, 'headers' => ['X-Webhook-Verify-Hash' => $this->hash(json_encode($requestBody))]]);
+            $response = $this->getHttpClient()->put("/donation/{$donation->getSalesforceId()}", ['json' => $requestBody, 'headers' => ['X-Webhook-Verify-Hash' => $this->hash(json_encode($requestBody))]]);
         } catch (RequestException $ex) {
             // Sandboxes that 404 on PUT have probably just been refreshed. In this case we want to
             // update the local state of play to stop them getting pushed, instead of treating this

447) /home/barney/projects/matchbot/src/Client/Donation.php:84    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         }
         try {
             $requestBody = $donation->toHookModel();
-            $response = $this->getHttpClient()->put($this->getSetting('webhook', 'baseUri') . "/donation/{$donation->getSalesforceId()}", ['json' => $requestBody, 'headers' => ['X-Webhook-Verify-Hash' => $this->hash(json_encode($requestBody))]]);
+            $response = $this->getHttpClient()->put($this->getSetting('webhook', 'baseUri'), ['json' => $requestBody, 'headers' => ['X-Webhook-Verify-Hash' => $this->hash(json_encode($requestBody))]]);
         } catch (RequestException $ex) {
             // Sandboxes that 404 on PUT have probably just been refreshed. In this case we want to
             // update the local state of play to stop them getting pushed, instead of treating this

448) /home/barney/projects/matchbot/src/Client/Donation.php:85    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         }
         try {
             $requestBody = $donation->toHookModel();
-            $response = $this->getHttpClient()->put($this->getSetting('webhook', 'baseUri') . "/donation/{$donation->getSalesforceId()}", ['json' => $requestBody, 'headers' => ['X-Webhook-Verify-Hash' => $this->hash(json_encode($requestBody))]]);
+            $response = $this->getHttpClient()->put($this->getSetting('webhook', 'baseUri') . "/donation/{$donation->getSalesforceId()}", ['headers' => ['X-Webhook-Verify-Hash' => $this->hash(json_encode($requestBody))]]);
         } catch (RequestException $ex) {
             // Sandboxes that 404 on PUT have probably just been refreshed. In this case we want to
             // update the local state of play to stop them getting pushed, instead of treating this
