449) /home/barney/projects/matchbot/src/Client/Donation.php:87    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         }
         try {
             $requestBody = $donation->toHookModel();
-            $response = $this->getHttpClient()->put($this->getSetting('webhook', 'baseUri') . "/donation/{$donation->getSalesforceId()}", ['json' => $requestBody, 'headers' => ['X-Webhook-Verify-Hash' => $this->hash(json_encode($requestBody))]]);
+            $response = $this->getHttpClient()->put($this->getSetting('webhook', 'baseUri') . "/donation/{$donation->getSalesforceId()}", ['json' => $requestBody, 'headers' => []]);
         } catch (RequestException $ex) {
             // Sandboxes that 404 on PUT have probably just been refreshed. In this case we want to
             // update the local state of play to stop them getting pushed, instead of treating this

450) /home/barney/projects/matchbot/src/Client/Donation.php:88    [M] ArrayItem

--- Original
+++ New
@@ @@
         }
         try {
             $requestBody = $donation->toHookModel();
-            $response = $this->getHttpClient()->put($this->getSetting('webhook', 'baseUri') . "/donation/{$donation->getSalesforceId()}", ['json' => $requestBody, 'headers' => ['X-Webhook-Verify-Hash' => $this->hash(json_encode($requestBody))]]);
+            $response = $this->getHttpClient()->put($this->getSetting('webhook', 'baseUri') . "/donation/{$donation->getSalesforceId()}", ['json' => $requestBody, 'headers' => ['X-Webhook-Verify-Hash' > $this->hash(json_encode($requestBody))]]);
         } catch (RequestException $ex) {
             // Sandboxes that 404 on PUT have probably just been refreshed. In this case we want to
             // update the local state of play to stop them getting pushed, instead of treating this

453) /home/barney/projects/matchbot/src/Client/Donation.php:98    [M] Identical

--- Original
+++ New
@@ @@
             // as an error. So throw this for appropriate handling in the caller without an error level
             // log. In production, 404s should not happen and so we continue to `return false` which
             // will lead the caller to log an error.
-            if ($ex->getCode() === 404 && getenv('APP_ENV') !== 'production') {
+            if ($ex->getCode() !== 404 && getenv('APP_ENV') !== 'production') {
                 throw new NotFoundException();
             }
             $sandboxMissingLinkedResource = $ex->getCode() === 400 && getenv('APP_ENV') !== 'production' && str_contains($ex->getMessage(), '"entity is deleted"');

454) /home/barney/projects/matchbot/src/Client/Donation.php:98    [M] NotIdentical

--- Original
+++ New
@@ @@
             // as an error. So throw this for appropriate handling in the caller without an error level
             // log. In production, 404s should not happen and so we continue to `return false` which
             // will lead the caller to log an error.
-            if ($ex->getCode() === 404 && getenv('APP_ENV') !== 'production') {
+            if ($ex->getCode() === 404 && getenv('APP_ENV') === 'production') {
                 throw new NotFoundException();
             }
             $sandboxMissingLinkedResource = $ex->getCode() === 400 && getenv('APP_ENV') !== 'production' && str_contains($ex->getMessage(), '"entity is deleted"');

455) /home/barney/projects/matchbot/src/Client/Donation.php:98    [M] LogicalAnd

--- Original
+++ New
@@ @@
             // as an error. So throw this for appropriate handling in the caller without an error level
             // log. In production, 404s should not happen and so we continue to `return false` which
             // will lead the caller to log an error.
-            if ($ex->getCode() === 404 && getenv('APP_ENV') !== 'production') {
+            if ($ex->getCode() === 404 || getenv('APP_ENV') !== 'production') {
                 throw new NotFoundException();
             }
             $sandboxMissingLinkedResource = $ex->getCode() === 400 && getenv('APP_ENV') !== 'production' && str_contains($ex->getMessage(), '"entity is deleted"');

456) /home/barney/projects/matchbot/src/Client/Donation.php:98    [M] LogicalAndAllSubExprNegation

--- Original
+++ New
@@ @@
             // as an error. So throw this for appropriate handling in the caller without an error level
             // log. In production, 404s should not happen and so we continue to `return false` which
             // will lead the caller to log an error.
-            if ($ex->getCode() === 404 && getenv('APP_ENV') !== 'production') {
+            if (!($ex->getCode() === 404) && !(getenv('APP_ENV') !== 'production')) {
                 throw new NotFoundException();
             }
             $sandboxMissingLinkedResource = $ex->getCode() === 400 && getenv('APP_ENV') !== 'production' && str_contains($ex->getMessage(), '"entity is deleted"');

457) /home/barney/projects/matchbot/src/Client/Donation.php:98    [M] LogicalAndNegation

--- Original
+++ New
@@ @@
             // as an error. So throw this for appropriate handling in the caller without an error level
             // log. In production, 404s should not happen and so we continue to `return false` which
             // will lead the caller to log an error.
-            if ($ex->getCode() === 404 && getenv('APP_ENV') !== 'production') {
+            if (!($ex->getCode() === 404 && getenv('APP_ENV') !== 'production')) {
                 throw new NotFoundException();
             }
             $sandboxMissingLinkedResource = $ex->getCode() === 400 && getenv('APP_ENV') !== 'production' && str_contains($ex->getMessage(), '"entity is deleted"');

459) /home/barney/projects/matchbot/src/Client/Donation.php:103    [M] DecrementInteger

--- Original
+++ New
@@ @@
             if ($ex->getCode() === 404 && getenv('APP_ENV') !== 'production') {
                 throw new NotFoundException();
             }
-            $sandboxMissingLinkedResource = $ex->getCode() === 400 && getenv('APP_ENV') !== 'production' && str_contains($ex->getMessage(), '"entity is deleted"');
+            $sandboxMissingLinkedResource = $ex->getCode() === 399 && getenv('APP_ENV') !== 'production' && str_contains($ex->getMessage(), '"entity is deleted"');
             if ($sandboxMissingLinkedResource) {
                 /**
                  * The exception we throw here still takes the donation out of the push queue permenantly

460) /home/barney/projects/matchbot/src/Client/Donation.php:103    [M] IncrementInteger

--- Original
+++ New
@@ @@
             if ($ex->getCode() === 404 && getenv('APP_ENV') !== 'production') {
                 throw new NotFoundException();
             }
-            $sandboxMissingLinkedResource = $ex->getCode() === 400 && getenv('APP_ENV') !== 'production' && str_contains($ex->getMessage(), '"entity is deleted"');
+            $sandboxMissingLinkedResource = $ex->getCode() === 401 && getenv('APP_ENV') !== 'production' && str_contains($ex->getMessage(), '"entity is deleted"');
             if ($sandboxMissingLinkedResource) {
                 /**
                  * The exception we throw here still takes the donation out of the push queue permenantly

461) /home/barney/projects/matchbot/src/Client/Donation.php:103    [M] Identical

--- Original
+++ New
@@ @@
             if ($ex->getCode() === 404 && getenv('APP_ENV') !== 'production') {
                 throw new NotFoundException();
             }
-            $sandboxMissingLinkedResource = $ex->getCode() === 400 && getenv('APP_ENV') !== 'production' && str_contains($ex->getMessage(), '"entity is deleted"');
+            $sandboxMissingLinkedResource = $ex->getCode() !== 400 && getenv('APP_ENV') !== 'production' && str_contains($ex->getMessage(), '"entity is deleted"');
             if ($sandboxMissingLinkedResource) {
                 /**
                  * The exception we throw here still takes the donation out of the push queue permenantly

462) /home/barney/projects/matchbot/src/Client/Donation.php:103    [M] LogicalAnd

--- Original
+++ New
@@ @@
             if ($ex->getCode() === 404 && getenv('APP_ENV') !== 'production') {
                 throw new NotFoundException();
             }
-            $sandboxMissingLinkedResource = $ex->getCode() === 400 && getenv('APP_ENV') !== 'production' && str_contains($ex->getMessage(), '"entity is deleted"');
+            $sandboxMissingLinkedResource = ($ex->getCode() === 400 || getenv('APP_ENV') !== 'production') && str_contains($ex->getMessage(), '"entity is deleted"');
             if ($sandboxMissingLinkedResource) {
                 /**
                  * The exception we throw here still takes the donation out of the push queue permenantly

463) /home/barney/projects/matchbot/src/Client/Donation.php:103    [M] LogicalAnd

--- Original
+++ New
@@ @@
             if ($ex->getCode() === 404 && getenv('APP_ENV') !== 'production') {
                 throw new NotFoundException();
             }
-            $sandboxMissingLinkedResource = $ex->getCode() === 400 && getenv('APP_ENV') !== 'production' && str_contains($ex->getMessage(), '"entity is deleted"');
+            $sandboxMissingLinkedResource = $ex->getCode() === 400 && getenv('APP_ENV') !== 'production' || str_contains($ex->getMessage(), '"entity is deleted"');
             if ($sandboxMissingLinkedResource) {
                 /**
                  * The exception we throw here still takes the donation out of the push queue permenantly

464) /home/barney/projects/matchbot/src/Client/Donation.php:103    [M] LogicalAndAllSubExprNegation

--- Original
+++ New
@@ @@
             if ($ex->getCode() === 404 && getenv('APP_ENV') !== 'production') {
                 throw new NotFoundException();
             }
-            $sandboxMissingLinkedResource = $ex->getCode() === 400 && getenv('APP_ENV') !== 'production' && str_contains($ex->getMessage(), '"entity is deleted"');
+            $sandboxMissingLinkedResource = !($ex->getCode() === 400) && !(getenv('APP_ENV') !== 'production') && !str_contains($ex->getMessage(), '"entity is deleted"');
             if ($sandboxMissingLinkedResource) {
                 /**
                  * The exception we throw here still takes the donation out of the push queue permenantly

465) /home/barney/projects/matchbot/src/Client/Donation.php:103    [M] LogicalAndNegation

--- Original
+++ New
@@ @@
             if ($ex->getCode() === 404 && getenv('APP_ENV') !== 'production') {
                 throw new NotFoundException();
             }
-            $sandboxMissingLinkedResource = $ex->getCode() === 400 && getenv('APP_ENV') !== 'production' && str_contains($ex->getMessage(), '"entity is deleted"');
+            $sandboxMissingLinkedResource = !($ex->getCode() === 400 && getenv('APP_ENV') !== 'production' && str_contains($ex->getMessage(), '"entity is deleted"'));
             if ($sandboxMissingLinkedResource) {
                 /**
                  * The exception we throw here still takes the donation out of the push queue permenantly

466) /home/barney/projects/matchbot/src/Client/Donation.php:103    [M] LogicalAndSingleSubExprNegation

--- Original
+++ New
@@ @@
             if ($ex->getCode() === 404 && getenv('APP_ENV') !== 'production') {
                 throw new NotFoundException();
             }
-            $sandboxMissingLinkedResource = $ex->getCode() === 400 && getenv('APP_ENV') !== 'production' && str_contains($ex->getMessage(), '"entity is deleted"');
+            $sandboxMissingLinkedResource = $ex->getCode() === 400 && getenv('APP_ENV') !== 'production' && !str_contains($ex->getMessage(), '"entity is deleted"');
             if ($sandboxMissingLinkedResource) {
                 /**
                  * The exception we throw here still takes the donation out of the push queue permenantly

467) /home/barney/projects/matchbot/src/Client/Donation.php:104    [M] NotIdentical

--- Original
+++ New
@@ @@
             if ($ex->getCode() === 404 && getenv('APP_ENV') !== 'production') {
                 throw new NotFoundException();
             }
-            $sandboxMissingLinkedResource = $ex->getCode() === 400 && getenv('APP_ENV') !== 'production' && str_contains($ex->getMessage(), '"entity is deleted"');
+            $sandboxMissingLinkedResource = $ex->getCode() === 400 && getenv('APP_ENV') === 'production' && str_contains($ex->getMessage(), '"entity is deleted"');
             if ($sandboxMissingLinkedResource) {
                 /**
                  * The exception we throw here still takes the donation out of the push queue permenantly

468) /home/barney/projects/matchbot/src/Client/Donation.php:107    [M] IfNegation

--- Original
+++ New
@@ @@
                 throw new NotFoundException();
             }
             $sandboxMissingLinkedResource = $ex->getCode() === 400 && getenv('APP_ENV') !== 'production' && str_contains($ex->getMessage(), '"entity is deleted"');
-            if ($sandboxMissingLinkedResource) {
+            if (!$sandboxMissingLinkedResource) {
                 /**
                  * The exception we throw here still takes the donation out of the push queue permenantly
                  * – {@see DonationRepository::doUpdate()} – but as this case is not as well

469) /home/barney/projects/matchbot/src/Client/Donation.php:115    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             }
             $sandboxMissingLinkedResource = $ex->getCode() === 400 && getenv('APP_ENV') !== 'production' && str_contains($ex->getMessage(), '"entity is deleted"');
             if ($sandboxMissingLinkedResource) {
-                /**
-                 * The exception we throw here still takes the donation out of the push queue permenantly
-                 * – {@see DonationRepository::doUpdate()} – but as this case is not as well
-                 * understood, we also log a one time high severity error so we are better able to
-                 * monitor these cases and try to understand what is happening in sandboxes that hit
-                 * this edge case.
-                 */
-                $this->logger->error(sprintf('Donation update skipped due to missing sandbox resource. Exception %s: %s. Body: %s', get_class($ex), $ex->getMessage(), $ex->getResponse() ? $ex->getResponse()->getBody() : 'N/A'));
+                
                 throw new NotFoundException();
             }
             // All other errors should be logged so we get a notification and the app left to retry the

470) /home/barney/projects/matchbot/src/Client/Donation.php:119    [M] Ternary

--- Original
+++ New
@@ @@
                  * monitor these cases and try to understand what is happening in sandboxes that hit
                  * this edge case.
                  */
-                $this->logger->error(sprintf('Donation update skipped due to missing sandbox resource. Exception %s: %s. Body: %s', get_class($ex), $ex->getMessage(), $ex->getResponse() ? $ex->getResponse()->getBody() : 'N/A'));
+                $this->logger->error(sprintf('Donation update skipped due to missing sandbox resource. Exception %s: %s. Body: %s', get_class($ex), $ex->getMessage(), $ex->getResponse() ? 'N/A' : $ex->getResponse()->getBody()));
                 throw new NotFoundException();
             }
             // All other errors should be logged so we get a notification and the app left to retry the

471) /home/barney/projects/matchbot/src/Client/Donation.php:122    [M] Throw_

--- Original
+++ New
@@ @@
                  * this edge case.
                  */
                 $this->logger->error(sprintf('Donation update skipped due to missing sandbox resource. Exception %s: %s. Body: %s', get_class($ex), $ex->getMessage(), $ex->getResponse() ? $ex->getResponse()->getBody() : 'N/A'));
-                throw new NotFoundException();
+                new NotFoundException();
             }
             // All other errors should be logged so we get a notification and the app left to retry the
             // push at a later date.

472) /home/barney/projects/matchbot/src/Client/Donation.php:127    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
                 $this->logger->error(sprintf('Donation update skipped due to missing sandbox resource. Exception %s: %s. Body: %s', get_class($ex), $ex->getMessage(), $ex->getResponse() ? $ex->getResponse()->getBody() : 'N/A'));
                 throw new NotFoundException();
             }
-            // All other errors should be logged so we get a notification and the app left to retry the
-            // push at a later date.
-            $this->logger->warning(sprintf('Donation update exception %s: %s. Body: %s', get_class($ex), $ex->getMessage(), $ex->getResponse() ? $ex->getResponse()->getBody() : 'N/A'));
+            
             return false;
         }
         return $response->getStatusCode() === 200;

473) /home/barney/projects/matchbot/src/Client/Donation.php:131    [M] Ternary

--- Original
+++ New
@@ @@
             }
             // All other errors should be logged so we get a notification and the app left to retry the
             // push at a later date.
-            $this->logger->warning(sprintf('Donation update exception %s: %s. Body: %s', get_class($ex), $ex->getMessage(), $ex->getResponse() ? $ex->getResponse()->getBody() : 'N/A'));
+            $this->logger->warning(sprintf('Donation update exception %s: %s. Body: %s', get_class($ex), $ex->getMessage(), $ex->getResponse() ? 'N/A' : $ex->getResponse()->getBody()));
             return false;
         }
         return $response->getStatusCode() === 200;

474) /home/barney/projects/matchbot/src/Client/Donation.php:134    [M] FalseValue

--- Original
+++ New
@@ @@
             // All other errors should be logged so we get a notification and the app left to retry the
             // push at a later date.
             $this->logger->warning(sprintf('Donation update exception %s: %s. Body: %s', get_class($ex), $ex->getMessage(), $ex->getResponse() ? $ex->getResponse()->getBody() : 'N/A'));
-            return false;
+            return true;
         }
         return $response->getStatusCode() === 200;
     }

475) /home/barney/projects/matchbot/src/Client/Donation.php:137    [M] DecrementInteger

--- Original
+++ New
@@ @@
             $this->logger->warning(sprintf('Donation update exception %s: %s. Body: %s', get_class($ex), $ex->getMessage(), $ex->getResponse() ? $ex->getResponse()->getBody() : 'N/A'));
             return false;
         }
-        return $response->getStatusCode() === 200;
+        return $response->getStatusCode() === 199;
     }
     private function hash(string $body) : string
     {

476) /home/barney/projects/matchbot/src/Client/Donation.php:137    [M] IncrementInteger

--- Original
+++ New
@@ @@
             $this->logger->warning(sprintf('Donation update exception %s: %s. Body: %s', get_class($ex), $ex->getMessage(), $ex->getResponse() ? $ex->getResponse()->getBody() : 'N/A'));
             return false;
         }
-        return $response->getStatusCode() === 200;
+        return $response->getStatusCode() === 201;
     }
     private function hash(string $body) : string
     {

477) /home/barney/projects/matchbot/src/Client/Donation.php:137    [M] Identical

--- Original
+++ New
@@ @@
             $this->logger->warning(sprintf('Donation update exception %s: %s. Body: %s', get_class($ex), $ex->getMessage(), $ex->getResponse() ? $ex->getResponse()->getBody() : 'N/A'));
             return false;
         }
-        return $response->getStatusCode() === 200;
+        return $response->getStatusCode() !== 200;
     }
     private function hash(string $body) : string
     {

480) /home/barney/projects/matchbot/src/Client/Fund.php:18    [M] DecrementInteger

--- Original
+++ New
@@ @@
     public function getById(string $fundId) : array
     {
         $response = $this->getHttpClient()->get("{$this->getSetting('fund', 'baseUri')}/{$fundId}");
-        if ($response->getStatusCode() !== 200) {
+        if ($response->getStatusCode() !== 199) {
             throw new NotFoundException('Fund not found');
         }
         return json_decode((string) $response->getBody(), true);

481) /home/barney/projects/matchbot/src/Client/Fund.php:18    [M] IncrementInteger

--- Original
+++ New
@@ @@
     public function getById(string $fundId) : array
     {
         $response = $this->getHttpClient()->get("{$this->getSetting('fund', 'baseUri')}/{$fundId}");
-        if ($response->getStatusCode() !== 200) {
+        if ($response->getStatusCode() !== 201) {
             throw new NotFoundException('Fund not found');
         }
         return json_decode((string) $response->getBody(), true);

482) /home/barney/projects/matchbot/src/Client/Fund.php:18    [M] NotIdentical

--- Original
+++ New
@@ @@
     public function getById(string $fundId) : array
     {
         $response = $this->getHttpClient()->get("{$this->getSetting('fund', 'baseUri')}/{$fundId}");
-        if ($response->getStatusCode() !== 200) {
+        if ($response->getStatusCode() === 200) {
             throw new NotFoundException('Fund not found');
         }
         return json_decode((string) $response->getBody(), true);

484) /home/barney/projects/matchbot/src/Client/Fund.php:22    [M] CastString

--- Original
+++ New
@@ @@
         if ($response->getStatusCode() !== 200) {
             throw new NotFoundException('Fund not found');
         }
-        return json_decode((string) $response->getBody(), true);
+        return json_decode($response->getBody(), true);
     }
     /**
      * @param string $campaignId

486) /home/barney/projects/matchbot/src/Client/Fund.php:34    [M] DecrementInteger

--- Original
+++ New
@@ @@
     public function getForCampaign(string $campaignId) : array
     {
         $response = $this->getHttpClient()->get("{$this->getSetting('campaign', 'baseUri')}/{$campaignId}/funds");
-        if ($response->getStatusCode() !== 200) {
+        if ($response->getStatusCode() !== 199) {
             throw new NotFoundException('Campaign not found');
         }
         return json_decode((string) $response->getBody(), true);
     }
 }

487) /home/barney/projects/matchbot/src/Client/Fund.php:34    [M] IncrementInteger

--- Original
+++ New
@@ @@
     public function getForCampaign(string $campaignId) : array
     {
         $response = $this->getHttpClient()->get("{$this->getSetting('campaign', 'baseUri')}/{$campaignId}/funds");
-        if ($response->getStatusCode() !== 200) {
+        if ($response->getStatusCode() !== 201) {
             throw new NotFoundException('Campaign not found');
         }
         return json_decode((string) $response->getBody(), true);
     }
 }

488) /home/barney/projects/matchbot/src/Client/Fund.php:34    [M] NotIdentical

--- Original
+++ New
@@ @@
     public function getForCampaign(string $campaignId) : array
     {
         $response = $this->getHttpClient()->get("{$this->getSetting('campaign', 'baseUri')}/{$campaignId}/funds");
-        if ($response->getStatusCode() !== 200) {
+        if ($response->getStatusCode() === 200) {
             throw new NotFoundException('Campaign not found');
         }
         return json_decode((string) $response->getBody(), true);
     }
 }

494) /home/barney/projects/matchbot/src/Client/Mailer.php:21    [M] Concat

--- Original
+++ New
@@ @@
     {
         try {
             $baseUri = $this->getSetting('mailer', 'baseUri');
-            $uri = $baseUri . '/v1/send';
+            $uri = '/v1/send' . $baseUri;
             $response = $this->getHttpClient()->post($uri, ['json' => $requestBody, 'headers' => ['x-send-verify-hash' => $this->hash(json_encode($requestBody))]]);
             if ($response->getStatusCode() === 200) {
                 return;

497) /home/barney/projects/matchbot/src/Client/Mailer.php:24    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         try {
             $baseUri = $this->getSetting('mailer', 'baseUri');
             $uri = $baseUri . '/v1/send';
-            $response = $this->getHttpClient()->post($uri, ['json' => $requestBody, 'headers' => ['x-send-verify-hash' => $this->hash(json_encode($requestBody))]]);
+            $response = $this->getHttpClient()->post($uri, ['headers' => ['x-send-verify-hash' => $this->hash(json_encode($requestBody))]]);
             if ($response->getStatusCode() === 200) {
                 return;
             } else {

498) /home/barney/projects/matchbot/src/Client/Mailer.php:26    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         try {
             $baseUri = $this->getSetting('mailer', 'baseUri');
             $uri = $baseUri . '/v1/send';
-            $response = $this->getHttpClient()->post($uri, ['json' => $requestBody, 'headers' => ['x-send-verify-hash' => $this->hash(json_encode($requestBody))]]);
+            $response = $this->getHttpClient()->post($uri, ['json' => $requestBody, 'headers' => []]);
             if ($response->getStatusCode() === 200) {
                 return;
             } else {

499) /home/barney/projects/matchbot/src/Client/Mailer.php:27    [M] ArrayItem

--- Original
+++ New
@@ @@
         try {
             $baseUri = $this->getSetting('mailer', 'baseUri');
             $uri = $baseUri . '/v1/send';
-            $response = $this->getHttpClient()->post($uri, ['json' => $requestBody, 'headers' => ['x-send-verify-hash' => $this->hash(json_encode($requestBody))]]);
+            $response = $this->getHttpClient()->post($uri, ['json' => $requestBody, 'headers' => ['x-send-verify-hash' > $this->hash(json_encode($requestBody))]]);
             if ($response->getStatusCode() === 200) {
                 return;
             } else {

500) /home/barney/projects/matchbot/src/Client/Mailer.php:32    [M] DecrementInteger

--- Original
+++ New
@@ @@
             $baseUri = $this->getSetting('mailer', 'baseUri');
             $uri = $baseUri . '/v1/send';
             $response = $this->getHttpClient()->post($uri, ['json' => $requestBody, 'headers' => ['x-send-verify-hash' => $this->hash(json_encode($requestBody))]]);
-            if ($response->getStatusCode() === 200) {
+            if ($response->getStatusCode() === 199) {
                 return;
             } else {
                 $this->logger->warning(sprintf('%s email callout didn\'t return 200. It returned code: %s. Request body: %s. Response body: %s.', $requestBody['templateKey'], $response->getStatusCode(), json_encode($requestBody), $response->getBody()->getContents()));

501) /home/barney/projects/matchbot/src/Client/Mailer.php:32    [M] IncrementInteger

--- Original
+++ New
@@ @@
             $baseUri = $this->getSetting('mailer', 'baseUri');
             $uri = $baseUri . '/v1/send';
             $response = $this->getHttpClient()->post($uri, ['json' => $requestBody, 'headers' => ['x-send-verify-hash' => $this->hash(json_encode($requestBody))]]);
-            if ($response->getStatusCode() === 200) {
+            if ($response->getStatusCode() === 201) {
                 return;
             } else {
                 $this->logger->warning(sprintf('%s email callout didn\'t return 200. It returned code: %s. Request body: %s. Response body: %s.', $requestBody['templateKey'], $response->getStatusCode(), json_encode($requestBody), $response->getBody()->getContents()));

502) /home/barney/projects/matchbot/src/Client/Mailer.php:32    [M] Identical

--- Original
+++ New
@@ @@
             $baseUri = $this->getSetting('mailer', 'baseUri');
             $uri = $baseUri . '/v1/send';
             $response = $this->getHttpClient()->post($uri, ['json' => $requestBody, 'headers' => ['x-send-verify-hash' => $this->hash(json_encode($requestBody))]]);
-            if ($response->getStatusCode() === 200) {
+            if ($response->getStatusCode() !== 200) {
                 return;
             } else {
                 $this->logger->warning(sprintf('%s email callout didn\'t return 200. It returned code: %s. Request body: %s. Response body: %s.', $requestBody['templateKey'], $response->getStatusCode(), json_encode($requestBody), $response->getBody()->getContents()));

503) /home/barney/projects/matchbot/src/Client/Mailer.php:35    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             if ($response->getStatusCode() === 200) {
                 return;
             } else {
-                $this->logger->warning(sprintf('%s email callout didn\'t return 200. It returned code: %s. Request body: %s. Response body: %s.', $requestBody['templateKey'], $response->getStatusCode(), json_encode($requestBody), $response->getBody()->getContents()));
+                
                 return;
             }
         } catch (RequestException $ex) {

504) /home/barney/projects/matchbot/src/Client/Mailer.php:47    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             }
         } catch (RequestException $ex) {
             $response = $ex->getResponse();
-            $this->logger->error(sprintf('%s email exception %s with error code %s: %s. Body: %s', $requestBody['templateKey'], get_class($ex), $ex->getCode(), $ex->getMessage(), $response ? $response->getBody()->getContents() : 'N/A'));
+            
             return;
         } catch (GuzzleException $ex) {
             $this->logger->error(sprintf('%s email exception %s with error code %s: %s. Body: %s', $requestBody['templateKey'], get_class($ex), $ex->getCode(), $ex->getMessage(), 'N/A'));
