505) /home/barney/projects/matchbot/src/Client/Mailer.php:53    [M] Ternary

--- Original
+++ New
@@ @@
             }
         } catch (RequestException $ex) {
             $response = $ex->getResponse();
-            $this->logger->error(sprintf('%s email exception %s with error code %s: %s. Body: %s', $requestBody['templateKey'], get_class($ex), $ex->getCode(), $ex->getMessage(), $response ? $response->getBody()->getContents() : 'N/A'));
+            $this->logger->error(sprintf('%s email exception %s with error code %s: %s. Body: %s', $requestBody['templateKey'], get_class($ex), $ex->getCode(), $ex->getMessage(), $response ? 'N/A' : $response->getBody()->getContents()));
             return;
         } catch (GuzzleException $ex) {
             $this->logger->error(sprintf('%s email exception %s with error code %s: %s. Body: %s', $requestBody['templateKey'], get_class($ex), $ex->getCode(), $ex->getMessage(), 'N/A'));

506) /home/barney/projects/matchbot/src/Client/Mailer.php:57    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             $this->logger->error(sprintf('%s email exception %s with error code %s: %s. Body: %s', $requestBody['templateKey'], get_class($ex), $ex->getCode(), $ex->getMessage(), $response ? $response->getBody()->getContents() : 'N/A'));
             return;
         } catch (GuzzleException $ex) {
-            $this->logger->error(sprintf('%s email exception %s with error code %s: %s. Body: %s', $requestBody['templateKey'], get_class($ex), $ex->getCode(), $ex->getMessage(), 'N/A'));
+            
             return;
         }
     }

511) /home/barney/projects/matchbot/src/Domain/CampaignFunding.php:81    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return "CampaignFunding, ID #{$this->id}, created {$this->createdAt->format('c')} of fund SF ID {$this->fund->getSalesforceId()}";
     }
-    public function isShared() : bool
+    protected function isShared() : bool
     {
         return count($this->campaigns) > 1;
     }

512) /home/barney/projects/matchbot/src/Domain/CampaignFunding.php:83    [M] GreaterThan

--- Original
+++ New
@@ @@
     }
     public function isShared() : bool
     {
-        return count($this->campaigns) > 1;
+        return count($this->campaigns) >= 1;
     }
     /**
      * @return string

513) /home/barney/projects/matchbot/src/Domain/CampaignFunding.php:83    [M] GreaterThanNegotiation

--- Original
+++ New
@@ @@
     }
     public function isShared() : bool
     {
-        return count($this->campaigns) > 1;
+        return count($this->campaigns) <= 1;
     }
     /**
      * @return string

515) /home/barney/projects/matchbot/src/Domain/CampaignFunding.php:156    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->fund;
     }
-    public function getCurrencyCode() : string
+    protected function getCurrencyCode() : string
     {
         return $this->currencyCode;
     }

518) /home/barney/projects/matchbot/src/Domain/CampaignFundingRepository.php:45    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $query->setParameter('campaign', $campaign->getId());
         return $query->getResult();
     }
-    public function getFunding(Fund $fund) : ?CampaignFunding
+    protected function getFunding(Fund $fund) : ?CampaignFunding
     {
         $query = $this->getEntityManager()->createQuery('
             SELECT cf FROM MatchBot\\Domain\\CampaignFunding cf

523) /home/barney/projects/matchbot/src/Domain/CampaignFundingRepository.php:57    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $query->execute();
         return $query->getOneOrNullResult();
     }
-    public function getFundingForCampaign(Campaign $campaign, Fund $fund) : ?CampaignFunding
+    protected function getFundingForCampaign(Campaign $campaign, Fund $fund) : ?CampaignFunding
     {
         $query = $this->getEntityManager()->createQuery('
             SELECT cf FROM MatchBot\\Domain\\CampaignFunding cf

531) /home/barney/projects/matchbot/src/Domain/CampaignRepository.php:52    [M] NotIdentical

--- Original
+++ New
@@ @@
     {
         $client = $this->getClient();
         $campaignData = $client->getById($campaign->getSalesforceId());
-        if ($campaign->hasBeenPersisted() && $campaign->getCurrencyCode() !== $campaignData['currencyCode']) {
+        if ($campaign->hasBeenPersisted() && $campaign->getCurrencyCode() === $campaignData['currencyCode']) {
             $this->logWarning(sprintf('Refusing to update campaign currency to %s for SF ID %s', $campaignData['currencyCode'], $campaignData['id']));
             throw new DomainCurrencyMustNotChangeException();
         }

532) /home/barney/projects/matchbot/src/Domain/CampaignRepository.php:52    [M] LogicalAnd

--- Original
+++ New
@@ @@
     {
         $client = $this->getClient();
         $campaignData = $client->getById($campaign->getSalesforceId());
-        if ($campaign->hasBeenPersisted() && $campaign->getCurrencyCode() !== $campaignData['currencyCode']) {
+        if ($campaign->hasBeenPersisted() || $campaign->getCurrencyCode() !== $campaignData['currencyCode']) {
             $this->logWarning(sprintf('Refusing to update campaign currency to %s for SF ID %s', $campaignData['currencyCode'], $campaignData['id']));
             throw new DomainCurrencyMustNotChangeException();
         }

533) /home/barney/projects/matchbot/src/Domain/CampaignRepository.php:52    [M] LogicalAndAllSubExprNegation

--- Original
+++ New
@@ @@
     {
         $client = $this->getClient();
         $campaignData = $client->getById($campaign->getSalesforceId());
-        if ($campaign->hasBeenPersisted() && $campaign->getCurrencyCode() !== $campaignData['currencyCode']) {
+        if (!$campaign->hasBeenPersisted() && !($campaign->getCurrencyCode() !== $campaignData['currencyCode'])) {
             $this->logWarning(sprintf('Refusing to update campaign currency to %s for SF ID %s', $campaignData['currencyCode'], $campaignData['id']));
             throw new DomainCurrencyMustNotChangeException();
         }

534) /home/barney/projects/matchbot/src/Domain/CampaignRepository.php:52    [M] LogicalAndNegation

--- Original
+++ New
@@ @@
     {
         $client = $this->getClient();
         $campaignData = $client->getById($campaign->getSalesforceId());
-        if ($campaign->hasBeenPersisted() && $campaign->getCurrencyCode() !== $campaignData['currencyCode']) {
+        if (!($campaign->hasBeenPersisted() && $campaign->getCurrencyCode() !== $campaignData['currencyCode'])) {
             $this->logWarning(sprintf('Refusing to update campaign currency to %s for SF ID %s', $campaignData['currencyCode'], $campaignData['id']));
             throw new DomainCurrencyMustNotChangeException();
         }

535) /home/barney/projects/matchbot/src/Domain/CampaignRepository.php:52    [M] LogicalAndSingleSubExprNegation

--- Original
+++ New
@@ @@
     {
         $client = $this->getClient();
         $campaignData = $client->getById($campaign->getSalesforceId());
-        if ($campaign->hasBeenPersisted() && $campaign->getCurrencyCode() !== $campaignData['currencyCode']) {
+        if (!$campaign->hasBeenPersisted() && $campaign->getCurrencyCode() !== $campaignData['currencyCode']) {
             $this->logWarning(sprintf('Refusing to update campaign currency to %s for SF ID %s', $campaignData['currencyCode'], $campaignData['id']));
             throw new DomainCurrencyMustNotChangeException();
         }

536) /home/barney/projects/matchbot/src/Domain/CampaignRepository.php:53    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $client = $this->getClient();
         $campaignData = $client->getById($campaign->getSalesforceId());
         if ($campaign->hasBeenPersisted() && $campaign->getCurrencyCode() !== $campaignData['currencyCode']) {
-            $this->logWarning(sprintf('Refusing to update campaign currency to %s for SF ID %s', $campaignData['currencyCode'], $campaignData['id']));
+            
             throw new DomainCurrencyMustNotChangeException();
         }

537) /home/barney/projects/matchbot/src/Domain/CampaignRepository.php:59    [M] Throw_

--- Original
+++ New
@@ @@
         $campaignData = $client->getById($campaign->getSalesforceId());
         if ($campaign->hasBeenPersisted() && $campaign->getCurrencyCode() !== $campaignData['currencyCode']) {
             $this->logWarning(sprintf('Refusing to update campaign currency to %s for SF ID %s', $campaignData['currencyCode'], $campaignData['id']));
-            throw new DomainCurrencyMustNotChangeException();
+            new DomainCurrencyMustNotChangeException();
         }
         $campaign->setCharity($charity);

538) /home/barney/projects/matchbot/src/Domain/CampaignRepository.php:72    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             throw new DomainCurrencyMustNotChangeException();
         }
-        $campaign->setCharity($charity);
+        
         $campaign->setCurrencyCode($campaignData['currencyCode'] ?? 'GBP');
         $campaign->setEndDate(new DateTime($campaignData['endDate']));
         $campaign->setFeePercentage($campaignData['feePercentage']);

546) /home/barney/projects/matchbot/src/Domain/CampaignRepository.php:99    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
      */
     private function pullCharity(string $salesforceCharityId, string $charityName, ?string $stripeAccountId, ?string $giftAidOnboardingStatus, ?string $hmrcReferenceNumber, string $regulator, ?string $regulatorNumber) : Charity
     {
-        $charity = $this->getEntityManager()->getRepository(Charity::class)->findOneBy(['salesforceId' => $salesforceCharityId]);
+        $charity = $this->getEntityManager()->getRepository(Charity::class)->findOneBy([]);
         if (!$charity) {
         } else {

547) /home/barney/projects/matchbot/src/Domain/CampaignRepository.php:100    [M] LogicalNot

--- Original
+++ New
@@ @@
     private function pullCharity(string $salesforceCharityId, string $charityName, ?string $stripeAccountId, ?string $giftAidOnboardingStatus, ?string $hmrcReferenceNumber, string $regulator, ?string $regulatorNumber) : Charity
     {
         $charity = $this->getEntityManager()->getRepository(Charity::class)->findOneBy(['salesforceId' => $salesforceCharityId]);
-        if (!$charity) {
+        if ($charity) {
         } else {

549) /home/barney/projects/matchbot/src/Domain/CampaignRepository.php:123    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         } else {
         }
-        $this->getEntityManager()->persist($charity);
+        
         return $charity;
     }
     protected function getRegulatorHMRCIdentifier(string $regulatorName) : ?string

550) /home/barney/projects/matchbot/src/Domain/CampaignRepository.php:128    [M] ProtectedVisibility

--- Original
+++ New
@@ @@
         $this->getEntityManager()->persist($charity);
         return $charity;
     }
-    protected function getRegulatorHMRCIdentifier(string $regulatorName) : ?string
+    private function getRegulatorHMRCIdentifier(string $regulatorName) : ?string
     {
         return match ($regulatorName) {
             'England and Wales' => 'CCEW',

556) /home/barney/projects/matchbot/src/Domain/Currency.php:11    [M] PublicVisibility

--- Original
+++ New
@@ @@
 enum Currency
 {
     case GBP;
-    public static function fromIsoCode(mixed $isoCode) : self
+    protected static function fromIsoCode(mixed $isoCode) : self
     {
         Assertion::length($isoCode, 3);
         Assertion::alnum($isoCode);

559) /home/barney/projects/matchbot/src/Domain/Currency.php:13    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     case GBP;
     public static function fromIsoCode(mixed $isoCode) : self
     {
-        Assertion::length($isoCode, 3);
+        
         Assertion::alnum($isoCode);
         return match (strtoupper($isoCode)) {
             'GBP' => self::GBP,

564) /home/barney/projects/matchbot/src/Domain/Currency.php:17    [M] Concat

--- Original
+++ New
@@ @@
         Assertion::alnum($isoCode);
         return match (strtoupper($isoCode)) {
             'GBP' => self::GBP,
-            default => throw new \UnexpectedValueException("Unexpected Currency ISO Code" . $isoCode),
+            default => throw new \UnexpectedValueException($isoCode . "Unexpected Currency ISO Code"),
         };
     }
     /**

565) /home/barney/projects/matchbot/src/Domain/Currency.php:17    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         Assertion::alnum($isoCode);
         return match (strtoupper($isoCode)) {
             'GBP' => self::GBP,
-            default => throw new \UnexpectedValueException("Unexpected Currency ISO Code" . $isoCode),
+            default => throw new \UnexpectedValueException($isoCode),
         };
     }
     /**

566) /home/barney/projects/matchbot/src/Domain/Currency.php:17    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         Assertion::alnum($isoCode);
         return match (strtoupper($isoCode)) {
             'GBP' => self::GBP,
-            default => throw new \UnexpectedValueException("Unexpected Currency ISO Code" . $isoCode),
+            default => throw new \UnexpectedValueException("Unexpected Currency ISO Code"),
         };
     }
     /**

570) /home/barney/projects/matchbot/src/Domain/Donation.php:391    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         } catch (\Throwable $t) {
             // perhaps the charity was never pulled from Salesforce into our database, in which case we might
             // have a TypeError trying to get a string name from it.
-            $charityName = "[pending charity threw " . get_class($t) . "]";
+            $charityName = get_class($t) . "]";
         }
         return "Donation {$this->getUuid()} to {$charityName}";
     }

572) /home/barney/projects/matchbot/src/Domain/Donation.php:391    [M] Concat

--- Original
+++ New
@@ @@
         } catch (\Throwable $t) {
             // perhaps the charity was never pulled from Salesforce into our database, in which case we might
             // have a TypeError trying to get a string name from it.
-            $charityName = "[pending charity threw " . get_class($t) . "]";
+            $charityName = "[pending charity threw " . "]" . get_class($t);
         }
         return "Donation {$this->getUuid()} to {$charityName}";
     }

573) /home/barney/projects/matchbot/src/Domain/Donation.php:391    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         } catch (\Throwable $t) {
             // perhaps the charity was never pulled from Salesforce into our database, in which case we might
             // have a TypeError trying to get a string name from it.
-            $charityName = "[pending charity threw " . get_class($t) . "]";
+            $charityName = "[pending charity threw " . get_class($t);
         }
         return "Donation {$this->getUuid()} to {$charityName}";
     }

576) /home/barney/projects/matchbot/src/Domain/Donation.php:417    [M] NotIdentical

--- Original
+++ New
@@ @@
         if (!$args->hasChangedField('amount')) {
             return;
         }
-        if ($args->getOldValue('amount') !== $args->getNewValue('amount')) {
+        if ($args->getOldValue('amount') === $args->getNewValue('amount')) {
             throw new \LogicException('Amount may not be changed after a donation is created');
         }
     }

578) /home/barney/projects/matchbot/src/Domain/Donation.php:422    [M] PublicVisibility

--- Original
+++ New
@@ @@
             throw new \LogicException('Amount may not be changed after a donation is created');
         }
     }
-    public function replaceNullPaymentMethodTypeWithCard() : void
+    protected function replaceNullPaymentMethodTypeWithCard() : void
     {
         if ($this->paymentMethodType !== null) {
             throw new \Exception('Should only be called when payment method type is null');

587) /home/barney/projects/matchbot/src/Domain/Donation.php:732    [M] BCMath

--- Original
+++ New
@@ @@
         foreach ($this->fundingWithdrawals as $fundingWithdrawal) {
             // Rely on Doctrine `SINGLE_TABLE` inheritance structure to derive the type from the concrete class.
             if ($fundingWithdrawal->getCampaignFunding()->getFund() instanceof ChampionFund) {
-                $withdrawalTotal = bcadd($withdrawalTotal, $fundingWithdrawal->getAmount(), 2);
+                $withdrawalTotal = (string) ($withdrawalTotal + $fundingWithdrawal->getAmount());
             }
         }
         return $withdrawalTotal;

591) /home/barney/projects/matchbot/src/Domain/Donation.php:752    [M] IncrementInteger

--- Original
+++ New
@@ @@
         foreach ($this->fundingWithdrawals as $fundingWithdrawal) {
             // Rely on Doctrine `SINGLE_TABLE` inheritance structure to derive the type from the concrete class.
             if ($fundingWithdrawal->getCampaignFunding()->getFund() instanceof Pledge) {
-                $withdrawalTotal = bcadd($withdrawalTotal, $fundingWithdrawal->getAmount(), 2);
+                $withdrawalTotal = bcadd($withdrawalTotal, $fundingWithdrawal->getAmount(), 3);
             }
         }
         return $withdrawalTotal;

596) /home/barney/projects/matchbot/src/Domain/DonationRepository.php:60    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             $salesforceDonationId = $this->getClient()->create($donation);
             $donation->setSalesforceId($salesforceDonationId);
         } catch (NotFoundException $ex) {
-            // Thrown only for *sandbox* 404s -> quietly stop trying to push donation to a removed campaign.
-            $this->logInfo("Marking Salesforce donation {$donation->getUuid()} as campaign removed; will not try to push again.");
+            
             $donation->setSalesforcePushStatus(SalesforceWriteProxy::PUSH_STATUS_REMOVED);
             $this->getEntityManager()->persist($donation);
             return true;

597) /home/barney/projects/matchbot/src/Domain/DonationRepository.php:63    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         } catch (NotFoundException $ex) {
             // Thrown only for *sandbox* 404s -> quietly stop trying to push donation to a removed campaign.
             $this->logInfo("Marking Salesforce donation {$donation->getUuid()} as campaign removed; will not try to push again.");
-            $donation->setSalesforcePushStatus(SalesforceWriteProxy::PUSH_STATUS_REMOVED);
+            
             $this->getEntityManager()->persist($donation);
             return true;
             // Report 'success' for simpler summaries and spotting of real errors.

599) /home/barney/projects/matchbot/src/Domain/DonationRepository.php:66    [M] TrueValue

--- Original
+++ New
@@ @@
             $this->logInfo("Marking Salesforce donation {$donation->getUuid()} as campaign removed; will not try to push again.");
             $donation->setSalesforcePushStatus(SalesforceWriteProxy::PUSH_STATUS_REMOVED);
             $this->getEntityManager()->persist($donation);
-            return true;
+            return false;
             // Report 'success' for simpler summaries and spotting of real errors.
         } catch (BadRequestException $exception) {
             return false;

603) /home/barney/projects/matchbot/src/Domain/DonationRepository.php:126    [M] Throw_

--- Original
+++ New
@@ @@
     public function buildFromApiRequest(DonationCreate $donationData) : Donation
     {
         if (!in_array($donationData->psp, ['stripe'], true)) {
-            throw new \UnexpectedValueException(sprintf('PSP %s is invalid', $donationData->psp));
+            new \UnexpectedValueException(sprintf('PSP %s is invalid', $donationData->psp));
         }
         $campaign = $this->campaignRepository->findOneBy(['salesforceId' => $donationData->projectId]);
         if (!$campaign) {

604) /home/barney/projects/matchbot/src/Domain/DonationRepository.php:136    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         }
         $campaign = $this->campaignRepository->findOneBy(['salesforceId' => $donationData->projectId]);
         if (!$campaign) {
-            // Fetch data for as-yet-unknown campaigns on-demand
-            $this->logInfo("Loading unknown campaign ID {$donationData->projectId} on-demand");
+            
             $campaign = new Campaign(charity: null);
             $campaign->setSalesforceId($donationData->projectId);
             try {

609) /home/barney/projects/matchbot/src/Domain/DonationRepository.php:147    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
                 throw new \UnexpectedValueException('Campaign does not exist');
             }
             $this->fundRepository->pullForCampaign($campaign);
-            $this->getEntityManager()->flush();
+            
             // Because this case of campaigns being set up individually is relatively rare,
             // it is the one place outside of `UpdateCampaigns` where we clear the whole
             // result cache. It's currently the only user-invoked or single item place where

614) /home/barney/projects/matchbot/src/Domain/DonationRepository.php:192    [M] LogicalNot

--- Original
+++ New
@@ @@
         $amountMatchedAtStart = $donation->getFundingWithdrawalTotal();
         /** @var FundingWithdrawal[] $newWithdrawals */
         $newWithdrawals = [];
-        while (!$allocationDone && $allocationTries < $this->maxLockTries) {
+        while ($allocationDone && $allocationTries < $this->maxLockTries) {
             try {
                 $likelyAvailableFunds = $this->getEntityManager()->getRepository(CampaignFunding::class)->getAvailableFundings($donation->getCampaign());
                 foreach ($likelyAvailableFunds as $funding) {

615) /home/barney/projects/matchbot/src/Domain/DonationRepository.php:192    [M] LessThan

--- Original
+++ New
@@ @@
         $amountMatchedAtStart = $donation->getFundingWithdrawalTotal();
         /** @var FundingWithdrawal[] $newWithdrawals */
         $newWithdrawals = [];
-        while (!$allocationDone && $allocationTries < $this->maxLockTries) {
+        while (!$allocationDone && $allocationTries <= $this->maxLockTries) {
             try {
                 $likelyAvailableFunds = $this->getEntityManager()->getRepository(CampaignFunding::class)->getAvailableFundings($donation->getCampaign());
                 foreach ($likelyAvailableFunds as $funding) {

616) /home/barney/projects/matchbot/src/Domain/DonationRepository.php:192    [M] LessThanNegotiation

--- Original
+++ New
@@ @@
         $amountMatchedAtStart = $donation->getFundingWithdrawalTotal();
         /** @var FundingWithdrawal[] $newWithdrawals */
         $newWithdrawals = [];
-        while (!$allocationDone && $allocationTries < $this->maxLockTries) {
+        while (!$allocationDone && $allocationTries >= $this->maxLockTries) {
             try {
                 $likelyAvailableFunds = $this->getEntityManager()->getRepository(CampaignFunding::class)->getAvailableFundings($donation->getCampaign());
                 foreach ($likelyAvailableFunds as $funding) {

617) /home/barney/projects/matchbot/src/Domain/DonationRepository.php:192    [M] LogicalAnd

--- Original
+++ New
@@ @@
         $amountMatchedAtStart = $donation->getFundingWithdrawalTotal();
         /** @var FundingWithdrawal[] $newWithdrawals */
         $newWithdrawals = [];
-        while (!$allocationDone && $allocationTries < $this->maxLockTries) {
+        while (!$allocationDone || $allocationTries < $this->maxLockTries) {
             try {
                 $likelyAvailableFunds = $this->getEntityManager()->getRepository(CampaignFunding::class)->getAvailableFundings($donation->getCampaign());
                 foreach ($likelyAvailableFunds as $funding) {

618) /home/barney/projects/matchbot/src/Domain/DonationRepository.php:192    [M] LogicalAndAllSubExprNegation

--- Original
+++ New
@@ @@
         $amountMatchedAtStart = $donation->getFundingWithdrawalTotal();
         /** @var FundingWithdrawal[] $newWithdrawals */
         $newWithdrawals = [];
-        while (!$allocationDone && $allocationTries < $this->maxLockTries) {
+        while ($allocationDone && !($allocationTries < $this->maxLockTries)) {
             try {
                 $likelyAvailableFunds = $this->getEntityManager()->getRepository(CampaignFunding::class)->getAvailableFundings($donation->getCampaign());
                 foreach ($likelyAvailableFunds as $funding) {

619) /home/barney/projects/matchbot/src/Domain/DonationRepository.php:192    [M] LogicalAndNegation

--- Original
+++ New
@@ @@
         $amountMatchedAtStart = $donation->getFundingWithdrawalTotal();
         /** @var FundingWithdrawal[] $newWithdrawals */
         $newWithdrawals = [];
-        while (!$allocationDone && $allocationTries < $this->maxLockTries) {
+        while (!(!$allocationDone && $allocationTries < $this->maxLockTries)) {
             try {
                 $likelyAvailableFunds = $this->getEntityManager()->getRepository(CampaignFunding::class)->getAvailableFundings($donation->getCampaign());
                 foreach ($likelyAvailableFunds as $funding) {

620) /home/barney/projects/matchbot/src/Domain/DonationRepository.php:192    [M] While_

--- Original
+++ New
@@ @@
         $amountMatchedAtStart = $donation->getFundingWithdrawalTotal();
         /** @var FundingWithdrawal[] $newWithdrawals */
         $newWithdrawals = [];
-        while (!$allocationDone && $allocationTries < $this->maxLockTries) {
+        while (false) {
             try {
                 $likelyAvailableFunds = $this->getEntityManager()->getRepository(CampaignFunding::class)->getAvailableFundings($donation->getCampaign());
                 foreach ($likelyAvailableFunds as $funding) {

621) /home/barney/projects/matchbot/src/Domain/DonationRepository.php:198    [M] Foreach_

--- Original
+++ New
@@ @@
         while (!$allocationDone && $allocationTries < $this->maxLockTries) {
             try {
                 $likelyAvailableFunds = $this->getEntityManager()->getRepository(CampaignFunding::class)->getAvailableFundings($donation->getCampaign());
-                foreach ($likelyAvailableFunds as $funding) {
+                foreach (array() as $funding) {
                     if ($funding->getCurrencyCode() !== $donation->getCurrencyCode()) {
                         throw new \UnexpectedValueException('Currency mismatch');
                     }

624) /home/barney/projects/matchbot/src/Domain/DonationRepository.php:210    [M] TrueValue

--- Original
+++ New
@@ @@
                 $lockStartTime = microtime(true);
                 $newWithdrawals = $this->matchingAdapter->runTransactionally(fn() => $this->safelyAllocateFunds($donation, $likelyAvailableFunds, $amountMatchedAtStart));
                 $lockEndTime = microtime(true);
-                $allocationDone = true;
+                $allocationDone = false;
                 $this->persistQueuedDonations();
             } catch (Matching\TerminalLockException $exception) {
                 // Includes non-retryable `DBALException`s

626) /home/barney/projects/matchbot/src/Domain/DonationRepository.php:213    [M] Minus

--- Original
+++ New
@@ @@
                 $this->persistQueuedDonations();
             } catch (Matching\TerminalLockException $exception) {
                 // Includes non-retryable `DBALException`s
-                $waitTime = round(microtime(true) - $lockStartTime, 6);
+                $waitTime = round(microtime(true) + $lockStartTime, 6);
                 $this->logError("Match allocate FINAL error: ID {$donation->getUuid()} got " . get_class($exception) . " after {$waitTime}s on try #{$allocationTries}: {$exception->getMessage()}");
                 throw $exception;
                 // Re-throw exception after logging the details if not recoverable

627) /home/barney/projects/matchbot/src/Domain/DonationRepository.php:213    [M] DecrementInteger

--- Original
+++ New
@@ @@
                 $this->persistQueuedDonations();
             } catch (Matching\TerminalLockException $exception) {
                 // Includes non-retryable `DBALException`s
-                $waitTime = round(microtime(true) - $lockStartTime, 6);
+                $waitTime = round(microtime(true) - $lockStartTime, 5);
                 $this->logError("Match allocate FINAL error: ID {$donation->getUuid()} got " . get_class($exception) . " after {$waitTime}s on try #{$allocationTries}: {$exception->getMessage()}");
                 throw $exception;
                 // Re-throw exception after logging the details if not recoverable

628) /home/barney/projects/matchbot/src/Domain/DonationRepository.php:213    [M] IncrementInteger

--- Original
+++ New
@@ @@
                 $this->persistQueuedDonations();
             } catch (Matching\TerminalLockException $exception) {
                 // Includes non-retryable `DBALException`s
-                $waitTime = round(microtime(true) - $lockStartTime, 6);
+                $waitTime = round(microtime(true) - $lockStartTime, 7);
                 $this->logError("Match allocate FINAL error: ID {$donation->getUuid()} got " . get_class($exception) . " after {$waitTime}s on try #{$allocationTries}: {$exception->getMessage()}");
                 throw $exception;
                 // Re-throw exception after logging the details if not recoverable
