629) /home/barney/projects/matchbot/src/Domain/DonationRepository.php:213    [M] RoundingFamily

--- Original
+++ New
@@ @@
                 $this->persistQueuedDonations();
             } catch (Matching\TerminalLockException $exception) {
                 // Includes non-retryable `DBALException`s
-                $waitTime = round(microtime(true) - $lockStartTime, 6);
+                $waitTime = floor(microtime(true) - $lockStartTime);
                 $this->logError("Match allocate FINAL error: ID {$donation->getUuid()} got " . get_class($exception) . " after {$waitTime}s on try #{$allocationTries}: {$exception->getMessage()}");
                 throw $exception;
                 // Re-throw exception after logging the details if not recoverable

630) /home/barney/projects/matchbot/src/Domain/DonationRepository.php:213    [M] RoundingFamily

--- Original
+++ New
@@ @@
                 $this->persistQueuedDonations();
             } catch (Matching\TerminalLockException $exception) {
                 // Includes non-retryable `DBALException`s
-                $waitTime = round(microtime(true) - $lockStartTime, 6);
+                $waitTime = ceil(microtime(true) - $lockStartTime);
                 $this->logError("Match allocate FINAL error: ID {$donation->getUuid()} got " . get_class($exception) . " after {$waitTime}s on try #{$allocationTries}: {$exception->getMessage()}");
                 throw $exception;
                 // Re-throw exception after logging the details if not recoverable

631) /home/barney/projects/matchbot/src/Domain/DonationRepository.php:214    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             } catch (Matching\TerminalLockException $exception) {
                 // Includes non-retryable `DBALException`s
                 $waitTime = round(microtime(true) - $lockStartTime, 6);
-                $this->logError("Match allocate FINAL error: ID {$donation->getUuid()} got " . get_class($exception) . " after {$waitTime}s on try #{$allocationTries}: {$exception->getMessage()}");
+                
                 throw $exception;
                 // Re-throw exception after logging the details if not recoverable
             }

632) /home/barney/projects/matchbot/src/Domain/DonationRepository.php:215    [M] Concat

--- Original
+++ New
@@ @@
             } catch (Matching\TerminalLockException $exception) {
                 // Includes non-retryable `DBALException`s
                 $waitTime = round(microtime(true) - $lockStartTime, 6);
-                $this->logError("Match allocate FINAL error: ID {$donation->getUuid()} got " . get_class($exception) . " after {$waitTime}s on try #{$allocationTries}: {$exception->getMessage()}");
+                $this->logError(get_class($exception) . "Match allocate FINAL error: ID {$donation->getUuid()} got " . " after {$waitTime}s on try #{$allocationTries}: {$exception->getMessage()}");
                 throw $exception;
                 // Re-throw exception after logging the details if not recoverable
             }

633) /home/barney/projects/matchbot/src/Domain/DonationRepository.php:215    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             } catch (Matching\TerminalLockException $exception) {
                 // Includes non-retryable `DBALException`s
                 $waitTime = round(microtime(true) - $lockStartTime, 6);
-                $this->logError("Match allocate FINAL error: ID {$donation->getUuid()} got " . get_class($exception) . " after {$waitTime}s on try #{$allocationTries}: {$exception->getMessage()}");
+                $this->logError(get_class($exception) . " after {$waitTime}s on try #{$allocationTries}: {$exception->getMessage()}");
                 throw $exception;
                 // Re-throw exception after logging the details if not recoverable
             }

634) /home/barney/projects/matchbot/src/Domain/DonationRepository.php:215    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             } catch (Matching\TerminalLockException $exception) {
                 // Includes non-retryable `DBALException`s
                 $waitTime = round(microtime(true) - $lockStartTime, 6);
-                $this->logError("Match allocate FINAL error: ID {$donation->getUuid()} got " . get_class($exception) . " after {$waitTime}s on try #{$allocationTries}: {$exception->getMessage()}");
+                $this->logError("Match allocate FINAL error: ID {$donation->getUuid()} got " . " after {$waitTime}s on try #{$allocationTries}: {$exception->getMessage()}");
                 throw $exception;
                 // Re-throw exception after logging the details if not recoverable
             }

635) /home/barney/projects/matchbot/src/Domain/DonationRepository.php:215    [M] Concat

--- Original
+++ New
@@ @@
             } catch (Matching\TerminalLockException $exception) {
                 // Includes non-retryable `DBALException`s
                 $waitTime = round(microtime(true) - $lockStartTime, 6);
-                $this->logError("Match allocate FINAL error: ID {$donation->getUuid()} got " . get_class($exception) . " after {$waitTime}s on try #{$allocationTries}: {$exception->getMessage()}");
+                $this->logError("Match allocate FINAL error: ID {$donation->getUuid()} got " . " after {$waitTime}s on try #{$allocationTries}: {$exception->getMessage()}" . get_class($exception));
                 throw $exception;
                 // Re-throw exception after logging the details if not recoverable
             }

636) /home/barney/projects/matchbot/src/Domain/DonationRepository.php:215    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             } catch (Matching\TerminalLockException $exception) {
                 // Includes non-retryable `DBALException`s
                 $waitTime = round(microtime(true) - $lockStartTime, 6);
-                $this->logError("Match allocate FINAL error: ID {$donation->getUuid()} got " . get_class($exception) . " after {$waitTime}s on try #{$allocationTries}: {$exception->getMessage()}");
+                $this->logError("Match allocate FINAL error: ID {$donation->getUuid()} got " . get_class($exception));
                 throw $exception;
                 // Re-throw exception after logging the details if not recoverable
             }

637) /home/barney/projects/matchbot/src/Domain/DonationRepository.php:218    [M] Throw_

--- Original
+++ New
@@ @@
                 // Includes non-retryable `DBALException`s
                 $waitTime = round(microtime(true) - $lockStartTime, 6);
                 $this->logError("Match allocate FINAL error: ID {$donation->getUuid()} got " . get_class($exception) . " after {$waitTime}s on try #{$allocationTries}: {$exception->getMessage()}");
-                throw $exception;
+                $exception;
                 // Re-throw exception after logging the details if not recoverable
             }
         }

638) /home/barney/projects/matchbot/src/Domain/DonationRepository.php:222    [M] LogicalNot

--- Original
+++ New
@@ @@
                 // Re-throw exception after logging the details if not recoverable
             }
         }
-        if (!$allocationDone) {
+        if ($allocationDone) {
             $this->logger->error("Match allocate FINAL error: ID {$donation->getUuid()} failed matching after {$allocationTries} tries");
             throw new DomainLockContentionException();
         }

639) /home/barney/projects/matchbot/src/Domain/DonationRepository.php:223    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             }
         }
         if (!$allocationDone) {
-            $this->logger->error("Match allocate FINAL error: ID {$donation->getUuid()} failed matching after {$allocationTries} tries");
+            
             throw new DomainLockContentionException();
         }
         // We release the allocation lock prior to inserting the funding withdrawal records, to keep the lock

640) /home/barney/projects/matchbot/src/Domain/DonationRepository.php:227    [M] Throw_

--- Original
+++ New
@@ @@
         }
         if (!$allocationDone) {
             $this->logger->error("Match allocate FINAL error: ID {$donation->getUuid()} failed matching after {$allocationTries} tries");
-            throw new DomainLockContentionException();
+            new DomainLockContentionException();
         }
         // We release the allocation lock prior to inserting the funding withdrawal records, to keep the lock
         // time short. These are new entities, so except in a system crash the withdrawal totals will almost

641) /home/barney/projects/matchbot/src/Domain/DonationRepository.php:235    [M] Foreach_

--- Original
+++ New
@@ @@
         // time short. These are new entities, so except in a system crash the withdrawal totals will almost
         // immediately match the amount deducted from the fund.
         $amountNewlyMatched = '0.0';
-        foreach ($newWithdrawals as $newWithdrawal) {
+        foreach (array() as $newWithdrawal) {
             $this->getEntityManager()->persist($newWithdrawal);
             $donation->addFundingWithdrawal($newWithdrawal);
             $amountNewlyMatched = bcadd($amountNewlyMatched, $newWithdrawal->getAmount(), 2);

644) /home/barney/projects/matchbot/src/Domain/DonationRepository.php:238    [M] DecrementInteger

--- Original
+++ New
@@ @@
         foreach ($newWithdrawals as $newWithdrawal) {
             $this->getEntityManager()->persist($newWithdrawal);
             $donation->addFundingWithdrawal($newWithdrawal);
-            $amountNewlyMatched = bcadd($amountNewlyMatched, $newWithdrawal->getAmount(), 2);
+            $amountNewlyMatched = bcadd($amountNewlyMatched, $newWithdrawal->getAmount(), 1);
         }
         $this->logInfo('ID ' . $donation->getUuid() . ' allocated new match funds totalling ' . $amountNewlyMatched);
         $this->logInfo('Allocation took ' . round($lockEndTime - $lockStartTime, 6) . ' seconds');

647) /home/barney/projects/matchbot/src/Domain/DonationRepository.php:241    [M] Concat

--- Original
+++ New
@@ @@
             $donation->addFundingWithdrawal($newWithdrawal);
             $amountNewlyMatched = bcadd($amountNewlyMatched, $newWithdrawal->getAmount(), 2);
         }
-        $this->logInfo('ID ' . $donation->getUuid() . ' allocated new match funds totalling ' . $amountNewlyMatched);
+        $this->logInfo($donation->getUuid() . 'ID ' . ' allocated new match funds totalling ' . $amountNewlyMatched);
         $this->logInfo('Allocation took ' . round($lockEndTime - $lockStartTime, 6) . ' seconds');
         $this->getEntityManager()->flush();
         return $amountNewlyMatched;

648) /home/barney/projects/matchbot/src/Domain/DonationRepository.php:241    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             $donation->addFundingWithdrawal($newWithdrawal);
             $amountNewlyMatched = bcadd($amountNewlyMatched, $newWithdrawal->getAmount(), 2);
         }
-        $this->logInfo('ID ' . $donation->getUuid() . ' allocated new match funds totalling ' . $amountNewlyMatched);
+        $this->logInfo($donation->getUuid() . ' allocated new match funds totalling ' . $amountNewlyMatched);
         $this->logInfo('Allocation took ' . round($lockEndTime - $lockStartTime, 6) . ' seconds');
         $this->getEntityManager()->flush();
         return $amountNewlyMatched;

649) /home/barney/projects/matchbot/src/Domain/DonationRepository.php:241    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             $donation->addFundingWithdrawal($newWithdrawal);
             $amountNewlyMatched = bcadd($amountNewlyMatched, $newWithdrawal->getAmount(), 2);
         }
-        $this->logInfo('ID ' . $donation->getUuid() . ' allocated new match funds totalling ' . $amountNewlyMatched);
+        $this->logInfo('ID ' . ' allocated new match funds totalling ' . $amountNewlyMatched);
         $this->logInfo('Allocation took ' . round($lockEndTime - $lockStartTime, 6) . ' seconds');
         $this->getEntityManager()->flush();
         return $amountNewlyMatched;

650) /home/barney/projects/matchbot/src/Domain/DonationRepository.php:241    [M] Concat

--- Original
+++ New
@@ @@
             $donation->addFundingWithdrawal($newWithdrawal);
             $amountNewlyMatched = bcadd($amountNewlyMatched, $newWithdrawal->getAmount(), 2);
         }
-        $this->logInfo('ID ' . $donation->getUuid() . ' allocated new match funds totalling ' . $amountNewlyMatched);
+        $this->logInfo('ID ' . ' allocated new match funds totalling ' . $donation->getUuid() . $amountNewlyMatched);
         $this->logInfo('Allocation took ' . round($lockEndTime - $lockStartTime, 6) . ' seconds');
         $this->getEntityManager()->flush();
         return $amountNewlyMatched;

651) /home/barney/projects/matchbot/src/Domain/DonationRepository.php:241    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             $donation->addFundingWithdrawal($newWithdrawal);
             $amountNewlyMatched = bcadd($amountNewlyMatched, $newWithdrawal->getAmount(), 2);
         }
-        $this->logInfo('ID ' . $donation->getUuid() . ' allocated new match funds totalling ' . $amountNewlyMatched);
+        $this->logInfo('ID ' . $donation->getUuid() . $amountNewlyMatched);
         $this->logInfo('Allocation took ' . round($lockEndTime - $lockStartTime, 6) . ' seconds');
         $this->getEntityManager()->flush();
         return $amountNewlyMatched;

652) /home/barney/projects/matchbot/src/Domain/DonationRepository.php:241    [M] Concat

--- Original
+++ New
@@ @@
             $donation->addFundingWithdrawal($newWithdrawal);
             $amountNewlyMatched = bcadd($amountNewlyMatched, $newWithdrawal->getAmount(), 2);
         }
-        $this->logInfo('ID ' . $donation->getUuid() . ' allocated new match funds totalling ' . $amountNewlyMatched);
+        $this->logInfo('ID ' . $donation->getUuid() . $amountNewlyMatched . ' allocated new match funds totalling ');
         $this->logInfo('Allocation took ' . round($lockEndTime - $lockStartTime, 6) . ' seconds');
         $this->getEntityManager()->flush();
         return $amountNewlyMatched;

653) /home/barney/projects/matchbot/src/Domain/DonationRepository.php:241    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             $donation->addFundingWithdrawal($newWithdrawal);
             $amountNewlyMatched = bcadd($amountNewlyMatched, $newWithdrawal->getAmount(), 2);
         }
-        $this->logInfo('ID ' . $donation->getUuid() . ' allocated new match funds totalling ' . $amountNewlyMatched);
+        $this->logInfo('ID ' . $donation->getUuid() . ' allocated new match funds totalling ');
         $this->logInfo('Allocation took ' . round($lockEndTime - $lockStartTime, 6) . ' seconds');
         $this->getEntityManager()->flush();
         return $amountNewlyMatched;

654) /home/barney/projects/matchbot/src/Domain/DonationRepository.php:241    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             $donation->addFundingWithdrawal($newWithdrawal);
             $amountNewlyMatched = bcadd($amountNewlyMatched, $newWithdrawal->getAmount(), 2);
         }
-        $this->logInfo('ID ' . $donation->getUuid() . ' allocated new match funds totalling ' . $amountNewlyMatched);
+        
         $this->logInfo('Allocation took ' . round($lockEndTime - $lockStartTime, 6) . ' seconds');
         $this->getEntityManager()->flush();
         return $amountNewlyMatched;

656) /home/barney/projects/matchbot/src/Domain/DonationRepository.php:242    [M] DecrementInteger

--- Original
+++ New
@@ @@
             $amountNewlyMatched = bcadd($amountNewlyMatched, $newWithdrawal->getAmount(), 2);
         }
         $this->logInfo('ID ' . $donation->getUuid() . ' allocated new match funds totalling ' . $amountNewlyMatched);
-        $this->logInfo('Allocation took ' . round($lockEndTime - $lockStartTime, 6) . ' seconds');
+        $this->logInfo('Allocation took ' . round($lockEndTime - $lockStartTime, 5) . ' seconds');
         $this->getEntityManager()->flush();
         return $amountNewlyMatched;
     }

657) /home/barney/projects/matchbot/src/Domain/DonationRepository.php:242    [M] IncrementInteger

--- Original
+++ New
@@ @@
             $amountNewlyMatched = bcadd($amountNewlyMatched, $newWithdrawal->getAmount(), 2);
         }
         $this->logInfo('ID ' . $donation->getUuid() . ' allocated new match funds totalling ' . $amountNewlyMatched);
-        $this->logInfo('Allocation took ' . round($lockEndTime - $lockStartTime, 6) . ' seconds');
+        $this->logInfo('Allocation took ' . round($lockEndTime - $lockStartTime, 7) . ' seconds');
         $this->getEntityManager()->flush();
         return $amountNewlyMatched;
     }

658) /home/barney/projects/matchbot/src/Domain/DonationRepository.php:242    [M] RoundingFamily

--- Original
+++ New
@@ @@
             $amountNewlyMatched = bcadd($amountNewlyMatched, $newWithdrawal->getAmount(), 2);
         }
         $this->logInfo('ID ' . $donation->getUuid() . ' allocated new match funds totalling ' . $amountNewlyMatched);
-        $this->logInfo('Allocation took ' . round($lockEndTime - $lockStartTime, 6) . ' seconds');
+        $this->logInfo('Allocation took ' . floor($lockEndTime - $lockStartTime) . ' seconds');
         $this->getEntityManager()->flush();
         return $amountNewlyMatched;
     }

659) /home/barney/projects/matchbot/src/Domain/DonationRepository.php:242    [M] RoundingFamily

--- Original
+++ New
@@ @@
             $amountNewlyMatched = bcadd($amountNewlyMatched, $newWithdrawal->getAmount(), 2);
         }
         $this->logInfo('ID ' . $donation->getUuid() . ' allocated new match funds totalling ' . $amountNewlyMatched);
-        $this->logInfo('Allocation took ' . round($lockEndTime - $lockStartTime, 6) . ' seconds');
+        $this->logInfo('Allocation took ' . ceil($lockEndTime - $lockStartTime) . ' seconds');
         $this->getEntityManager()->flush();
         return $amountNewlyMatched;
     }

660) /home/barney/projects/matchbot/src/Domain/DonationRepository.php:242    [M] Concat

--- Original
+++ New
@@ @@
             $amountNewlyMatched = bcadd($amountNewlyMatched, $newWithdrawal->getAmount(), 2);
         }
         $this->logInfo('ID ' . $donation->getUuid() . ' allocated new match funds totalling ' . $amountNewlyMatched);
-        $this->logInfo('Allocation took ' . round($lockEndTime - $lockStartTime, 6) . ' seconds');
+        $this->logInfo(round($lockEndTime - $lockStartTime, 6) . 'Allocation took ' . ' seconds');
         $this->getEntityManager()->flush();
         return $amountNewlyMatched;
     }

661) /home/barney/projects/matchbot/src/Domain/DonationRepository.php:242    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             $amountNewlyMatched = bcadd($amountNewlyMatched, $newWithdrawal->getAmount(), 2);
         }
         $this->logInfo('ID ' . $donation->getUuid() . ' allocated new match funds totalling ' . $amountNewlyMatched);
-        $this->logInfo('Allocation took ' . round($lockEndTime - $lockStartTime, 6) . ' seconds');
+        $this->logInfo(round($lockEndTime - $lockStartTime, 6) . ' seconds');
         $this->getEntityManager()->flush();
         return $amountNewlyMatched;
     }

662) /home/barney/projects/matchbot/src/Domain/DonationRepository.php:242    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             $amountNewlyMatched = bcadd($amountNewlyMatched, $newWithdrawal->getAmount(), 2);
         }
         $this->logInfo('ID ' . $donation->getUuid() . ' allocated new match funds totalling ' . $amountNewlyMatched);
-        $this->logInfo('Allocation took ' . round($lockEndTime - $lockStartTime, 6) . ' seconds');
+        $this->logInfo('Allocation took ' . ' seconds');
         $this->getEntityManager()->flush();
         return $amountNewlyMatched;
     }

663) /home/barney/projects/matchbot/src/Domain/DonationRepository.php:242    [M] Concat

--- Original
+++ New
@@ @@
             $amountNewlyMatched = bcadd($amountNewlyMatched, $newWithdrawal->getAmount(), 2);
         }
         $this->logInfo('ID ' . $donation->getUuid() . ' allocated new match funds totalling ' . $amountNewlyMatched);
-        $this->logInfo('Allocation took ' . round($lockEndTime - $lockStartTime, 6) . ' seconds');
+        $this->logInfo('Allocation took ' . ' seconds' . round($lockEndTime - $lockStartTime, 6));
         $this->getEntityManager()->flush();
         return $amountNewlyMatched;
     }

664) /home/barney/projects/matchbot/src/Domain/DonationRepository.php:242    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             $amountNewlyMatched = bcadd($amountNewlyMatched, $newWithdrawal->getAmount(), 2);
         }
         $this->logInfo('ID ' . $donation->getUuid() . ' allocated new match funds totalling ' . $amountNewlyMatched);
-        $this->logInfo('Allocation took ' . round($lockEndTime - $lockStartTime, 6) . ' seconds');
+        $this->logInfo('Allocation took ' . round($lockEndTime - $lockStartTime, 6));
         $this->getEntityManager()->flush();
         return $amountNewlyMatched;
     }

666) /home/barney/projects/matchbot/src/Domain/DonationRepository.php:244    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         }
         $this->logInfo('ID ' . $donation->getUuid() . ' allocated new match funds totalling ' . $amountNewlyMatched);
         $this->logInfo('Allocation took ' . round($lockEndTime - $lockStartTime, 6) . ' seconds');
-        $this->getEntityManager()->flush();
+        
         return $amountNewlyMatched;
     }
     /**

667) /home/barney/projects/matchbot/src/Domain/DonationRepository.php:309    [M] Foreach_

--- Original
+++ New
@@ @@
             try {
                 $lockStartTime = microtime(true);
                 $totalAmountReleased = $this->matchingAdapter->runTransactionally(function () use($donation, $totalAmountReleased) {
-                    foreach ($donation->getFundingWithdrawals() as $fundingWithdrawal) {
+                    foreach (array() as $fundingWithdrawal) {
                         $funding = $fundingWithdrawal->getCampaignFunding();
                         $newTotal = $this->matchingAdapter->addAmount($funding, $fundingWithdrawal->getAmount());
                         $totalAmountReleased = bcadd($totalAmountReleased, $fundingWithdrawal->getAmount(), 2);

668) /home/barney/projects/matchbot/src/Domain/DonationRepository.php:312    [M] DecrementInteger

--- Original
+++ New
@@ @@
                     foreach ($donation->getFundingWithdrawals() as $fundingWithdrawal) {
                         $funding = $fundingWithdrawal->getCampaignFunding();
                         $newTotal = $this->matchingAdapter->addAmount($funding, $fundingWithdrawal->getAmount());
-                        $totalAmountReleased = bcadd($totalAmountReleased, $fundingWithdrawal->getAmount(), 2);
+                        $totalAmountReleased = bcadd($totalAmountReleased, $fundingWithdrawal->getAmount(), 1);
                         $this->logInfo("Released {$fundingWithdrawal->getAmount()} to funding {$funding->getId()}");
                         $this->logInfo("New fund total for {$funding->getId()}: {$newTotal}");
                     }

672) /home/barney/projects/matchbot/src/Domain/DonationRepository.php:314    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
                         $newTotal = $this->matchingAdapter->addAmount($funding, $fundingWithdrawal->getAmount());
                         $totalAmountReleased = bcadd($totalAmountReleased, $fundingWithdrawal->getAmount(), 2);
                         $this->logInfo("Released {$fundingWithdrawal->getAmount()} to funding {$funding->getId()}");
-                        $this->logInfo("New fund total for {$funding->getId()}: {$newTotal}");
+                        
                     }
                     return $totalAmountReleased;
                 });

674) /home/barney/projects/matchbot/src/Domain/DonationRepository.php:329    [M] DecrementInteger

--- Original
+++ New
@@ @@
                     $this->logError('Doctrine could not remove withdrawals after maximum tries');
                 }
             } catch (Matching\TerminalLockException $exception) {
-                $waitTime = round(microtime(true) - $lockStartTime, 6);
+                $waitTime = round(microtime(true) - $lockStartTime, 5);
                 $this->logError('Match release FINAL error: ID ' . $donation->getUuid() . ' got ' . get_class($exception) . " after {$waitTime}s on try #{$releaseTries}: {$exception->getMessage()}");
                 throw $exception;
                 // Re-throw exception after logging the details if not recoverable

675) /home/barney/projects/matchbot/src/Domain/DonationRepository.php:329    [M] IncrementInteger

--- Original
+++ New
@@ @@
                     $this->logError('Doctrine could not remove withdrawals after maximum tries');
                 }
             } catch (Matching\TerminalLockException $exception) {
-                $waitTime = round(microtime(true) - $lockStartTime, 6);
+                $waitTime = round(microtime(true) - $lockStartTime, 7);
                 $this->logError('Match release FINAL error: ID ' . $donation->getUuid() . ' got ' . get_class($exception) . " after {$waitTime}s on try #{$releaseTries}: {$exception->getMessage()}");
                 throw $exception;
                 // Re-throw exception after logging the details if not recoverable

676) /home/barney/projects/matchbot/src/Domain/DonationRepository.php:329    [M] RoundingFamily

--- Original
+++ New
@@ @@
                     $this->logError('Doctrine could not remove withdrawals after maximum tries');
                 }
             } catch (Matching\TerminalLockException $exception) {
-                $waitTime = round(microtime(true) - $lockStartTime, 6);
+                $waitTime = floor(microtime(true) - $lockStartTime);
                 $this->logError('Match release FINAL error: ID ' . $donation->getUuid() . ' got ' . get_class($exception) . " after {$waitTime}s on try #{$releaseTries}: {$exception->getMessage()}");
                 throw $exception;
                 // Re-throw exception after logging the details if not recoverable

678) /home/barney/projects/matchbot/src/Domain/DonationRepository.php:330    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
                 }
             } catch (Matching\TerminalLockException $exception) {
                 $waitTime = round(microtime(true) - $lockStartTime, 6);
-                $this->logError('Match release FINAL error: ID ' . $donation->getUuid() . ' got ' . get_class($exception) . " after {$waitTime}s on try #{$releaseTries}: {$exception->getMessage()}");
+                
                 throw $exception;
                 // Re-throw exception after logging the details if not recoverable
             }

679) /home/barney/projects/matchbot/src/Domain/DonationRepository.php:331    [M] Concat

--- Original
+++ New
@@ @@
                 }
             } catch (Matching\TerminalLockException $exception) {
                 $waitTime = round(microtime(true) - $lockStartTime, 6);
-                $this->logError('Match release FINAL error: ID ' . $donation->getUuid() . ' got ' . get_class($exception) . " after {$waitTime}s on try #{$releaseTries}: {$exception->getMessage()}");
+                $this->logError($donation->getUuid() . 'Match release FINAL error: ID ' . ' got ' . get_class($exception) . " after {$waitTime}s on try #{$releaseTries}: {$exception->getMessage()}");
                 throw $exception;
                 // Re-throw exception after logging the details if not recoverable
             }

680) /home/barney/projects/matchbot/src/Domain/DonationRepository.php:331    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
                 }
             } catch (Matching\TerminalLockException $exception) {
                 $waitTime = round(microtime(true) - $lockStartTime, 6);
-                $this->logError('Match release FINAL error: ID ' . $donation->getUuid() . ' got ' . get_class($exception) . " after {$waitTime}s on try #{$releaseTries}: {$exception->getMessage()}");
+                $this->logError($donation->getUuid() . ' got ' . get_class($exception) . " after {$waitTime}s on try #{$releaseTries}: {$exception->getMessage()}");
                 throw $exception;
                 // Re-throw exception after logging the details if not recoverable
             }

681) /home/barney/projects/matchbot/src/Domain/DonationRepository.php:331    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
                 }
             } catch (Matching\TerminalLockException $exception) {
                 $waitTime = round(microtime(true) - $lockStartTime, 6);
-                $this->logError('Match release FINAL error: ID ' . $donation->getUuid() . ' got ' . get_class($exception) . " after {$waitTime}s on try #{$releaseTries}: {$exception->getMessage()}");
+                $this->logError('Match release FINAL error: ID ' . ' got ' . get_class($exception) . " after {$waitTime}s on try #{$releaseTries}: {$exception->getMessage()}");
                 throw $exception;
                 // Re-throw exception after logging the details if not recoverable
             }
