682) /home/barney/projects/matchbot/src/Domain/DonationRepository.php:331    [M] Concat

--- Original
+++ New
@@ @@
                 }
             } catch (Matching\TerminalLockException $exception) {
                 $waitTime = round(microtime(true) - $lockStartTime, 6);
-                $this->logError('Match release FINAL error: ID ' . $donation->getUuid() . ' got ' . get_class($exception) . " after {$waitTime}s on try #{$releaseTries}: {$exception->getMessage()}");
+                $this->logError('Match release FINAL error: ID ' . ' got ' . $donation->getUuid() . get_class($exception) . " after {$waitTime}s on try #{$releaseTries}: {$exception->getMessage()}");
                 throw $exception;
                 // Re-throw exception after logging the details if not recoverable
             }

683) /home/barney/projects/matchbot/src/Domain/DonationRepository.php:331    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
                 }
             } catch (Matching\TerminalLockException $exception) {
                 $waitTime = round(microtime(true) - $lockStartTime, 6);
-                $this->logError('Match release FINAL error: ID ' . $donation->getUuid() . ' got ' . get_class($exception) . " after {$waitTime}s on try #{$releaseTries}: {$exception->getMessage()}");
+                $this->logError('Match release FINAL error: ID ' . $donation->getUuid() . get_class($exception) . " after {$waitTime}s on try #{$releaseTries}: {$exception->getMessage()}");
                 throw $exception;
                 // Re-throw exception after logging the details if not recoverable
             }

684) /home/barney/projects/matchbot/src/Domain/DonationRepository.php:331    [M] Concat

--- Original
+++ New
@@ @@
                 }
             } catch (Matching\TerminalLockException $exception) {
                 $waitTime = round(microtime(true) - $lockStartTime, 6);
-                $this->logError('Match release FINAL error: ID ' . $donation->getUuid() . ' got ' . get_class($exception) . " after {$waitTime}s on try #{$releaseTries}: {$exception->getMessage()}");
+                $this->logError('Match release FINAL error: ID ' . $donation->getUuid() . get_class($exception) . ' got ' . " after {$waitTime}s on try #{$releaseTries}: {$exception->getMessage()}");
                 throw $exception;
                 // Re-throw exception after logging the details if not recoverable
             }

685) /home/barney/projects/matchbot/src/Domain/DonationRepository.php:331    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
                 }
             } catch (Matching\TerminalLockException $exception) {
                 $waitTime = round(microtime(true) - $lockStartTime, 6);
-                $this->logError('Match release FINAL error: ID ' . $donation->getUuid() . ' got ' . get_class($exception) . " after {$waitTime}s on try #{$releaseTries}: {$exception->getMessage()}");
+                $this->logError('Match release FINAL error: ID ' . $donation->getUuid() . ' got ' . " after {$waitTime}s on try #{$releaseTries}: {$exception->getMessage()}");
                 throw $exception;
                 // Re-throw exception after logging the details if not recoverable
             }

686) /home/barney/projects/matchbot/src/Domain/DonationRepository.php:331    [M] Concat

--- Original
+++ New
@@ @@
                 }
             } catch (Matching\TerminalLockException $exception) {
                 $waitTime = round(microtime(true) - $lockStartTime, 6);
-                $this->logError('Match release FINAL error: ID ' . $donation->getUuid() . ' got ' . get_class($exception) . " after {$waitTime}s on try #{$releaseTries}: {$exception->getMessage()}");
+                $this->logError('Match release FINAL error: ID ' . $donation->getUuid() . ' got ' . " after {$waitTime}s on try #{$releaseTries}: {$exception->getMessage()}" . get_class($exception));
                 throw $exception;
                 // Re-throw exception after logging the details if not recoverable
             }

687) /home/barney/projects/matchbot/src/Domain/DonationRepository.php:331    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
                 }
             } catch (Matching\TerminalLockException $exception) {
                 $waitTime = round(microtime(true) - $lockStartTime, 6);
-                $this->logError('Match release FINAL error: ID ' . $donation->getUuid() . ' got ' . get_class($exception) . " after {$waitTime}s on try #{$releaseTries}: {$exception->getMessage()}");
+                $this->logError('Match release FINAL error: ID ' . $donation->getUuid() . ' got ' . get_class($exception));
                 throw $exception;
                 // Re-throw exception after logging the details if not recoverable
             }

688) /home/barney/projects/matchbot/src/Domain/DonationRepository.php:334    [M] Throw_

--- Original
+++ New
@@ @@
             } catch (Matching\TerminalLockException $exception) {
                 $waitTime = round(microtime(true) - $lockStartTime, 6);
                 $this->logError('Match release FINAL error: ID ' . $donation->getUuid() . ' got ' . get_class($exception) . " after {$waitTime}s on try #{$releaseTries}: {$exception->getMessage()}");
-                throw $exception;
+                $exception;
                 // Re-throw exception after logging the details if not recoverable
             }
         }

689) /home/barney/projects/matchbot/src/Domain/DonationRepository.php:339    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             }
         }
         if (!$releaseDone) {
-            $this->logger->error("Match release FINAL error: ID {$donation->getUuid()} failed releasing after {$releaseTries} tries");
+            
             throw new DomainLockContentionException();
         }
         $this->logInfo("Taking from ID {$donation->getUuid()} released match funds totalling {$totalAmountReleased}");

690) /home/barney/projects/matchbot/src/Domain/DonationRepository.php:343    [M] Throw_

--- Original
+++ New
@@ @@
         }
         if (!$releaseDone) {
             $this->logger->error("Match release FINAL error: ID {$donation->getUuid()} failed releasing after {$releaseTries} tries");
-            throw new DomainLockContentionException();
+            new DomainLockContentionException();
         }
         $this->logInfo("Taking from ID {$donation->getUuid()} released match funds totalling {$totalAmountReleased}");
         $this->logInfo('Deallocation took ' . round($lockEndTime - $lockStartTime, 6) . ' seconds');

693) /home/barney/projects/matchbot/src/Domain/DonationRepository.php:357    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
      */
     public function findWithExpiredMatching(\DateTimeImmutable $now) : array
     {
-        $cutoff = $now->sub(new \DateInterval('PT' . self::EXPIRY_SECONDS . 'S'));
+        $cutoff = $now->sub(new \DateInterval(self::EXPIRY_SECONDS . 'S'));
         // As this is used by the only regular task working with donations,
         // `ExpireMatchFunds`, it makes more sense to opt it out of result caching

694) /home/barney/projects/matchbot/src/Domain/DonationRepository.php:357    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
      */
     public function findWithExpiredMatching(\DateTimeImmutable $now) : array
     {
-        $cutoff = $now->sub(new \DateInterval('PT' . self::EXPIRY_SECONDS . 'S'));
+        $cutoff = $now->sub(new \DateInterval('PT' . 'S'));
         // As this is used by the only regular task working with donations,
         // `ExpireMatchFunds`, it makes more sense to opt it out of result caching

695) /home/barney/projects/matchbot/src/Domain/DonationRepository.php:357    [M] Concat

--- Original
+++ New
@@ @@
      */
     public function findWithExpiredMatching(\DateTimeImmutable $now) : array
     {
-        $cutoff = $now->sub(new \DateInterval('PT' . self::EXPIRY_SECONDS . 'S'));
+        $cutoff = $now->sub(new \DateInterval('PT' . 'S' . self::EXPIRY_SECONDS));
         // As this is used by the only regular task working with donations,
         // `ExpireMatchFunds`, it makes more sense to opt it out of result caching

706) /home/barney/projects/matchbot/src/Domain/DonationRepository.php:604    [M] BCMath

--- Original
+++ New
@@ @@
      */
     private function safelyAllocateFunds(Donation $donation, array $fundings, string $amountMatchedAtStart) : array
     {
-        $amountLeftToMatch = bcsub($donation->getAmount(), $amountMatchedAtStart, 2);
+        $amountLeftToMatch = (string) ($donation->getAmount() - $amountMatchedAtStart);
         $currentFundingIndex = 0;
         /** @var FundingWithdrawal[] $newWithdrawals Track these to persist outside the lock window, to keep it short */
         $newWithdrawals = [];

708) /home/barney/projects/matchbot/src/Domain/DonationRepository.php:611    [M] LessThan

--- Original
+++ New
@@ @@
         $newWithdrawals = [];
         // Loop as long as there are still campaign funds not allocated and we have allocated less than the donation
         // amount
-        while ($currentFundingIndex < count($fundings) && bccomp($amountLeftToMatch, '0.00', 2) === 1) {
+        while ($currentFundingIndex <= count($fundings) && bccomp($amountLeftToMatch, '0.00', 2) === 1) {
             $funding = $fundings[$currentFundingIndex];
             $startAmountAvailable = $fundings[$currentFundingIndex]->getAmountAvailable();
             if (bccomp($funding->getAmountAvailable(), $amountLeftToMatch, 2) === -1) {

710) /home/barney/projects/matchbot/src/Domain/DonationRepository.php:611    [M] DecrementInteger

--- Original
+++ New
@@ @@
         $newWithdrawals = [];
         // Loop as long as there are still campaign funds not allocated and we have allocated less than the donation
         // amount
-        while ($currentFundingIndex < count($fundings) && bccomp($amountLeftToMatch, '0.00', 2) === 1) {
+        while ($currentFundingIndex < count($fundings) && bccomp($amountLeftToMatch, '0.00', 1) === 1) {
             $funding = $fundings[$currentFundingIndex];
             $startAmountAvailable = $fundings[$currentFundingIndex]->getAmountAvailable();
             if (bccomp($funding->getAmountAvailable(), $amountLeftToMatch, 2) === -1) {

711) /home/barney/projects/matchbot/src/Domain/DonationRepository.php:611    [M] IncrementInteger

--- Original
+++ New
@@ @@
         $newWithdrawals = [];
         // Loop as long as there are still campaign funds not allocated and we have allocated less than the donation
         // amount
-        while ($currentFundingIndex < count($fundings) && bccomp($amountLeftToMatch, '0.00', 2) === 1) {
+        while ($currentFundingIndex < count($fundings) && bccomp($amountLeftToMatch, '0.00', 3) === 1) {
             $funding = $fundings[$currentFundingIndex];
             $startAmountAvailable = $fundings[$currentFundingIndex]->getAmountAvailable();
             if (bccomp($funding->getAmountAvailable(), $amountLeftToMatch, 2) === -1) {

712) /home/barney/projects/matchbot/src/Domain/DonationRepository.php:611    [M] BCMath

--- Original
+++ New
@@ @@
         $newWithdrawals = [];
         // Loop as long as there are still campaign funds not allocated and we have allocated less than the donation
         // amount
-        while ($currentFundingIndex < count($fundings) && bccomp($amountLeftToMatch, '0.00', 2) === 1) {
+        while ($currentFundingIndex < count($fundings) && ($amountLeftToMatch <=> '0.00') === 1) {
             $funding = $fundings[$currentFundingIndex];
             $startAmountAvailable = $fundings[$currentFundingIndex]->getAmountAvailable();
             if (bccomp($funding->getAmountAvailable(), $amountLeftToMatch, 2) === -1) {

713) /home/barney/projects/matchbot/src/Domain/DonationRepository.php:611    [M] IncrementInteger

--- Original
+++ New
@@ @@
         $newWithdrawals = [];
         // Loop as long as there are still campaign funds not allocated and we have allocated less than the donation
         // amount
-        while ($currentFundingIndex < count($fundings) && bccomp($amountLeftToMatch, '0.00', 2) === 1) {
+        while ($currentFundingIndex < count($fundings) && bccomp($amountLeftToMatch, '0.00', 2) === 2) {
             $funding = $fundings[$currentFundingIndex];
             $startAmountAvailable = $fundings[$currentFundingIndex]->getAmountAvailable();
             if (bccomp($funding->getAmountAvailable(), $amountLeftToMatch, 2) === -1) {

714) /home/barney/projects/matchbot/src/Domain/DonationRepository.php:611    [M] Identical

--- Original
+++ New
@@ @@
         $newWithdrawals = [];
         // Loop as long as there are still campaign funds not allocated and we have allocated less than the donation
         // amount
-        while ($currentFundingIndex < count($fundings) && bccomp($amountLeftToMatch, '0.00', 2) === 1) {
+        while ($currentFundingIndex < count($fundings) && bccomp($amountLeftToMatch, '0.00', 2) !== 1) {
             $funding = $fundings[$currentFundingIndex];
             $startAmountAvailable = $fundings[$currentFundingIndex]->getAmountAvailable();
             if (bccomp($funding->getAmountAvailable(), $amountLeftToMatch, 2) === -1) {

715) /home/barney/projects/matchbot/src/Domain/DonationRepository.php:611    [M] LogicalAnd

--- Original
+++ New
@@ @@
         $newWithdrawals = [];
         // Loop as long as there are still campaign funds not allocated and we have allocated less than the donation
         // amount
-        while ($currentFundingIndex < count($fundings) && bccomp($amountLeftToMatch, '0.00', 2) === 1) {
+        while ($currentFundingIndex < count($fundings) || bccomp($amountLeftToMatch, '0.00', 2) === 1) {
             $funding = $fundings[$currentFundingIndex];
             $startAmountAvailable = $fundings[$currentFundingIndex]->getAmountAvailable();
             if (bccomp($funding->getAmountAvailable(), $amountLeftToMatch, 2) === -1) {

717) /home/barney/projects/matchbot/src/Domain/DonationRepository.php:611    [M] LogicalAndNegation

--- Original
+++ New
@@ @@
         $newWithdrawals = [];
         // Loop as long as there are still campaign funds not allocated and we have allocated less than the donation
         // amount
-        while ($currentFundingIndex < count($fundings) && bccomp($amountLeftToMatch, '0.00', 2) === 1) {
+        while (!($currentFundingIndex < count($fundings) && bccomp($amountLeftToMatch, '0.00', 2) === 1)) {
             $funding = $fundings[$currentFundingIndex];
             $startAmountAvailable = $fundings[$currentFundingIndex]->getAmountAvailable();
             if (bccomp($funding->getAmountAvailable(), $amountLeftToMatch, 2) === -1) {

718) /home/barney/projects/matchbot/src/Domain/DonationRepository.php:611    [M] While_

--- Original
+++ New
@@ @@
         $newWithdrawals = [];
         // Loop as long as there are still campaign funds not allocated and we have allocated less than the donation
         // amount
-        while ($currentFundingIndex < count($fundings) && bccomp($amountLeftToMatch, '0.00', 2) === 1) {
+        while (false) {
             $funding = $fundings[$currentFundingIndex];
             $startAmountAvailable = $fundings[$currentFundingIndex]->getAmountAvailable();
             if (bccomp($funding->getAmountAvailable(), $amountLeftToMatch, 2) === -1) {

719) /home/barney/projects/matchbot/src/Domain/DonationRepository.php:615    [M] DecrementInteger

--- Original
+++ New
@@ @@
         while ($currentFundingIndex < count($fundings) && bccomp($amountLeftToMatch, '0.00', 2) === 1) {
             $funding = $fundings[$currentFundingIndex];
             $startAmountAvailable = $fundings[$currentFundingIndex]->getAmountAvailable();
-            if (bccomp($funding->getAmountAvailable(), $amountLeftToMatch, 2) === -1) {
+            if (bccomp($funding->getAmountAvailable(), $amountLeftToMatch, 1) === -1) {
                 $amountToAllocateNow = $startAmountAvailable;
             } else {
                 $amountToAllocateNow = $amountLeftToMatch;

720) /home/barney/projects/matchbot/src/Domain/DonationRepository.php:615    [M] IncrementInteger

--- Original
+++ New
@@ @@
         while ($currentFundingIndex < count($fundings) && bccomp($amountLeftToMatch, '0.00', 2) === 1) {
             $funding = $fundings[$currentFundingIndex];
             $startAmountAvailable = $fundings[$currentFundingIndex]->getAmountAvailable();
-            if (bccomp($funding->getAmountAvailable(), $amountLeftToMatch, 2) === -1) {
+            if (bccomp($funding->getAmountAvailable(), $amountLeftToMatch, 3) === -1) {
                 $amountToAllocateNow = $startAmountAvailable;
             } else {
                 $amountToAllocateNow = $amountLeftToMatch;

721) /home/barney/projects/matchbot/src/Domain/DonationRepository.php:615    [M] BCMath

--- Original
+++ New
@@ @@
         while ($currentFundingIndex < count($fundings) && bccomp($amountLeftToMatch, '0.00', 2) === 1) {
             $funding = $fundings[$currentFundingIndex];
             $startAmountAvailable = $fundings[$currentFundingIndex]->getAmountAvailable();
-            if (bccomp($funding->getAmountAvailable(), $amountLeftToMatch, 2) === -1) {
+            if (($funding->getAmountAvailable() <=> $amountLeftToMatch) === -1) {
                 $amountToAllocateNow = $startAmountAvailable;
             } else {
                 $amountToAllocateNow = $amountLeftToMatch;

722) /home/barney/projects/matchbot/src/Domain/DonationRepository.php:615    [M] IncrementInteger

--- Original
+++ New
@@ @@
         while ($currentFundingIndex < count($fundings) && bccomp($amountLeftToMatch, '0.00', 2) === 1) {
             $funding = $fundings[$currentFundingIndex];
             $startAmountAvailable = $fundings[$currentFundingIndex]->getAmountAvailable();
-            if (bccomp($funding->getAmountAvailable(), $amountLeftToMatch, 2) === -1) {
+            if (bccomp($funding->getAmountAvailable(), $amountLeftToMatch, 2) === -0) {
                 $amountToAllocateNow = $startAmountAvailable;
             } else {
                 $amountToAllocateNow = $amountLeftToMatch;

723) /home/barney/projects/matchbot/src/Domain/DonationRepository.php:615    [M] Identical

--- Original
+++ New
@@ @@
         while ($currentFundingIndex < count($fundings) && bccomp($amountLeftToMatch, '0.00', 2) === 1) {
             $funding = $fundings[$currentFundingIndex];
             $startAmountAvailable = $fundings[$currentFundingIndex]->getAmountAvailable();
-            if (bccomp($funding->getAmountAvailable(), $amountLeftToMatch, 2) === -1) {
+            if (bccomp($funding->getAmountAvailable(), $amountLeftToMatch, 2) !== -1) {
                 $amountToAllocateNow = $startAmountAvailable;
             } else {
                 $amountToAllocateNow = $amountLeftToMatch;

724) /home/barney/projects/matchbot/src/Domain/DonationRepository.php:626    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
                 // If no exception thrown
             } catch (Matching\LessThanRequestedAllocatedException $exception) {
                 $amountAllocated = $exception->getAmountAllocated();
-                $this->logInfo("Amount available from funding {$funding->getId()} changed: - got {$amountAllocated} " . "of requested {$amountToAllocateNow}");
+                
             }
             $amountLeftToMatch = bcsub($amountLeftToMatch, $amountAllocated, 2);
             if (bccomp($amountAllocated, '0.00', 2) === 1) {

725) /home/barney/projects/matchbot/src/Domain/DonationRepository.php:627    [M] Concat

--- Original
+++ New
@@ @@
                 // If no exception thrown
             } catch (Matching\LessThanRequestedAllocatedException $exception) {
                 $amountAllocated = $exception->getAmountAllocated();
-                $this->logInfo("Amount available from funding {$funding->getId()} changed: - got {$amountAllocated} " . "of requested {$amountToAllocateNow}");
+                $this->logInfo("of requested {$amountToAllocateNow}" . "Amount available from funding {$funding->getId()} changed: - got {$amountAllocated} ");
             }
             $amountLeftToMatch = bcsub($amountLeftToMatch, $amountAllocated, 2);
             if (bccomp($amountAllocated, '0.00', 2) === 1) {

726) /home/barney/projects/matchbot/src/Domain/DonationRepository.php:627    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
                 // If no exception thrown
             } catch (Matching\LessThanRequestedAllocatedException $exception) {
                 $amountAllocated = $exception->getAmountAllocated();
-                $this->logInfo("Amount available from funding {$funding->getId()} changed: - got {$amountAllocated} " . "of requested {$amountToAllocateNow}");
+                $this->logInfo("of requested {$amountToAllocateNow}");
             }
             $amountLeftToMatch = bcsub($amountLeftToMatch, $amountAllocated, 2);
             if (bccomp($amountAllocated, '0.00', 2) === 1) {

727) /home/barney/projects/matchbot/src/Domain/DonationRepository.php:627    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
                 // If no exception thrown
             } catch (Matching\LessThanRequestedAllocatedException $exception) {
                 $amountAllocated = $exception->getAmountAllocated();
-                $this->logInfo("Amount available from funding {$funding->getId()} changed: - got {$amountAllocated} " . "of requested {$amountToAllocateNow}");
+                $this->logInfo("Amount available from funding {$funding->getId()} changed: - got {$amountAllocated} ");
             }
             $amountLeftToMatch = bcsub($amountLeftToMatch, $amountAllocated, 2);
             if (bccomp($amountAllocated, '0.00', 2) === 1) {

728) /home/barney/projects/matchbot/src/Domain/DonationRepository.php:632    [M] DecrementInteger

--- Original
+++ New
@@ @@
                 $amountAllocated = $exception->getAmountAllocated();
                 $this->logInfo("Amount available from funding {$funding->getId()} changed: - got {$amountAllocated} " . "of requested {$amountToAllocateNow}");
             }
-            $amountLeftToMatch = bcsub($amountLeftToMatch, $amountAllocated, 2);
+            $amountLeftToMatch = bcsub($amountLeftToMatch, $amountAllocated, 1);
             if (bccomp($amountAllocated, '0.00', 2) === 1) {
                 $withdrawal = new FundingWithdrawal();
                 $withdrawal->setDonation($donation);

729) /home/barney/projects/matchbot/src/Domain/DonationRepository.php:632    [M] IncrementInteger

--- Original
+++ New
@@ @@
                 $amountAllocated = $exception->getAmountAllocated();
                 $this->logInfo("Amount available from funding {$funding->getId()} changed: - got {$amountAllocated} " . "of requested {$amountToAllocateNow}");
             }
-            $amountLeftToMatch = bcsub($amountLeftToMatch, $amountAllocated, 2);
+            $amountLeftToMatch = bcsub($amountLeftToMatch, $amountAllocated, 3);
             if (bccomp($amountAllocated, '0.00', 2) === 1) {
                 $withdrawal = new FundingWithdrawal();
                 $withdrawal->setDonation($donation);

730) /home/barney/projects/matchbot/src/Domain/DonationRepository.php:632    [M] BCMath

--- Original
+++ New
@@ @@
                 $amountAllocated = $exception->getAmountAllocated();
                 $this->logInfo("Amount available from funding {$funding->getId()} changed: - got {$amountAllocated} " . "of requested {$amountToAllocateNow}");
             }
-            $amountLeftToMatch = bcsub($amountLeftToMatch, $amountAllocated, 2);
+            $amountLeftToMatch = (string) ($amountLeftToMatch - $amountAllocated);
             if (bccomp($amountAllocated, '0.00', 2) === 1) {
                 $withdrawal = new FundingWithdrawal();
                 $withdrawal->setDonation($donation);

731) /home/barney/projects/matchbot/src/Domain/DonationRepository.php:634    [M] DecrementInteger

--- Original
+++ New
@@ @@
                 $this->logInfo("Amount available from funding {$funding->getId()} changed: - got {$amountAllocated} " . "of requested {$amountToAllocateNow}");
             }
             $amountLeftToMatch = bcsub($amountLeftToMatch, $amountAllocated, 2);
-            if (bccomp($amountAllocated, '0.00', 2) === 1) {
+            if (bccomp($amountAllocated, '0.00', 1) === 1) {
                 $withdrawal = new FundingWithdrawal();
                 $withdrawal->setDonation($donation);
                 $withdrawal->setCampaignFunding($funding);

732) /home/barney/projects/matchbot/src/Domain/DonationRepository.php:634    [M] IncrementInteger

--- Original
+++ New
@@ @@
                 $this->logInfo("Amount available from funding {$funding->getId()} changed: - got {$amountAllocated} " . "of requested {$amountToAllocateNow}");
             }
             $amountLeftToMatch = bcsub($amountLeftToMatch, $amountAllocated, 2);
-            if (bccomp($amountAllocated, '0.00', 2) === 1) {
+            if (bccomp($amountAllocated, '0.00', 3) === 1) {
                 $withdrawal = new FundingWithdrawal();
                 $withdrawal->setDonation($donation);
                 $withdrawal->setCampaignFunding($funding);

733) /home/barney/projects/matchbot/src/Domain/DonationRepository.php:634    [M] BCMath

--- Original
+++ New
@@ @@
                 $this->logInfo("Amount available from funding {$funding->getId()} changed: - got {$amountAllocated} " . "of requested {$amountToAllocateNow}");
             }
             $amountLeftToMatch = bcsub($amountLeftToMatch, $amountAllocated, 2);
-            if (bccomp($amountAllocated, '0.00', 2) === 1) {
+            if (($amountAllocated <=> '0.00') === 1) {
                 $withdrawal = new FundingWithdrawal();
                 $withdrawal->setDonation($donation);
                 $withdrawal->setCampaignFunding($funding);

734) /home/barney/projects/matchbot/src/Domain/DonationRepository.php:634    [M] IncrementInteger

--- Original
+++ New
@@ @@
                 $this->logInfo("Amount available from funding {$funding->getId()} changed: - got {$amountAllocated} " . "of requested {$amountToAllocateNow}");
             }
             $amountLeftToMatch = bcsub($amountLeftToMatch, $amountAllocated, 2);
-            if (bccomp($amountAllocated, '0.00', 2) === 1) {
+            if (bccomp($amountAllocated, '0.00', 2) === 2) {
                 $withdrawal = new FundingWithdrawal();
                 $withdrawal->setDonation($donation);
                 $withdrawal->setCampaignFunding($funding);

735) /home/barney/projects/matchbot/src/Domain/DonationRepository.php:634    [M] Identical

--- Original
+++ New
@@ @@
                 $this->logInfo("Amount available from funding {$funding->getId()} changed: - got {$amountAllocated} " . "of requested {$amountToAllocateNow}");
             }
             $amountLeftToMatch = bcsub($amountLeftToMatch, $amountAllocated, 2);
-            if (bccomp($amountAllocated, '0.00', 2) === 1) {
+            if (bccomp($amountAllocated, '0.00', 2) !== 1) {
                 $withdrawal = new FundingWithdrawal();
                 $withdrawal->setDonation($donation);
                 $withdrawal->setCampaignFunding($funding);

739) /home/barney/projects/matchbot/src/Domain/DonationRepository.php:640    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
                 $withdrawal->setCampaignFunding($funding);
                 $withdrawal->setAmount($amountAllocated);
                 $newWithdrawals[] = $withdrawal;
-                $this->logInfo("Successfully withdrew {$amountAllocated} from funding {$funding->getId()}");
+                
                 $this->logInfo("New fund total for {$funding->getId()}: {$newTotal}");
             }
             $currentFundingIndex++;

740) /home/barney/projects/matchbot/src/Domain/DonationRepository.php:641    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
                 $withdrawal->setAmount($amountAllocated);
                 $newWithdrawals[] = $withdrawal;
                 $this->logInfo("Successfully withdrew {$amountAllocated} from funding {$funding->getId()}");
-                $this->logInfo("New fund total for {$funding->getId()}: {$newTotal}");
+                
             }
             $currentFundingIndex++;
         }

741) /home/barney/projects/matchbot/src/Domain/DonationRepository.php:644    [M] Increment

--- Original
+++ New
@@ @@
                 $this->logInfo("Successfully withdrew {$amountAllocated} from funding {$funding->getId()}");
                 $this->logInfo("New fund total for {$funding->getId()}: {$newTotal}");
             }
-            $currentFundingIndex++;
+            $currentFundingIndex--;
         }
         $this->queueForPersist($donation);
         return $newWithdrawals;

742) /home/barney/projects/matchbot/src/Domain/DonationRepository.php:647    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             }
             $currentFundingIndex++;
         }
-        $this->queueForPersist($donation);
+        
         return $newWithdrawals;
     }
     private function queueForPersist(Donation $donation) : void

743) /home/barney/projects/matchbot/src/Domain/DonationRepository.php:649    [M] ArrayOneItem

--- Original
+++ New
@@ @@
             $currentFundingIndex++;
         }
         $this->queueForPersist($donation);
-        return $newWithdrawals;
+        return count($newWithdrawals) > 1 ? array_slice($newWithdrawals, 0, 1, true) : $newWithdrawals;
     }
     private function queueForPersist(Donation $donation) : void
     {
