745) /home/barney/projects/matchbot/src/Domain/DonationRepository.php:663    [M] Foreach_

--- Original
+++ New
@@ @@
         if (count($this->queuedForPersist) === 0) {
             return;
         }
-        foreach ($this->queuedForPersist as $donation) {
+        foreach (array() as $donation) {
             $this->getEntityManager()->persist($donation);
         }
     }

748) /home/barney/projects/matchbot/src/Domain/DonationRepository.php:678    [M] Identical

--- Original
+++ New
@@ @@
         // We can't actually lock the row until we know the ID of the donation, so we fetch it first
         // using the criteria, and then call find once we know the ID to lock.
         $donation = $this->findOneBy($criteria, $orderBy);
-        if ($donation === null) {
+        if ($donation !== null) {
             return null;
         }
         $this->getEntityManager()->refresh($donation, LockMode::PESSIMISTIC_WRITE);

749) /home/barney/projects/matchbot/src/Domain/DonationRepository.php:682    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         if ($donation === null) {
             return null;
         }
-        $this->getEntityManager()->refresh($donation, LockMode::PESSIMISTIC_WRITE);
+        
         return $donation;
     }
     /**

750) /home/barney/projects/matchbot/src/Domain/DonationRepository.php:695    [M] Foreach_

--- Original
+++ New
@@ @@
     public function removeAllFundingWithdrawalsForDonation(Donation $donation) : void
     {
         $this->getEntityManager()->transactional(function () use($donation) {
-            foreach ($donation->getFundingWithdrawals() as $fundingWithdrawal) {
+            foreach (array() as $fundingWithdrawal) {
                 $this->getEntityManager()->remove($fundingWithdrawal);
             }
         });
     }
 }

755) /home/barney/projects/matchbot/src/Domain/DonorAccountRepository.php:22    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $this->getEntityManager()->persist($donorAccount);
         $this->getEntityManager()->flush();
     }
-    public function findByStripeIdOrNull(StripeCustomerId $stripeAccountId) : ?DonorAccount
+    protected function findByStripeIdOrNull(StripeCustomerId $stripeAccountId) : ?DonorAccount
     {
         // see https://github.com/laravel-doctrine/fluent/issues/51 for using findOneBy on a field of an embeddable.
         return $this->findOneBy(['stripeCustomerId.stripeCustomerId' => $stripeAccountId->stripeCustomerId]);
     }
 }

756) /home/barney/projects/matchbot/src/Domain/DonorAccountRepository.php:25    [M] ArrayItem

--- Original
+++ New
@@ @@
     public function findByStripeIdOrNull(StripeCustomerId $stripeAccountId) : ?DonorAccount
     {
         // see https://github.com/laravel-doctrine/fluent/issues/51 for using findOneBy on a field of an embeddable.
-        return $this->findOneBy(['stripeCustomerId.stripeCustomerId' => $stripeAccountId->stripeCustomerId]);
+        return $this->findOneBy(['stripeCustomerId.stripeCustomerId' > $stripeAccountId->stripeCustomerId]);
     }
 }

757) /home/barney/projects/matchbot/src/Domain/DonorAccountRepository.php:25    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     public function findByStripeIdOrNull(StripeCustomerId $stripeAccountId) : ?DonorAccount
     {
         // see https://github.com/laravel-doctrine/fluent/issues/51 for using findOneBy on a field of an embeddable.
-        return $this->findOneBy(['stripeCustomerId.stripeCustomerId' => $stripeAccountId->stripeCustomerId]);
+        return $this->findOneBy([]);
     }
 }

760) /home/barney/projects/matchbot/src/Domain/FundRepository.php:62    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
                 // Need the fund ID for the CampaignFunding find
             } catch (UniqueConstraintViolationException $exception) {
                 // Somebody else made the fund with this SF ID during the previous operations.
-                $this->logError('Skipping fund create as unique constraint failed on SF ID ' . $fundData['id']);
+                $this->logError($fundData['id']);
                 $fund = $this->findOneBy(['salesforceId' => $fundData['id']]);
                 $fund = $this->setAnyFundData($fund, $fundData);
                 $this->getEntityManager()->persist($fund);

762) /home/barney/projects/matchbot/src/Domain/FundRepository.php:62    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
                 $this->getEntityManager()->flush();
                 // Need the fund ID for the CampaignFunding find
             } catch (UniqueConstraintViolationException $exception) {
-                // Somebody else made the fund with this SF ID during the previous operations.
-                $this->logError('Skipping fund create as unique constraint failed on SF ID ' . $fundData['id']);
+                
                 $fund = $this->findOneBy(['salesforceId' => $fundData['id']]);
                 $fund = $this->setAnyFundData($fund, $fundData);
                 $this->getEntityManager()->persist($fund);

763) /home/barney/projects/matchbot/src/Domain/FundRepository.php:64    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
             } catch (UniqueConstraintViolationException $exception) {
                 // Somebody else made the fund with this SF ID during the previous operations.
                 $this->logError('Skipping fund create as unique constraint failed on SF ID ' . $fundData['id']);
-                $fund = $this->findOneBy(['salesforceId' => $fundData['id']]);
+                $fund = $this->findOneBy([]);
                 $fund = $this->setAnyFundData($fund, $fundData);
                 $this->getEntityManager()->persist($fund);
             }

766) /home/barney/projects/matchbot/src/Domain/FundRepository.php:117    [M] IncrementInteger

--- Original
+++ New
@@ @@
                 $campaignFunding->setAmount($amountForCampaign);
             }
             if ($fund instanceof Pledge) {
-                $campaignFunding->setAllocationOrder(100);
+                $campaignFunding->setAllocationOrder(101);
             } else {
                 $campaignFunding->setAllocationOrder(200);
             }

768) /home/barney/projects/matchbot/src/Domain/FundRepository.php:131    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
                 $this->getEntityManager()->persist($campaignFunding);
                 $this->getEntityManager()->flush();
             } catch (UniqueConstraintViolationException $exception) {
-                // Somebody else created the specific funding -> proceed without modifying it.
-                $this->logError('Skipping campaign funding create as constraint failed with campaign ' . $campaign->getId() . ', fund ' . $fund->getId());
+                
             }
         }
     }

769) /home/barney/projects/matchbot/src/Domain/FundRepository.php:132    [M] Concat

--- Original
+++ New
@@ @@
                 $this->getEntityManager()->flush();
             } catch (UniqueConstraintViolationException $exception) {
                 // Somebody else created the specific funding -> proceed without modifying it.
-                $this->logError('Skipping campaign funding create as constraint failed with campaign ' . $campaign->getId() . ', fund ' . $fund->getId());
+                $this->logError($campaign->getId() . 'Skipping campaign funding create as constraint failed with campaign ' . ', fund ' . $fund->getId());
             }
         }
     }

770) /home/barney/projects/matchbot/src/Domain/FundRepository.php:132    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
                 $this->getEntityManager()->flush();
             } catch (UniqueConstraintViolationException $exception) {
                 // Somebody else created the specific funding -> proceed without modifying it.
-                $this->logError('Skipping campaign funding create as constraint failed with campaign ' . $campaign->getId() . ', fund ' . $fund->getId());
+                $this->logError($campaign->getId() . ', fund ' . $fund->getId());
             }
         }
     }

771) /home/barney/projects/matchbot/src/Domain/FundRepository.php:132    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
                 $this->getEntityManager()->flush();
             } catch (UniqueConstraintViolationException $exception) {
                 // Somebody else created the specific funding -> proceed without modifying it.
-                $this->logError('Skipping campaign funding create as constraint failed with campaign ' . $campaign->getId() . ', fund ' . $fund->getId());
+                $this->logError('Skipping campaign funding create as constraint failed with campaign ' . ', fund ' . $fund->getId());
             }
         }
     }

772) /home/barney/projects/matchbot/src/Domain/FundRepository.php:132    [M] Concat

--- Original
+++ New
@@ @@
                 $this->getEntityManager()->flush();
             } catch (UniqueConstraintViolationException $exception) {
                 // Somebody else created the specific funding -> proceed without modifying it.
-                $this->logError('Skipping campaign funding create as constraint failed with campaign ' . $campaign->getId() . ', fund ' . $fund->getId());
+                $this->logError('Skipping campaign funding create as constraint failed with campaign ' . ', fund ' . $campaign->getId() . $fund->getId());
             }
         }
     }

773) /home/barney/projects/matchbot/src/Domain/FundRepository.php:132    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
                 $this->getEntityManager()->flush();
             } catch (UniqueConstraintViolationException $exception) {
                 // Somebody else created the specific funding -> proceed without modifying it.
-                $this->logError('Skipping campaign funding create as constraint failed with campaign ' . $campaign->getId() . ', fund ' . $fund->getId());
+                $this->logError('Skipping campaign funding create as constraint failed with campaign ' . $campaign->getId() . $fund->getId());
             }
         }
     }

774) /home/barney/projects/matchbot/src/Domain/FundRepository.php:132    [M] Concat

--- Original
+++ New
@@ @@
                 $this->getEntityManager()->flush();
             } catch (UniqueConstraintViolationException $exception) {
                 // Somebody else created the specific funding -> proceed without modifying it.
-                $this->logError('Skipping campaign funding create as constraint failed with campaign ' . $campaign->getId() . ', fund ' . $fund->getId());
+                $this->logError('Skipping campaign funding create as constraint failed with campaign ' . $campaign->getId() . $fund->getId() . ', fund ');
             }
         }
     }

775) /home/barney/projects/matchbot/src/Domain/FundRepository.php:132    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
                 $this->getEntityManager()->flush();
             } catch (UniqueConstraintViolationException $exception) {
                 // Somebody else created the specific funding -> proceed without modifying it.
-                $this->logError('Skipping campaign funding create as constraint failed with campaign ' . $campaign->getId() . ', fund ' . $fund->getId());
+                $this->logError('Skipping campaign funding create as constraint failed with campaign ' . $campaign->getId() . ', fund ');
             }
         }
     }

778) /home/barney/projects/matchbot/src/Domain/FundingWithdrawal.php:68    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         $this->campaignFunding = $campaignFunding;
     }
-    public function getCampaignFunding() : ?CampaignFunding
+    protected function getCampaignFunding() : ?CampaignFunding
     {
         return $this->campaignFunding;
     }
 }

780) /home/barney/projects/matchbot/src/Domain/FundingWithdrawalRepository.php:26    [M] CastString

--- Original
+++ New
@@ @@
     public function getWithdrawalsTotal(CampaignFunding $campaignFunding) : string
     {
         $qb = $this->getEntityManager()->createQueryBuilder()->select('SUM(fw.amount)')->from(FundingWithdrawal::class, 'fw')->where('fw.campaignFunding = :campaignFunding')->setParameter('campaignFunding', $campaignFunding->getId());
-        $amount = (string) $qb->getQuery()->getSingleScalarResult();
+        $amount = $qb->getQuery()->getSingleScalarResult();
         if ($amount === '') {
             return '0.00';
         }

781) /home/barney/projects/matchbot/src/Domain/FundingWithdrawalRepository.php:28    [M] Identical

--- Original
+++ New
@@ @@
     {
         $qb = $this->getEntityManager()->createQueryBuilder()->select('SUM(fw.amount)')->from(FundingWithdrawal::class, 'fw')->where('fw.campaignFunding = :campaignFunding')->setParameter('campaignFunding', $campaignFunding->getId());
         $amount = (string) $qb->getQuery()->getSingleScalarResult();
-        if ($amount === '') {
+        if ($amount !== '') {
             return '0.00';
         }
         return $amount;
     }
 }

782) /home/barney/projects/matchbot/src/Domain/Model.php:42    [M] Concat

--- Original
+++ New
@@ @@
     }
     public function __toString() : string
     {
-        return "Instance of " . get_class($this);
+        return get_class($this) . "Instance of ";
     }
 }

787) /home/barney/projects/matchbot/src/Domain/SalesforceReadProxyRepository.php:39    [M] Concat

--- Original
+++ New
@@ @@
         // Make sure we update existing object if passed in a partial copy and we already have that Salesforce object
         // persisted, otherwise we'll try to insert a duplicate and get an ORM crash.
         if ($proxy->hasBeenPersisted() && ($existingProxy = $this->findOneBy(['salesforceId' => $proxy->getSalesforceId()]))) {
-            $this->logInfo('Updating ' . get_class($proxy) . ' ' . $proxy->getSalesforceId() . '...');
+            $this->logInfo(get_class($proxy) . 'Updating ' . ' ' . $proxy->getSalesforceId() . '...');
             $proxy = $existingProxy;
         } else {
             $this->logInfo('Creating ' . get_class($proxy) . ' ' . $proxy->getSalesforceId());

788) /home/barney/projects/matchbot/src/Domain/SalesforceReadProxyRepository.php:39    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         // Make sure we update existing object if passed in a partial copy and we already have that Salesforce object
         // persisted, otherwise we'll try to insert a duplicate and get an ORM crash.
         if ($proxy->hasBeenPersisted() && ($existingProxy = $this->findOneBy(['salesforceId' => $proxy->getSalesforceId()]))) {
-            $this->logInfo('Updating ' . get_class($proxy) . ' ' . $proxy->getSalesforceId() . '...');
+            $this->logInfo(get_class($proxy) . ' ' . $proxy->getSalesforceId() . '...');
             $proxy = $existingProxy;
         } else {
             $this->logInfo('Creating ' . get_class($proxy) . ' ' . $proxy->getSalesforceId());

789) /home/barney/projects/matchbot/src/Domain/SalesforceReadProxyRepository.php:39    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         // Make sure we update existing object if passed in a partial copy and we already have that Salesforce object
         // persisted, otherwise we'll try to insert a duplicate and get an ORM crash.
         if ($proxy->hasBeenPersisted() && ($existingProxy = $this->findOneBy(['salesforceId' => $proxy->getSalesforceId()]))) {
-            $this->logInfo('Updating ' . get_class($proxy) . ' ' . $proxy->getSalesforceId() . '...');
+            $this->logInfo('Updating ' . ' ' . $proxy->getSalesforceId() . '...');
             $proxy = $existingProxy;
         } else {
             $this->logInfo('Creating ' . get_class($proxy) . ' ' . $proxy->getSalesforceId());

790) /home/barney/projects/matchbot/src/Domain/SalesforceReadProxyRepository.php:39    [M] Concat

--- Original
+++ New
@@ @@
         // Make sure we update existing object if passed in a partial copy and we already have that Salesforce object
         // persisted, otherwise we'll try to insert a duplicate and get an ORM crash.
         if ($proxy->hasBeenPersisted() && ($existingProxy = $this->findOneBy(['salesforceId' => $proxy->getSalesforceId()]))) {
-            $this->logInfo('Updating ' . get_class($proxy) . ' ' . $proxy->getSalesforceId() . '...');
+            $this->logInfo('Updating ' . ' ' . get_class($proxy) . $proxy->getSalesforceId() . '...');
             $proxy = $existingProxy;
         } else {
             $this->logInfo('Creating ' . get_class($proxy) . ' ' . $proxy->getSalesforceId());

791) /home/barney/projects/matchbot/src/Domain/SalesforceReadProxyRepository.php:39    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         // Make sure we update existing object if passed in a partial copy and we already have that Salesforce object
         // persisted, otherwise we'll try to insert a duplicate and get an ORM crash.
         if ($proxy->hasBeenPersisted() && ($existingProxy = $this->findOneBy(['salesforceId' => $proxy->getSalesforceId()]))) {
-            $this->logInfo('Updating ' . get_class($proxy) . ' ' . $proxy->getSalesforceId() . '...');
+            $this->logInfo('Updating ' . get_class($proxy) . $proxy->getSalesforceId() . '...');
             $proxy = $existingProxy;
         } else {
             $this->logInfo('Creating ' . get_class($proxy) . ' ' . $proxy->getSalesforceId());

792) /home/barney/projects/matchbot/src/Domain/SalesforceReadProxyRepository.php:39    [M] Concat

--- Original
+++ New
@@ @@
         // Make sure we update existing object if passed in a partial copy and we already have that Salesforce object
         // persisted, otherwise we'll try to insert a duplicate and get an ORM crash.
         if ($proxy->hasBeenPersisted() && ($existingProxy = $this->findOneBy(['salesforceId' => $proxy->getSalesforceId()]))) {
-            $this->logInfo('Updating ' . get_class($proxy) . ' ' . $proxy->getSalesforceId() . '...');
+            $this->logInfo('Updating ' . get_class($proxy) . $proxy->getSalesforceId() . ' ' . '...');
             $proxy = $existingProxy;
         } else {
             $this->logInfo('Creating ' . get_class($proxy) . ' ' . $proxy->getSalesforceId());

793) /home/barney/projects/matchbot/src/Domain/SalesforceReadProxyRepository.php:39    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         // Make sure we update existing object if passed in a partial copy and we already have that Salesforce object
         // persisted, otherwise we'll try to insert a duplicate and get an ORM crash.
         if ($proxy->hasBeenPersisted() && ($existingProxy = $this->findOneBy(['salesforceId' => $proxy->getSalesforceId()]))) {
-            $this->logInfo('Updating ' . get_class($proxy) . ' ' . $proxy->getSalesforceId() . '...');
+            $this->logInfo('Updating ' . get_class($proxy) . ' ' . '...');
             $proxy = $existingProxy;
         } else {
             $this->logInfo('Creating ' . get_class($proxy) . ' ' . $proxy->getSalesforceId());

794) /home/barney/projects/matchbot/src/Domain/SalesforceReadProxyRepository.php:39    [M] Concat

--- Original
+++ New
@@ @@
         // Make sure we update existing object if passed in a partial copy and we already have that Salesforce object
         // persisted, otherwise we'll try to insert a duplicate and get an ORM crash.
         if ($proxy->hasBeenPersisted() && ($existingProxy = $this->findOneBy(['salesforceId' => $proxy->getSalesforceId()]))) {
-            $this->logInfo('Updating ' . get_class($proxy) . ' ' . $proxy->getSalesforceId() . '...');
+            $this->logInfo('Updating ' . get_class($proxy) . ' ' . '...' . $proxy->getSalesforceId());
             $proxy = $existingProxy;
         } else {
             $this->logInfo('Creating ' . get_class($proxy) . ' ' . $proxy->getSalesforceId());

795) /home/barney/projects/matchbot/src/Domain/SalesforceReadProxyRepository.php:39    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         // Make sure we update existing object if passed in a partial copy and we already have that Salesforce object
         // persisted, otherwise we'll try to insert a duplicate and get an ORM crash.
         if ($proxy->hasBeenPersisted() && ($existingProxy = $this->findOneBy(['salesforceId' => $proxy->getSalesforceId()]))) {
-            $this->logInfo('Updating ' . get_class($proxy) . ' ' . $proxy->getSalesforceId() . '...');
+            $this->logInfo('Updating ' . get_class($proxy) . ' ' . $proxy->getSalesforceId());
             $proxy = $existingProxy;
         } else {
             $this->logInfo('Creating ' . get_class($proxy) . ' ' . $proxy->getSalesforceId());

796) /home/barney/projects/matchbot/src/Domain/SalesforceReadProxyRepository.php:39    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         // Make sure we update existing object if passed in a partial copy and we already have that Salesforce object
         // persisted, otherwise we'll try to insert a duplicate and get an ORM crash.
         if ($proxy->hasBeenPersisted() && ($existingProxy = $this->findOneBy(['salesforceId' => $proxy->getSalesforceId()]))) {
-            $this->logInfo('Updating ' . get_class($proxy) . ' ' . $proxy->getSalesforceId() . '...');
+            
             $proxy = $existingProxy;
         } else {
             $this->logInfo('Creating ' . get_class($proxy) . ' ' . $proxy->getSalesforceId());

798) /home/barney/projects/matchbot/src/Domain/SalesforceWriteProxyRepository.php:35    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         // This 'pre-`prePush()`' check protects us from trying to save the same Salesforce record twice at once.
         if (!$isNew && $proxy->getSalesforcePushStatus() === SalesforceWriteProxy::PUSH_STATUS_UPDATING) {
-            /**
-             * If we were in the middle of awaiting Salesforce processing of an update
-             * and are asked to push another one, do nothing except flag that this happened.
-             * We can return immediately and then:
-             * * the already in-flight update will finish up by setting the status back to
-             *   'pending-update' instead of 'complete' – see postPush().
-             * * the scheduled PushDonations command will pick up pushing the data on a delay.
-             *   In the rare case that the new update contained different data, it will get
-             *   synced to Salesforce at the point.
-             * @see SalesforceWriteProxyRepository::postPush()
-             * @see PushDonations
-             */
-            $proxy->setSalesforcePushStatus(SalesforceWriteProxy::PUSH_STATUS_PENDING_ADDITIONAL_UPDATE);
+            
             $this->logInfo('Queued extra update for ' . get_class($proxy) . ' ' . $proxy->getId());
             // This is the best we can do in this scenario while awaiting the first Salesforce response,
             // and by returning early we ensure postPush() is not called. So as a summary return value

800) /home/barney/projects/matchbot/src/Domain/SalesforceWriteProxyRepository.php:36    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
              * @see PushDonations
              */
             $proxy->setSalesforcePushStatus(SalesforceWriteProxy::PUSH_STATUS_PENDING_ADDITIONAL_UPDATE);
-            $this->logInfo('Queued extra update for ' . get_class($proxy) . ' ' . $proxy->getId());
+            $this->logInfo(get_class($proxy) . ' ' . $proxy->getId());
             // This is the best we can do in this scenario while awaiting the first Salesforce response,
             // and by returning early we ensure postPush() is not called. So as a summary return value
             // we can safely treat this as successful.

801) /home/barney/projects/matchbot/src/Domain/SalesforceWriteProxyRepository.php:36    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
              * @see PushDonations
              */
             $proxy->setSalesforcePushStatus(SalesforceWriteProxy::PUSH_STATUS_PENDING_ADDITIONAL_UPDATE);
-            $this->logInfo('Queued extra update for ' . get_class($proxy) . ' ' . $proxy->getId());
+            $this->logInfo('Queued extra update for ' . ' ' . $proxy->getId());
             // This is the best we can do in this scenario while awaiting the first Salesforce response,
             // and by returning early we ensure postPush() is not called. So as a summary return value
             // we can safely treat this as successful.

803) /home/barney/projects/matchbot/src/Domain/SalesforceWriteProxyRepository.php:36    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
              * @see PushDonations
              */
             $proxy->setSalesforcePushStatus(SalesforceWriteProxy::PUSH_STATUS_PENDING_ADDITIONAL_UPDATE);
-            $this->logInfo('Queued extra update for ' . get_class($proxy) . ' ' . $proxy->getId());
+            $this->logInfo('Queued extra update for ' . get_class($proxy) . $proxy->getId());
             // This is the best we can do in this scenario while awaiting the first Salesforce response,
             // and by returning early we ensure postPush() is not called. So as a summary return value
             // we can safely treat this as successful.

804) /home/barney/projects/matchbot/src/Domain/SalesforceWriteProxyRepository.php:36    [M] Concat

--- Original
+++ New
@@ @@
              * @see PushDonations
              */
             $proxy->setSalesforcePushStatus(SalesforceWriteProxy::PUSH_STATUS_PENDING_ADDITIONAL_UPDATE);
-            $this->logInfo('Queued extra update for ' . get_class($proxy) . ' ' . $proxy->getId());
+            $this->logInfo('Queued extra update for ' . get_class($proxy) . $proxy->getId() . ' ');
             // This is the best we can do in this scenario while awaiting the first Salesforce response,
             // and by returning early we ensure postPush() is not called. So as a summary return value
             // we can safely treat this as successful.

805) /home/barney/projects/matchbot/src/Domain/SalesforceWriteProxyRepository.php:36    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
              * @see PushDonations
              */
             $proxy->setSalesforcePushStatus(SalesforceWriteProxy::PUSH_STATUS_PENDING_ADDITIONAL_UPDATE);
-            $this->logInfo('Queued extra update for ' . get_class($proxy) . ' ' . $proxy->getId());
+            $this->logInfo('Queued extra update for ' . get_class($proxy) . ' ');
             // This is the best we can do in this scenario while awaiting the first Salesforce response,
             // and by returning early we ensure postPush() is not called. So as a summary return value
             // we can safely treat this as successful.

806) /home/barney/projects/matchbot/src/Domain/SalesforceWriteProxyRepository.php:36    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
              * @see PushDonations
              */
             $proxy->setSalesforcePushStatus(SalesforceWriteProxy::PUSH_STATUS_PENDING_ADDITIONAL_UPDATE);
-            $this->logInfo('Queued extra update for ' . get_class($proxy) . ' ' . $proxy->getId());
+            
             // This is the best we can do in this scenario while awaiting the first Salesforce response,
             // and by returning early we ensure postPush() is not called. So as a summary return value
             // we can safely treat this as successful.

809) /home/barney/projects/matchbot/src/Domain/SalesforceWriteProxyRepository.php:109    [M] IncrementInteger

--- Original
+++ New
@@ @@
      * @param int $limit    Maximum of each type of pending object to process
      * @return int  Number of objects pushed
      */
-    public function pushSalesforcePending(int $limit = 200) : int
+    public function pushSalesforcePending(int $limit = 201) : int
     {
         $proxiesToCreate = $this->findBy(['salesforcePushStatus' => SalesforceWriteProxy::PUSH_STATUS_PENDING_CREATE], ['id' => 'ASC'], $limit);
         foreach ($proxiesToCreate as $proxy) {

811) /home/barney/projects/matchbot/src/Domain/SalesforceWriteProxyRepository.php:112    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
      */
     public function pushSalesforcePending(int $limit = 200) : int
     {
-        $proxiesToCreate = $this->findBy(['salesforcePushStatus' => SalesforceWriteProxy::PUSH_STATUS_PENDING_CREATE], ['id' => 'ASC'], $limit);
+        $proxiesToCreate = $this->findBy([], ['id' => 'ASC'], $limit);
         foreach ($proxiesToCreate as $proxy) {
             $this->push($proxy, true);
         }

812) /home/barney/projects/matchbot/src/Domain/SalesforceWriteProxyRepository.php:113    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
      */
     public function pushSalesforcePending(int $limit = 200) : int
     {
-        $proxiesToCreate = $this->findBy(['salesforcePushStatus' => SalesforceWriteProxy::PUSH_STATUS_PENDING_CREATE], ['id' => 'ASC'], $limit);
+        $proxiesToCreate = $this->findBy(['salesforcePushStatus' => SalesforceWriteProxy::PUSH_STATUS_PENDING_CREATE], [], $limit);
         foreach ($proxiesToCreate as $proxy) {
             $this->push($proxy, true);
         }

813) /home/barney/projects/matchbot/src/Domain/SalesforceWriteProxyRepository.php:117    [M] Foreach_

--- Original
+++ New
@@ @@
     public function pushSalesforcePending(int $limit = 200) : int
     {
         $proxiesToCreate = $this->findBy(['salesforcePushStatus' => SalesforceWriteProxy::PUSH_STATUS_PENDING_CREATE], ['id' => 'ASC'], $limit);
-        foreach ($proxiesToCreate as $proxy) {
+        foreach (array() as $proxy) {
             $this->push($proxy, true);
         }
         $proxiesToUpdate = $this->findBy(['salesforcePushStatus' => SalesforceWriteProxy::PUSH_STATUS_PENDING_UPDATE], ['id' => 'ASC'], $limit);
