816) /home/barney/projects/matchbot/src/Domain/SalesforceWriteProxyRepository.php:122    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         foreach ($proxiesToCreate as $proxy) {
             $this->push($proxy, true);
         }
-        $proxiesToUpdate = $this->findBy(['salesforcePushStatus' => SalesforceWriteProxy::PUSH_STATUS_PENDING_UPDATE], ['id' => 'ASC'], $limit);
+        $proxiesToUpdate = $this->findBy([], ['id' => 'ASC'], $limit);
         foreach ($proxiesToUpdate as $proxy) {
             $this->push($proxy, false);
         }

817) /home/barney/projects/matchbot/src/Domain/SalesforceWriteProxyRepository.php:123    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         foreach ($proxiesToCreate as $proxy) {
             $this->push($proxy, true);
         }
-        $proxiesToUpdate = $this->findBy(['salesforcePushStatus' => SalesforceWriteProxy::PUSH_STATUS_PENDING_UPDATE], ['id' => 'ASC'], $limit);
+        $proxiesToUpdate = $this->findBy(['salesforcePushStatus' => SalesforceWriteProxy::PUSH_STATUS_PENDING_UPDATE], [], $limit);
         foreach ($proxiesToUpdate as $proxy) {
             $this->push($proxy, false);
         }

818) /home/barney/projects/matchbot/src/Domain/SalesforceWriteProxyRepository.php:127    [M] Foreach_

--- Original
+++ New
@@ @@
             $this->push($proxy, true);
         }
         $proxiesToUpdate = $this->findBy(['salesforcePushStatus' => SalesforceWriteProxy::PUSH_STATUS_PENDING_UPDATE], ['id' => 'ASC'], $limit);
-        foreach ($proxiesToUpdate as $proxy) {
+        foreach (array() as $proxy) {
             $this->push($proxy, false);
         }
         return count($proxiesToCreate) + count($proxiesToUpdate);

821) /home/barney/projects/matchbot/src/Domain/SalesforceWriteProxyRepository.php:131    [M] Plus

--- Original
+++ New
@@ @@
         foreach ($proxiesToUpdate as $proxy) {
             $this->push($proxy, false);
         }
-        return count($proxiesToCreate) + count($proxiesToUpdate);
+        return count($proxiesToCreate) - count($proxiesToUpdate);
     }
     protected function prePush(SalesforceWriteProxy $proxy, bool $isNew) : void
     {

822) /home/barney/projects/matchbot/src/Domain/SalesforceWriteProxyRepository.php:152    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         if ($success) {
             $proxy->setSalesforceLastPush(new DateTime('now'));
             if ($proxy->getSalesforcePushStatus() === SalesforceWriteProxy::PUSH_STATUS_PENDING_CREATE && $proxy->hasPostCreateUpdates()) {
-                $proxy->setSalesforcePushStatus(SalesforceWriteProxy::PUSH_STATUS_PENDING_UPDATE);
+                
                 $shouldRePush = true;
             } elseif ($proxy->getSalesforcePushStatus() === SalesforceWriteProxy::PUSH_STATUS_PENDING_ADDITIONAL_UPDATE) {
                 $proxy->setSalesforcePushStatus(SalesforceWriteProxy::PUSH_STATUS_PENDING_UPDATE);

824) /home/barney/projects/matchbot/src/Domain/SalesforceWriteProxyRepository.php:158    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
                 $proxy->setSalesforcePushStatus(SalesforceWriteProxy::PUSH_STATUS_PENDING_UPDATE);
                 $shouldRePush = true;
             } elseif ($proxy->getSalesforcePushStatus() === SalesforceWriteProxy::PUSH_STATUS_PENDING_ADDITIONAL_UPDATE) {
-                $proxy->setSalesforcePushStatus(SalesforceWriteProxy::PUSH_STATUS_PENDING_UPDATE);
+                
                 $this->logInfo(sprintf('... marking for additional later push %s %d: SF ID %s', get_class($proxy), $proxy->getId(), $proxy->getSalesforceId()));
             } else {
                 $proxy->setSalesforcePushStatus(SalesforceWriteProxy::PUSH_STATUS_COMPLETE);

825) /home/barney/projects/matchbot/src/Domain/SalesforceWriteProxyRepository.php:159    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
                 $shouldRePush = true;
             } elseif ($proxy->getSalesforcePushStatus() === SalesforceWriteProxy::PUSH_STATUS_PENDING_ADDITIONAL_UPDATE) {
                 $proxy->setSalesforcePushStatus(SalesforceWriteProxy::PUSH_STATUS_PENDING_UPDATE);
-                $this->logInfo(sprintf('... marking for additional later push %s %d: SF ID %s', get_class($proxy), $proxy->getId(), $proxy->getSalesforceId()));
+                
             } else {
                 $proxy->setSalesforcePushStatus(SalesforceWriteProxy::PUSH_STATUS_COMPLETE);
             }

826) /home/barney/projects/matchbot/src/Domain/SalesforceWriteProxyRepository.php:172    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             $this->logInfo('... pushed ' . get_class($proxy) . " {$proxy->getId()}: SF ID {$proxy->getSalesforceId()}");
             if ($shouldRePush) {
                 if ($this->doUpdate($proxy)) {
-                    // Make sure *not* to call push() again to avoid doing this recursively!
-                    $proxy->setSalesforcePushStatus(SalesforceWriteProxy::PUSH_STATUS_COMPLETE);
+                    
                     $this->logInfo('... plus interim updates for ' . get_class($proxy) . " {$proxy->getId()}");
                 } else {
                     $proxy->setSalesforcePushStatus(SalesforceWriteProxy::PUSH_STATUS_PENDING_UPDATE);

827) /home/barney/projects/matchbot/src/Domain/SalesforceWriteProxyRepository.php:173    [M] Concat

--- Original
+++ New
@@ @@
                 if ($this->doUpdate($proxy)) {
                     // Make sure *not* to call push() again to avoid doing this recursively!
                     $proxy->setSalesforcePushStatus(SalesforceWriteProxy::PUSH_STATUS_COMPLETE);
-                    $this->logInfo('... plus interim updates for ' . get_class($proxy) . " {$proxy->getId()}");
+                    $this->logInfo(get_class($proxy) . '... plus interim updates for ' . " {$proxy->getId()}");
                 } else {
                     $proxy->setSalesforcePushStatus(SalesforceWriteProxy::PUSH_STATUS_PENDING_UPDATE);
                     $this->logError(sprintf('... with error on interim updates for %s %d', get_class($proxy), $proxy->getId()));

828) /home/barney/projects/matchbot/src/Domain/SalesforceWriteProxyRepository.php:173    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
                 if ($this->doUpdate($proxy)) {
                     // Make sure *not* to call push() again to avoid doing this recursively!
                     $proxy->setSalesforcePushStatus(SalesforceWriteProxy::PUSH_STATUS_COMPLETE);
-                    $this->logInfo('... plus interim updates for ' . get_class($proxy) . " {$proxy->getId()}");
+                    $this->logInfo(get_class($proxy) . " {$proxy->getId()}");
                 } else {
                     $proxy->setSalesforcePushStatus(SalesforceWriteProxy::PUSH_STATUS_PENDING_UPDATE);
                     $this->logError(sprintf('... with error on interim updates for %s %d', get_class($proxy), $proxy->getId()));

831) /home/barney/projects/matchbot/src/Domain/SalesforceWriteProxyRepository.php:173    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
                 if ($this->doUpdate($proxy)) {
                     // Make sure *not* to call push() again to avoid doing this recursively!
                     $proxy->setSalesforcePushStatus(SalesforceWriteProxy::PUSH_STATUS_COMPLETE);
-                    $this->logInfo('... plus interim updates for ' . get_class($proxy) . " {$proxy->getId()}");
+                    $this->logInfo('... plus interim updates for ' . get_class($proxy));
                 } else {
                     $proxy->setSalesforcePushStatus(SalesforceWriteProxy::PUSH_STATUS_PENDING_UPDATE);
                     $this->logError(sprintf('... with error on interim updates for %s %d', get_class($proxy), $proxy->getId()));

832) /home/barney/projects/matchbot/src/Domain/SalesforceWriteProxyRepository.php:173    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
                 if ($this->doUpdate($proxy)) {
                     // Make sure *not* to call push() again to avoid doing this recursively!
                     $proxy->setSalesforcePushStatus(SalesforceWriteProxy::PUSH_STATUS_COMPLETE);
-                    $this->logInfo('... plus interim updates for ' . get_class($proxy) . " {$proxy->getId()}");
+                    
                 } else {
                     $proxy->setSalesforcePushStatus(SalesforceWriteProxy::PUSH_STATUS_PENDING_UPDATE);
                     $this->logError(sprintf('... with error on interim updates for %s %d', get_class($proxy), $proxy->getId()));

836) /home/barney/projects/matchbot/src/Migrations/Version20191109151808.php:23    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     }
     public function up(Schema $schema) : void
     {
-        // this up() migration is auto-generated, please modify it to your needs
-        $this->abortIf($this->connection->getDatabasePlatform()->getName() !== 'mysql', 'Migration can only be executed safely on \'mysql\'.');
+

844) /home/barney/projects/matchbot/src/Migrations/Version20191109151808.php:32    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
-        $this->addSql('ALTER TABLE Campaign ADD CONSTRAINT FK_E663708BF5C97E37 FOREIGN KEY (charity_id) REFERENCES Charity (id)');
+        
         $this->addSql('ALTER TABLE FundingWithdrawal ADD CONSTRAINT FK_5C8EAC124DC1279C FOREIGN KEY (donation_id) REFERENCES Donation (id)');
         $this->addSql('ALTER TABLE CampaignFunding ADD CONSTRAINT FK_B00548FA25A38F89 FOREIGN KEY (fund_id) REFERENCES Fund (id)');
         $this->addSql('ALTER TABLE Campaign_CampaignFunding ADD CONSTRAINT FK_3364399584C3B9E4 FOREIGN KEY (campaignfunding_id) REFERENCES CampaignFunding (id)');

851) /home/barney/projects/matchbot/src/Migrations/Version20191109151808.php:43    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     }
     public function down(Schema $schema) : void
     {
-        // this down() migration is auto-generated, please modify it to your needs
-        $this->abortIf($this->connection->getDatabasePlatform()->getName() !== 'mysql', 'Migration can only be executed safely on \'mysql\'.');
+        
         $this->addSql('ALTER TABLE Campaign DROP FOREIGN KEY FK_E663708BF5C97E37');
         $this->addSql('ALTER TABLE Campaign_CampaignFunding DROP FOREIGN KEY FK_33643995F639F774');
         $this->addSql('ALTER TABLE Donation DROP FOREIGN KEY FK_C893E3F6F639F774');

852) /home/barney/projects/matchbot/src/Migrations/Version20191109151808.php:45    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         // this down() migration is auto-generated, please modify it to your needs
         $this->abortIf($this->connection->getDatabasePlatform()->getName() !== 'mysql', 'Migration can only be executed safely on \'mysql\'.');
-        $this->addSql('ALTER TABLE Campaign DROP FOREIGN KEY FK_E663708BF5C97E37');
+        
         $this->addSql('ALTER TABLE Campaign_CampaignFunding DROP FOREIGN KEY FK_33643995F639F774');
         $this->addSql('ALTER TABLE Donation DROP FOREIGN KEY FK_C893E3F6F639F774');
         $this->addSql('ALTER TABLE CampaignFunding DROP FOREIGN KEY FK_B00548FA25A38F89');

867) /home/barney/projects/matchbot/src/Migrations/Version20191109215947.php:25    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         // this up() migration is auto-generated, please modify it to your needs
         $this->abortIf($this->connection->getDatabasePlatform()->getName() !== 'mysql', 'Migration can only be executed safely on \'mysql\'.');
-        $this->addSql('ALTER TABLE Charity ADD donateLinkId VARCHAR(255) NOT NULL');
+        
     }
     public function down(Schema $schema) : void
     {

870) /home/barney/projects/matchbot/src/Migrations/Version20191109215947.php:33    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         // this down() migration is auto-generated, please modify it to your needs
         $this->abortIf($this->connection->getDatabasePlatform()->getName() !== 'mysql', 'Migration can only be executed safely on \'mysql\'.');
-        $this->addSql('ALTER TABLE Charity DROP donateLinkId');
+        
     }
 }

873) /home/barney/projects/matchbot/src/Migrations/Version20191110112409.php:25    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         // this up() migration is auto-generated, please modify it to your needs
         $this->abortIf($this->connection->getDatabasePlatform()->getName() !== 'mysql', 'Migration can only be executed safely on \'mysql\'.');
-        $this->addSql('ALTER TABLE FundingWithdrawal ADD campaignFunding_id INT UNSIGNED DEFAULT NULL');
+        
         $this->addSql('ALTER TABLE FundingWithdrawal ADD CONSTRAINT FK_5C8EAC12CB9EBA34 FOREIGN KEY (campaignFunding_id) REFERENCES CampaignFunding (id)');
         $this->addSql('CREATE INDEX IDX_5C8EAC12CB9EBA34 ON FundingWithdrawal (campaignFunding_id)');
     }

878) /home/barney/projects/matchbot/src/Migrations/Version20191110112409.php:35    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         // this down() migration is auto-generated, please modify it to your needs
         $this->abortIf($this->connection->getDatabasePlatform()->getName() !== 'mysql', 'Migration can only be executed safely on \'mysql\'.');
-        $this->addSql('ALTER TABLE FundingWithdrawal DROP FOREIGN KEY FK_5C8EAC12CB9EBA34');
+        
         $this->addSql('DROP INDEX IDX_5C8EAC12CB9EBA34 ON FundingWithdrawal');
         $this->addSql('ALTER TABLE FundingWithdrawal DROP campaignFunding_id');
     }
 }

883) /home/barney/projects/matchbot/src/Migrations/Version20191110121708.php:25    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         // this up() migration is auto-generated, please modify it to your needs
         $this->abortIf($this->connection->getDatabasePlatform()->getName() !== 'mysql', 'Migration can only be executed safely on \'mysql\'.');
-        $this->addSql('ALTER TABLE Donation DROP donorTitle');
+        
     }
     public function down(Schema $schema) : void
     {

886) /home/barney/projects/matchbot/src/Migrations/Version20191110121708.php:33    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         // this down() migration is auto-generated, please modify it to your needs
         $this->abortIf($this->connection->getDatabasePlatform()->getName() !== 'mysql', 'Migration can only be executed safely on \'mysql\'.');
-        $this->addSql('ALTER TABLE Donation ADD donorTitle VARCHAR(255) CHARACTER SET utf8mb4 DEFAULT NULL COLLATE `utf8mb4_unicode_ci`');
+        
     }
 }

889) /home/barney/projects/matchbot/src/Migrations/Version20191110162524.php:25    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         // this up() migration is auto-generated, please modify it to your needs
         $this->abortIf($this->connection->getDatabasePlatform()->getName() !== 'mysql', 'Migration can only be executed safely on \'mysql\'.');
-        $this->addSql('CREATE TABLE CommandLockKeys (key_id VARCHAR(64) NOT NULL, key_token VARCHAR(44) NOT NULL, key_expiration INT UNSIGNED NOT NULL, PRIMARY KEY(key_id)) DEFAULT CHARACTER SET utf8mb4 COLLATE `utf8mb4_bin` ENGINE = InnoDB');
+        
     }
     public function down(Schema $schema) : void
     {

892) /home/barney/projects/matchbot/src/Migrations/Version20191110162524.php:33    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         // this down() migration is auto-generated, please modify it to your needs
         $this->abortIf($this->connection->getDatabasePlatform()->getName() !== 'mysql', 'Migration can only be executed safely on \'mysql\'.');
-        $this->addSql('DROP TABLE CommandLockKeys');
+        
     }
 }

895) /home/barney/projects/matchbot/src/Migrations/Version20191113083835.php:24    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function up(Schema $schema) : void
     {
         $this->abortIf($this->connection->getDatabasePlatform()->getName() !== 'mysql', 'Migration can only be executed safely on \'mysql\'.');
-        $this->addSql('CREATE INDEX available_fundings ON CampaignFunding (amountAvailable, allocationOrder, id)');
+        
         $this->addSql('CREATE INDEX date_and_status ON Donation (createdAt, donationStatus)');
         $this->addSql('CREATE INDEX salesforcePushStatus ON Donation (salesforcePushStatus)');
     }

900) /home/barney/projects/matchbot/src/Migrations/Version20191113083835.php:33    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function down(Schema $schema) : void
     {
         $this->abortIf($this->connection->getDatabasePlatform()->getName() !== 'mysql', 'Migration can only be executed safely on \'mysql\'.');
-        $this->addSql('DROP INDEX available_fundings ON CampaignFunding');
+        
         $this->addSql('DROP INDEX date_and_status ON Donation');
         $this->addSql('DROP INDEX salesforcePushStatus ON Donation');
     }
 }

905) /home/barney/projects/matchbot/src/Migrations/Version20191119154404.php:24    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function up(Schema $schema) : void
     {
         $this->abortIf($this->connection->getDatabasePlatform()->getName() !== 'mysql', 'Migration can only be executed safely on \'mysql\'.');
-        $this->addSql("ALTER TABLE Donation ADD tipAmount NUMERIC(18, 2) DEFAULT '0.00' NOT NULL");
+        
     }
     public function down(Schema $schema) : void
     {

908) /home/barney/projects/matchbot/src/Migrations/Version20191119154404.php:32    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         // this down() migration is auto-generated, please modify it to your needs
         $this->abortIf($this->connection->getDatabasePlatform()->getName() !== 'mysql', 'Migration can only be executed safely on \'mysql\'.');
-        $this->addSql('ALTER TABLE Donation DROP tipAmount');
+        
     }
 }

911) /home/barney/projects/matchbot/src/Migrations/Version20191126051351.php:24    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function up(Schema $schema) : void
     {
         $this->abortIf($this->connection->getDatabasePlatform()->getName() !== 'mysql', 'Migration can only be executed safely on \'mysql\'.');
-        $this->addSql('ALTER TABLE Donation CHANGE tipAmount tipAmount NUMERIC(18, 2) NOT NULL');
+        
     }
     public function down(Schema $schema) : void
     {

914) /home/barney/projects/matchbot/src/Migrations/Version20191126051351.php:31    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function down(Schema $schema) : void
     {
         $this->abortIf($this->connection->getDatabasePlatform()->getName() !== 'mysql', 'Migration can only be executed safely on \'mysql\'.');
-        $this->addSql('ALTER TABLE Donation CHANGE tipAmount tipAmount NUMERIC(18, 2) DEFAULT \'0.00\' NOT NULL');
+        
     }
 }

917) /home/barney/projects/matchbot/src/Migrations/Version20200713104818.php:26    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function up(Schema $schema) : void
     {
         $this->abortIf($this->connection->getDatabasePlatform()->getName() !== 'mysql', 'Migration can only be executed safely on \'mysql\'.');
-        // Migration modified to first set up existing donations with
-        // psp = 'enthuse'
-        $this->addSql("ALTER TABLE Donation ADD psp VARCHAR(20) DEFAULT 'enthuse', ADD clientSecret VARCHAR(255) DEFAULT NULL");
+        
         // Once this change is done, remove the psp default and make psp
         // non-nullable going forward.
         $this->addSql('ALTER TABLE Donation CHANGE psp psp VARCHAR(20) NOT NULL');

918) /home/barney/projects/matchbot/src/Migrations/Version20200713104818.php:30    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         // Migration modified to first set up existing donations with
         // psp = 'enthuse'
         $this->addSql("ALTER TABLE Donation ADD psp VARCHAR(20) DEFAULT 'enthuse', ADD clientSecret VARCHAR(255) DEFAULT NULL");
-        // Once this change is done, remove the psp default and make psp
-        // non-nullable going forward.
-        $this->addSql('ALTER TABLE Donation CHANGE psp psp VARCHAR(20) NOT NULL');
+        
     }
     public function down(Schema $schema) : void
     {

921) /home/barney/projects/matchbot/src/Migrations/Version20200713104818.php:37    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function down(Schema $schema) : void
     {
         $this->abortIf($this->connection->getDatabasePlatform()->getName() !== 'mysql', 'Migration can only be executed safely on \'mysql\'.');
-        $this->addSql('ALTER TABLE Donation DROP psp, DROP clientSecret');
+        
     }
 }

924) /home/barney/projects/matchbot/src/Migrations/Version20200720102604.php:24    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function up(Schema $schema) : void
     {
         $this->abortIf($this->connection->getDatabasePlatform()->getName() !== 'mysql', 'Migration can only be executed safely on \'mysql\'.');
-        $this->addSql('ALTER TABLE Charity ADD stripeAccountId VARCHAR(255) DEFAULT NULL');
+        
         $this->addSql('CREATE UNIQUE INDEX UNIQ_4CC08E8293A8A818 ON Charity (stripeAccountId)');
     }
     public function down(Schema $schema) : void

928) /home/barney/projects/matchbot/src/Migrations/Version20200720102604.php:32    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function down(Schema $schema) : void
     {
         $this->abortIf($this->connection->getDatabasePlatform()->getName() !== 'mysql', 'Migration can only be executed safely on \'mysql\'.');
-        $this->addSql('DROP INDEX UNIQ_4CC08E8293A8A818 ON Charity');
+        
         $this->addSql('ALTER TABLE Charity DROP stripeAccountId');
     }
 }

932) /home/barney/projects/matchbot/src/Migrations/Version20200804150108.php:24    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function up(Schema $schema) : void
     {
         $this->abortIf($this->connection->getDatabasePlatform()->getName() !== 'mysql', 'Migration can only be executed safely on \'mysql\'.');
-        $this->addSql('ALTER TABLE Donation CHANGE charityComms charityComms TINYINT(1) DEFAULT NULL, CHANGE giftAid giftAid TINYINT(1) DEFAULT NULL, CHANGE tbgComms tbgComms TINYINT(1) DEFAULT NULL');
+        
     }
     public function down(Schema $schema) : void
     {

935) /home/barney/projects/matchbot/src/Migrations/Version20200804150108.php:31    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function down(Schema $schema) : void
     {
         $this->abortIf($this->connection->getDatabasePlatform()->getName() !== 'mysql', 'Migration can only be executed safely on \'mysql\'.');
-        $this->addSql('ALTER TABLE Donation CHANGE charityComms charityComms TINYINT(1) NOT NULL, CHANGE giftAid giftAid TINYINT(1) NOT NULL, CHANGE tbgComms tbgComms TINYINT(1) NOT NULL');
+        
     }
 }

938) /home/barney/projects/matchbot/src/Migrations/Version20200804164545.php:24    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function up(Schema $schema) : void
     {
         $this->abortIf($this->connection->getDatabasePlatform()->getName() !== 'mysql', 'Migration can only be executed safely on \'mysql\'.');
-        $this->addSql('ALTER TABLE Donation ADD donorHomeAddressLine1 VARCHAR(255) DEFAULT NULL, ADD donorHomePostcode VARCHAR(255) DEFAULT NULL, ADD tipGiftAid TINYINT(1) DEFAULT NULL');
+        
         $this->addSql('UPDATE Donation SET tipGiftAid = giftAid WHERE tipGiftAid IS NULL');
     }
     public function down(Schema $schema) : void

942) /home/barney/projects/matchbot/src/Migrations/Version20200804164545.php:32    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function down(Schema $schema) : void
     {
         $this->abortIf($this->connection->getDatabasePlatform()->getName() !== 'mysql', 'Migration can only be executed safely on \'mysql\'.');
-        $this->addSql('ALTER TABLE Donation DROP donorHomeAddressLine1, DROP donorHomePostcode, DROP tipGiftAid');
+        
     }
 }

945) /home/barney/projects/matchbot/src/Migrations/Version20200826135513.php:24    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function up(Schema $schema) : void
     {
         $this->abortIf($this->connection->getDatabasePlatform()->getName() !== 'mysql', 'Migration can only be executed safely on \'mysql\'.');
-        $this->addSql('ALTER TABLE Donation ADD chargeId VARCHAR(255) DEFAULT NULL');
+        
         $this->addSql('CREATE UNIQUE INDEX UNIQ_C893E3F6402C829F ON Donation (chargeId)');
     }
     public function down(Schema $schema) : void

949) /home/barney/projects/matchbot/src/Migrations/Version20200826135513.php:32    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function down(Schema $schema) : void
     {
         $this->abortIf($this->connection->getDatabasePlatform()->getName() !== 'mysql', 'Migration can only be executed safely on \'mysql\'.');
-        $this->addSql('DROP INDEX UNIQ_C893E3F6402C829F ON Donation');
+        
         $this->addSql('ALTER TABLE Donation DROP chargeId');
     }
 }

953) /home/barney/projects/matchbot/src/Migrations/Version20200925104750.php:25    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         // this up() migration is auto-generated, please modify it to your needs
         $this->abortIf($this->connection->getDatabasePlatform()->getName() !== 'mysql', 'Migration can only be executed safely on \'mysql\'.');
-        $this->addSql('ALTER TABLE Donation ADD championComms TINYINT(1) DEFAULT NULL');
+        
     }
     public function down(Schema $schema) : void
     {

956) /home/barney/projects/matchbot/src/Migrations/Version20200925104750.php:33    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         // this down() migration is auto-generated, please modify it to your needs
         $this->abortIf($this->connection->getDatabasePlatform()->getName() !== 'mysql', 'Migration can only be executed safely on \'mysql\'.');
-        $this->addSql('ALTER TABLE Donation DROP championComms');
+        
     }
 }

974) /home/barney/projects/matchbot/src/Migrations/Version20201119104427.php:25    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         // this up() migration is auto-generated, please modify it to your needs
         $this->abortIf($this->connection->getDatabasePlatform()->getName() !== 'mysql', 'Migration can only be executed safely on \'mysql\'.');
-        $this->addSql('ALTER TABLE Donation ADD charityFee NUMERIC(18, 2) NOT NULL');
+        
     }
     public function down(Schema $schema) : void
     {

977) /home/barney/projects/matchbot/src/Migrations/Version20201119104427.php:33    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         // this down() migration is auto-generated, please modify it to your needs
         $this->abortIf($this->connection->getDatabasePlatform()->getName() !== 'mysql', 'Migration can only be executed safely on \'mysql\'.');
-        $this->addSql('ALTER TABLE Donation DROP charityFee');
+        
     }
 }

991) /home/barney/projects/matchbot/src/Migrations/Version20210122113600.php:24    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function up(Schema $schema) : void
     {
         $this->abortIf($this->connection->getDatabasePlatform()->getName() !== 'mysql', 'Migration can only be executed safely on \'mysql\'.');
-        $this->addSql('ALTER TABLE Donation ADD charityFeeVat NUMERIC(18, 2) NOT NULL');
+        
     }
     public function down(Schema $schema) : void
     {

994) /home/barney/projects/matchbot/src/Migrations/Version20210122113600.php:31    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function down(Schema $schema) : void
     {
         $this->abortIf($this->connection->getDatabasePlatform()->getName() !== 'mysql', 'Migration can only be executed safely on \'mysql\'.');
-        $this->addSql('ALTER TABLE Donation DROP charityFeeVat');
+        
     }
 }

997) /home/barney/projects/matchbot/src/Migrations/Version20210311133325.php:24    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function up(Schema $schema) : void
     {
         $this->abortIf($this->connection->getDatabasePlatform()->getName() !== 'mysql', 'Migration can only be executed safely on \'mysql\'.');
-        $this->addSql('ALTER TABLE Donation ADD originalPspFee NUMERIC(18, 2) NOT NULL');
+        
     }
     public function down(Schema $schema) : void
     {

1000) /home/barney/projects/matchbot/src/Migrations/Version20210311133325.php:31    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function down(Schema $schema) : void
     {
         $this->abortIf($this->connection->getDatabasePlatform()->getName() !== 'mysql', 'Migration can only be executed safely on \'mysql\'.');
-        $this->addSql('ALTER TABLE Donation DROP originalPspFee');
+        
     }
 }

1003) /home/barney/projects/matchbot/src/Migrations/Version20210408183019.php:25    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function up(Schema $schema) : void
     {
         $this->abortIf($this->connection->getDatabasePlatform()->getName() !== 'mysql', 'Migration can only be executed safely on \'mysql\'.');
-        // Migration modified to first set up existing data with currencyCode 'GBP'.
-        $this->addSql('ALTER TABLE Campaign ADD currencyCode VARCHAR(3) NOT NULL DEFAULT \'GBP\'');
+        
         $this->addSql('ALTER TABLE CampaignFunding ADD currencyCode VARCHAR(3) NOT NULL DEFAULT \'GBP\'');
         $this->addSql('ALTER TABLE Donation ADD currencyCode VARCHAR(3) NOT NULL DEFAULT \'GBP\'');
         $this->addSql('ALTER TABLE Fund ADD currencyCode VARCHAR(3) NOT NULL DEFAULT \'GBP\'');
