1007) /home/barney/projects/matchbot/src/Migrations/Version20210408183019.php:31    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $this->addSql('ALTER TABLE CampaignFunding ADD currencyCode VARCHAR(3) NOT NULL DEFAULT \'GBP\'');
         $this->addSql('ALTER TABLE Donation ADD currencyCode VARCHAR(3) NOT NULL DEFAULT \'GBP\'');
         $this->addSql('ALTER TABLE Fund ADD currencyCode VARCHAR(3) NOT NULL DEFAULT \'GBP\'');
-        // Once this change is done, remove the defaults.
-        $this->addSql('ALTER TABLE Campaign CHANGE currencyCode currencyCode VARCHAR(3) NOT NULL');
+        
         $this->addSql('ALTER TABLE CampaignFunding CHANGE currencyCode currencyCode VARCHAR(3) NOT NULL');
         $this->addSql('ALTER TABLE Donation CHANGE currencyCode currencyCode VARCHAR(3) NOT NULL');
         $this->addSql('ALTER TABLE Fund CHANGE currencyCode currencyCode VARCHAR(3) NOT NULL');

1013) /home/barney/projects/matchbot/src/Migrations/Version20210408183019.php:41    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function down(Schema $schema) : void
     {
         $this->abortIf($this->connection->getDatabasePlatform()->getName() !== 'mysql', 'Migration can only be executed safely on \'mysql\'.');
-        $this->addSql('ALTER TABLE Campaign DROP currencyCode');
+        
         $this->addSql('ALTER TABLE CampaignFunding DROP currencyCode');
         $this->addSql('ALTER TABLE Donation DROP currencyCode');
         $this->addSql('ALTER TABLE Fund DROP currencyCode');
     }
 }

1019) /home/barney/projects/matchbot/src/Migrations/Version20210422163630.php:24    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function up(Schema $schema) : void
     {
         $this->abortIf($this->connection->getDatabasePlatform()->getName() !== 'mysql', 'Migration can only be executed safely on \'mysql\'.');
-        $this->addSql('ALTER TABLE Campaign ADD feePercentage NUMERIC(3, 1) DEFAULT NULL');
+        
     }
     public function down(Schema $schema) : void
     {

1022) /home/barney/projects/matchbot/src/Migrations/Version20210422163630.php:31    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function down(Schema $schema) : void
     {
         $this->abortIf($this->connection->getDatabasePlatform()->getName() !== 'mysql', 'Migration can only be executed safely on \'mysql\'.');
-        $this->addSql('ALTER TABLE Campaign DROP feePercentage');
+        
     }
 }

1025) /home/barney/projects/matchbot/src/Migrations/Version20210907103000.php:24    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function up(Schema $schema) : void
     {
         $this->abortIf($this->connection->getDatabasePlatform()->getName() !== 'mysql', 'Migration can only be executed safely on \'mysql\'.');
-        $this->addSql("ALTER TABLE Donation ADD feeCoverAmount NUMERIC(18, 2) DEFAULT '0.00' NOT NULL");
+        
     }
     public function down(Schema $schema) : void
     {

1028) /home/barney/projects/matchbot/src/Migrations/Version20210907103000.php:31    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function down(Schema $schema) : void
     {
         $this->abortIf($this->connection->getDatabasePlatform()->getName() !== 'mysql', 'Migration can only be executed safely on \'mysql\'.');
-        $this->addSql('ALTER TABLE Donation DROP feeCoverAmount');
+        
     }
 }

1031) /home/barney/projects/matchbot/src/Migrations/Version20210907110200.php:26    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function up(Schema $schema) : void
     {
         $this->abortIf($this->connection->getDatabasePlatform()->getName() !== 'mysql', 'Migration can only be executed safely on \'mysql\'.');
-        $this->addSql('ALTER TABLE Donation CHANGE feeCoverAmount feeCoverAmount NUMERIC(18, 2) NOT NULL');
+        
     }
     public function down(Schema $schema) : void
     {

1034) /home/barney/projects/matchbot/src/Migrations/Version20210907110200.php:33    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function down(Schema $schema) : void
     {
         $this->abortIf($this->connection->getDatabasePlatform()->getName() !== 'mysql', 'Migration can only be executed safely on \'mysql\'.');
-        $this->addSql('ALTER TABLE Donation CHANGE feeCoverAmount feeCoverAmount NUMERIC(18, 2) DEFAULT \'0.00\' NOT NULL');
+        
     }
 }

1037) /home/barney/projects/matchbot/src/Migrations/Version20211029152640.php:24    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function up(Schema $schema) : void
     {
         $this->abortIf($this->connection->getDatabasePlatform()->getName() !== 'mysql', 'Migration can only be executed safely on \'mysql\'.');
-        $this->addSql('ALTER TABLE Donation ADD collectedAt DATETIME NOT NULL, ADD tbgShouldProcessGiftAid TINYINT(1) DEFAULT NULL, ADD tbgGiftAidRequestQueuedAt TINYINT(1) DEFAULT NULL, ADD tbgGiftAidRequestFailedAt TINYINT(1) DEFAULT NULL');
+        
         // Set new collectedAt field to the best guess we have at roughly when the donation was completed by
         // the donor – this will be up to a few minutes before the real time for pre-existing donations.
         $this->addSql("UPDATE Donation SET collectedAt = createdAt WHERE collectedAt IS NULL AND (donationStatus IN ('Collected', 'Paid'))");

1038) /home/barney/projects/matchbot/src/Migrations/Version20211029152640.php:28    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         $this->abortIf($this->connection->getDatabasePlatform()->getName() !== 'mysql', 'Migration can only be executed safely on \'mysql\'.');
         $this->addSql('ALTER TABLE Donation ADD collectedAt DATETIME NOT NULL, ADD tbgShouldProcessGiftAid TINYINT(1) DEFAULT NULL, ADD tbgGiftAidRequestQueuedAt TINYINT(1) DEFAULT NULL, ADD tbgGiftAidRequestFailedAt TINYINT(1) DEFAULT NULL');
-        // Set new collectedAt field to the best guess we have at roughly when the donation was completed by
-        // the donor – this will be up to a few minutes before the real time for pre-existing donations.
-        $this->addSql("UPDATE Donation SET collectedAt = createdAt WHERE collectedAt IS NULL AND (donationStatus IN ('Collected', 'Paid'))");
+        
     }
     public function down(Schema $schema) : void
     {

1041) /home/barney/projects/matchbot/src/Migrations/Version20211029152640.php:35    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function down(Schema $schema) : void
     {
         $this->abortIf($this->connection->getDatabasePlatform()->getName() !== 'mysql', 'Migration can only be executed safely on \'mysql\'.');
-        $this->addSql('ALTER TABLE Donation DROP collectedAt, DROP tbgShouldProcessGiftAid, DROP tbgGiftAidRequestQueuedAt, DROP tbgGiftAidRequestFailedAt');
+        
     }
 }

1044) /home/barney/projects/matchbot/src/Migrations/Version20211029163214.php:24    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function up(Schema $schema) : void
     {
         $this->abortIf($this->connection->getDatabasePlatform()->getName() !== 'mysql', 'Migration can only be executed safely on \'mysql\'.');
-        $this->addSql('ALTER TABLE Charity ADD hmrcReferenceNumber VARCHAR(7) DEFAULT NULL, ADD tbgClaimingGiftAid TINYINT(1) DEFAULT NULL');
+        
         $this->addSql('CREATE UNIQUE INDEX UNIQ_4CC08E829EF7853B ON Charity (hmrcReferenceNumber)');
         // Set a non-null value for existing charities, without adding a schema `DEFAULT`.
         $this->addSql('UPDATE Charity SET tbgClaimingGiftAid = 0 WHERE tbgClaimingGiftAid IS NULL');

1046) /home/barney/projects/matchbot/src/Migrations/Version20211029163214.php:28    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $this->abortIf($this->connection->getDatabasePlatform()->getName() !== 'mysql', 'Migration can only be executed safely on \'mysql\'.');
         $this->addSql('ALTER TABLE Charity ADD hmrcReferenceNumber VARCHAR(7) DEFAULT NULL, ADD tbgClaimingGiftAid TINYINT(1) DEFAULT NULL');
         $this->addSql('CREATE UNIQUE INDEX UNIQ_4CC08E829EF7853B ON Charity (hmrcReferenceNumber)');
-        // Set a non-null value for existing charities, without adding a schema `DEFAULT`.
-        $this->addSql('UPDATE Charity SET tbgClaimingGiftAid = 0 WHERE tbgClaimingGiftAid IS NULL');
+        
     }
     public function down(Schema $schema) : void
     {

1049) /home/barney/projects/matchbot/src/Migrations/Version20211029163214.php:35    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function down(Schema $schema) : void
     {
         $this->abortIf($this->connection->getDatabasePlatform()->getName() !== 'mysql', 'Migration can only be executed safely on \'mysql\'.');
-        $this->addSql('DROP INDEX UNIQ_4CC08E829EF7853B ON Charity');
+        
         $this->addSql('ALTER TABLE Charity DROP hmrcReferenceNumber, DROP tbgClaimingGiftAid');
     }
 }

1053) /home/barney/projects/matchbot/src/Migrations/Version20211029164148.php:24    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function up(Schema $schema) : void
     {
         $this->abortIf($this->connection->getDatabasePlatform()->getName() !== 'mysql', 'Migration can only be executed safely on \'mysql\'.');
-        $this->addSql('ALTER TABLE Charity CHANGE tbgClaimingGiftAid tbgClaimingGiftAid TINYINT(1) NOT NULL');
+        
     }
     public function down(Schema $schema) : void
     {

1056) /home/barney/projects/matchbot/src/Migrations/Version20211029164148.php:31    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function down(Schema $schema) : void
     {
         $this->abortIf($this->connection->getDatabasePlatform()->getName() !== 'mysql', 'Migration can only be executed safely on \'mysql\'.');
-        $this->addSql('ALTER TABLE Charity CHANGE tbgClaimingGiftAid tbgClaimingGiftAid TINYINT(1) DEFAULT NULL');
+        
     }
 }

1059) /home/barney/projects/matchbot/src/Migrations/Version20211029225612.php:24    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function up(Schema $schema) : void
     {
         $this->abortIf($this->connection->getDatabasePlatform()->getName() !== 'mysql', 'Migration can only be executed safely on \'mysql\'.');
-        $this->addSql('ALTER TABLE Donation CHANGE collectedAt collectedAt DATETIME DEFAULT NULL');
+        
     }
     public function down(Schema $schema) : void
     {

1062) /home/barney/projects/matchbot/src/Migrations/Version20211029225612.php:31    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function down(Schema $schema) : void
     {
         $this->abortIf($this->connection->getDatabasePlatform()->getName() !== 'mysql', 'Migration can only be executed safely on \'mysql\'.');
-        $this->addSql('ALTER TABLE Donation CHANGE collectedAt collectedAt DATETIME NOT NULL');
+        
     }
 }

1071) /home/barney/projects/matchbot/src/Migrations/Version20220104121300.php:31    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
 WHERE uuid = :uuid AND transactionId = :paymentIntentId
 LIMIT 1
 EOT;
-        $this->addSql($updateIncorrectPostcode, ['uuid' => '4f6804a9-6e2c-46de-9cb4-6bc59c380f90', 'paymentIntentId' => 'pi_3K2RMiKkGuKkxwBN0S5Uy9mP']);
+        $this->addSql($updateIncorrectPostcode, ['paymentIntentId' => 'pi_3K2RMiKkGuKkxwBN0S5Uy9mP']);
         $this->addSql($updateIncorrectPostcode, ['uuid' => 'd957f281-d71b-45ba-8593-cf12f9203d5b', 'paymentIntentId' => 'pi_3K2YigKkGuKkxwBN0re3gWSI']);
         $updateDonorGAIncorrectlyClaimed = <<<EOT
 UPDATE Donation

1072) /home/barney/projects/matchbot/src/Migrations/Version20220104121300.php:31    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
 WHERE uuid = :uuid AND transactionId = :paymentIntentId
 LIMIT 1
 EOT;
-        $this->addSql($updateIncorrectPostcode, ['uuid' => '4f6804a9-6e2c-46de-9cb4-6bc59c380f90', 'paymentIntentId' => 'pi_3K2RMiKkGuKkxwBN0S5Uy9mP']);
+        
         $this->addSql($updateIncorrectPostcode, ['uuid' => 'd957f281-d71b-45ba-8593-cf12f9203d5b', 'paymentIntentId' => 'pi_3K2YigKkGuKkxwBN0re3gWSI']);
         $updateDonorGAIncorrectlyClaimed = <<<EOT
 UPDATE Donation

1073) /home/barney/projects/matchbot/src/Migrations/Version20220104121300.php:35    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
 LIMIT 1
 EOT;
         $this->addSql($updateIncorrectPostcode, ['uuid' => '4f6804a9-6e2c-46de-9cb4-6bc59c380f90', 'paymentIntentId' => 'pi_3K2RMiKkGuKkxwBN0S5Uy9mP']);
-        $this->addSql($updateIncorrectPostcode, ['uuid' => 'd957f281-d71b-45ba-8593-cf12f9203d5b', 'paymentIntentId' => 'pi_3K2YigKkGuKkxwBN0re3gWSI']);
+        $this->addSql($updateIncorrectPostcode, ['paymentIntentId' => 'pi_3K2YigKkGuKkxwBN0re3gWSI']);
         $updateDonorGAIncorrectlyClaimed = <<<EOT
 UPDATE Donation
 SET salesforcePushStatus = 'pending-update', giftAid = 0, tipGiftAid = 0,

1074) /home/barney/projects/matchbot/src/Migrations/Version20220104121300.php:35    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
 LIMIT 1
 EOT;
         $this->addSql($updateIncorrectPostcode, ['uuid' => '4f6804a9-6e2c-46de-9cb4-6bc59c380f90', 'paymentIntentId' => 'pi_3K2RMiKkGuKkxwBN0S5Uy9mP']);
-        $this->addSql($updateIncorrectPostcode, ['uuid' => 'd957f281-d71b-45ba-8593-cf12f9203d5b', 'paymentIntentId' => 'pi_3K2YigKkGuKkxwBN0re3gWSI']);
+        
         $updateDonorGAIncorrectlyClaimed = <<<EOT
 UPDATE Donation
 SET salesforcePushStatus = 'pending-update', giftAid = 0, tipGiftAid = 0,

1075) /home/barney/projects/matchbot/src/Migrations/Version20220104121300.php:48    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
 WHERE uuid = :uuid AND transactionId = :paymentIntentId
 LIMIT 1
 EOT;
-        $this->addSql($updateDonorGAIncorrectlyClaimed, ['uuid' => 'b07e5700-ab97-4fd8-99d7-33c3fd5f0666', 'paymentIntentId' => 'pi_3K2DQDKkGuKkxwBN0rEMw2oz']);
+        $this->addSql($updateDonorGAIncorrectlyClaimed, ['paymentIntentId' => 'pi_3K2DQDKkGuKkxwBN0rEMw2oz']);
         $this->addSql($updateDonorGAIncorrectlyClaimed, ['uuid' => 'bd7a0b27-bddf-4728-9e39-facc0f6b4172', 'paymentIntentId' => 'pi_3K3d9dKkGuKkxwBN1Dlln6TX']);
         $this->addSql($updateDonorGAIncorrectlyClaimed, ['uuid' => 'fe2c6084-61bc-4d65-b510-95cce859dc24', 'paymentIntentId' => 'pi_3K1WhbKkGuKkxwBN0hXKeHh1']);
         $this->addSql($updateDonorGAIncorrectlyClaimed, ['uuid' => '5495a028-742e-4d71-9392-4a3cb722f595', 'paymentIntentId' => 'pi_3K3i7MKkGuKkxwBN1WWThUP3']);

1076) /home/barney/projects/matchbot/src/Migrations/Version20220104121300.php:48    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
 WHERE uuid = :uuid AND transactionId = :paymentIntentId
 LIMIT 1
 EOT;
-        $this->addSql($updateDonorGAIncorrectlyClaimed, ['uuid' => 'b07e5700-ab97-4fd8-99d7-33c3fd5f0666', 'paymentIntentId' => 'pi_3K2DQDKkGuKkxwBN0rEMw2oz']);
+        
         $this->addSql($updateDonorGAIncorrectlyClaimed, ['uuid' => 'bd7a0b27-bddf-4728-9e39-facc0f6b4172', 'paymentIntentId' => 'pi_3K3d9dKkGuKkxwBN1Dlln6TX']);
         $this->addSql($updateDonorGAIncorrectlyClaimed, ['uuid' => 'fe2c6084-61bc-4d65-b510-95cce859dc24', 'paymentIntentId' => 'pi_3K1WhbKkGuKkxwBN0hXKeHh1']);
         $this->addSql($updateDonorGAIncorrectlyClaimed, ['uuid' => '5495a028-742e-4d71-9392-4a3cb722f595', 'paymentIntentId' => 'pi_3K3i7MKkGuKkxwBN1WWThUP3']);

1077) /home/barney/projects/matchbot/src/Migrations/Version20220104121300.php:52    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
 LIMIT 1
 EOT;
         $this->addSql($updateDonorGAIncorrectlyClaimed, ['uuid' => 'b07e5700-ab97-4fd8-99d7-33c3fd5f0666', 'paymentIntentId' => 'pi_3K2DQDKkGuKkxwBN0rEMw2oz']);
-        $this->addSql($updateDonorGAIncorrectlyClaimed, ['uuid' => 'bd7a0b27-bddf-4728-9e39-facc0f6b4172', 'paymentIntentId' => 'pi_3K3d9dKkGuKkxwBN1Dlln6TX']);
+        $this->addSql($updateDonorGAIncorrectlyClaimed, ['paymentIntentId' => 'pi_3K3d9dKkGuKkxwBN1Dlln6TX']);
         $this->addSql($updateDonorGAIncorrectlyClaimed, ['uuid' => 'fe2c6084-61bc-4d65-b510-95cce859dc24', 'paymentIntentId' => 'pi_3K1WhbKkGuKkxwBN0hXKeHh1']);
         $this->addSql($updateDonorGAIncorrectlyClaimed, ['uuid' => '5495a028-742e-4d71-9392-4a3cb722f595', 'paymentIntentId' => 'pi_3K3i7MKkGuKkxwBN1WWThUP3']);
         $this->addSql($updateDonorGAIncorrectlyClaimed, ['uuid' => '3f79c7ef-d6d1-406f-a2c8-80e006d17312', 'paymentIntentId' => 'pi_3K2YdQKkGuKkxwBN1SJh1OKF']);

1078) /home/barney/projects/matchbot/src/Migrations/Version20220104121300.php:52    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
 LIMIT 1
 EOT;
         $this->addSql($updateDonorGAIncorrectlyClaimed, ['uuid' => 'b07e5700-ab97-4fd8-99d7-33c3fd5f0666', 'paymentIntentId' => 'pi_3K2DQDKkGuKkxwBN0rEMw2oz']);
-        $this->addSql($updateDonorGAIncorrectlyClaimed, ['uuid' => 'bd7a0b27-bddf-4728-9e39-facc0f6b4172', 'paymentIntentId' => 'pi_3K3d9dKkGuKkxwBN1Dlln6TX']);
+        
         $this->addSql($updateDonorGAIncorrectlyClaimed, ['uuid' => 'fe2c6084-61bc-4d65-b510-95cce859dc24', 'paymentIntentId' => 'pi_3K1WhbKkGuKkxwBN0hXKeHh1']);
         $this->addSql($updateDonorGAIncorrectlyClaimed, ['uuid' => '5495a028-742e-4d71-9392-4a3cb722f595', 'paymentIntentId' => 'pi_3K3i7MKkGuKkxwBN1WWThUP3']);
         $this->addSql($updateDonorGAIncorrectlyClaimed, ['uuid' => '3f79c7ef-d6d1-406f-a2c8-80e006d17312', 'paymentIntentId' => 'pi_3K2YdQKkGuKkxwBN1SJh1OKF']);

1079) /home/barney/projects/matchbot/src/Migrations/Version20220104121300.php:56    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
 EOT;
         $this->addSql($updateDonorGAIncorrectlyClaimed, ['uuid' => 'b07e5700-ab97-4fd8-99d7-33c3fd5f0666', 'paymentIntentId' => 'pi_3K2DQDKkGuKkxwBN0rEMw2oz']);
         $this->addSql($updateDonorGAIncorrectlyClaimed, ['uuid' => 'bd7a0b27-bddf-4728-9e39-facc0f6b4172', 'paymentIntentId' => 'pi_3K3d9dKkGuKkxwBN1Dlln6TX']);
-        $this->addSql($updateDonorGAIncorrectlyClaimed, ['uuid' => 'fe2c6084-61bc-4d65-b510-95cce859dc24', 'paymentIntentId' => 'pi_3K1WhbKkGuKkxwBN0hXKeHh1']);
+        $this->addSql($updateDonorGAIncorrectlyClaimed, ['paymentIntentId' => 'pi_3K1WhbKkGuKkxwBN0hXKeHh1']);
         $this->addSql($updateDonorGAIncorrectlyClaimed, ['uuid' => '5495a028-742e-4d71-9392-4a3cb722f595', 'paymentIntentId' => 'pi_3K3i7MKkGuKkxwBN1WWThUP3']);
         $this->addSql($updateDonorGAIncorrectlyClaimed, ['uuid' => '3f79c7ef-d6d1-406f-a2c8-80e006d17312', 'paymentIntentId' => 'pi_3K2YdQKkGuKkxwBN1SJh1OKF']);
     }

1080) /home/barney/projects/matchbot/src/Migrations/Version20220104121300.php:56    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
 EOT;
         $this->addSql($updateDonorGAIncorrectlyClaimed, ['uuid' => 'b07e5700-ab97-4fd8-99d7-33c3fd5f0666', 'paymentIntentId' => 'pi_3K2DQDKkGuKkxwBN0rEMw2oz']);
         $this->addSql($updateDonorGAIncorrectlyClaimed, ['uuid' => 'bd7a0b27-bddf-4728-9e39-facc0f6b4172', 'paymentIntentId' => 'pi_3K3d9dKkGuKkxwBN1Dlln6TX']);
-        $this->addSql($updateDonorGAIncorrectlyClaimed, ['uuid' => 'fe2c6084-61bc-4d65-b510-95cce859dc24', 'paymentIntentId' => 'pi_3K1WhbKkGuKkxwBN0hXKeHh1']);
+        
         $this->addSql($updateDonorGAIncorrectlyClaimed, ['uuid' => '5495a028-742e-4d71-9392-4a3cb722f595', 'paymentIntentId' => 'pi_3K3i7MKkGuKkxwBN1WWThUP3']);
         $this->addSql($updateDonorGAIncorrectlyClaimed, ['uuid' => '3f79c7ef-d6d1-406f-a2c8-80e006d17312', 'paymentIntentId' => 'pi_3K2YdQKkGuKkxwBN1SJh1OKF']);
     }

1081) /home/barney/projects/matchbot/src/Migrations/Version20220104121300.php:60    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         $this->addSql($updateDonorGAIncorrectlyClaimed, ['uuid' => 'b07e5700-ab97-4fd8-99d7-33c3fd5f0666', 'paymentIntentId' => 'pi_3K2DQDKkGuKkxwBN0rEMw2oz']);
         $this->addSql($updateDonorGAIncorrectlyClaimed, ['uuid' => 'bd7a0b27-bddf-4728-9e39-facc0f6b4172', 'paymentIntentId' => 'pi_3K3d9dKkGuKkxwBN1Dlln6TX']);
         $this->addSql($updateDonorGAIncorrectlyClaimed, ['uuid' => 'fe2c6084-61bc-4d65-b510-95cce859dc24', 'paymentIntentId' => 'pi_3K1WhbKkGuKkxwBN0hXKeHh1']);
-        $this->addSql($updateDonorGAIncorrectlyClaimed, ['uuid' => '5495a028-742e-4d71-9392-4a3cb722f595', 'paymentIntentId' => 'pi_3K3i7MKkGuKkxwBN1WWThUP3']);
+        $this->addSql($updateDonorGAIncorrectlyClaimed, ['paymentIntentId' => 'pi_3K3i7MKkGuKkxwBN1WWThUP3']);
         $this->addSql($updateDonorGAIncorrectlyClaimed, ['uuid' => '3f79c7ef-d6d1-406f-a2c8-80e006d17312', 'paymentIntentId' => 'pi_3K2YdQKkGuKkxwBN1SJh1OKF']);
     }
     public function down(Schema $schema) : void

1082) /home/barney/projects/matchbot/src/Migrations/Version20220104121300.php:60    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $this->addSql($updateDonorGAIncorrectlyClaimed, ['uuid' => 'b07e5700-ab97-4fd8-99d7-33c3fd5f0666', 'paymentIntentId' => 'pi_3K2DQDKkGuKkxwBN0rEMw2oz']);
         $this->addSql($updateDonorGAIncorrectlyClaimed, ['uuid' => 'bd7a0b27-bddf-4728-9e39-facc0f6b4172', 'paymentIntentId' => 'pi_3K3d9dKkGuKkxwBN1Dlln6TX']);
         $this->addSql($updateDonorGAIncorrectlyClaimed, ['uuid' => 'fe2c6084-61bc-4d65-b510-95cce859dc24', 'paymentIntentId' => 'pi_3K1WhbKkGuKkxwBN0hXKeHh1']);
-        $this->addSql($updateDonorGAIncorrectlyClaimed, ['uuid' => '5495a028-742e-4d71-9392-4a3cb722f595', 'paymentIntentId' => 'pi_3K3i7MKkGuKkxwBN1WWThUP3']);
+        
         $this->addSql($updateDonorGAIncorrectlyClaimed, ['uuid' => '3f79c7ef-d6d1-406f-a2c8-80e006d17312', 'paymentIntentId' => 'pi_3K2YdQKkGuKkxwBN1SJh1OKF']);
     }
     public function down(Schema $schema) : void

1083) /home/barney/projects/matchbot/src/Migrations/Version20220104121300.php:64    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         $this->addSql($updateDonorGAIncorrectlyClaimed, ['uuid' => 'bd7a0b27-bddf-4728-9e39-facc0f6b4172', 'paymentIntentId' => 'pi_3K3d9dKkGuKkxwBN1Dlln6TX']);
         $this->addSql($updateDonorGAIncorrectlyClaimed, ['uuid' => 'fe2c6084-61bc-4d65-b510-95cce859dc24', 'paymentIntentId' => 'pi_3K1WhbKkGuKkxwBN0hXKeHh1']);
         $this->addSql($updateDonorGAIncorrectlyClaimed, ['uuid' => '5495a028-742e-4d71-9392-4a3cb722f595', 'paymentIntentId' => 'pi_3K3i7MKkGuKkxwBN1WWThUP3']);
-        $this->addSql($updateDonorGAIncorrectlyClaimed, ['uuid' => '3f79c7ef-d6d1-406f-a2c8-80e006d17312', 'paymentIntentId' => 'pi_3K2YdQKkGuKkxwBN1SJh1OKF']);
+        $this->addSql($updateDonorGAIncorrectlyClaimed, ['paymentIntentId' => 'pi_3K2YdQKkGuKkxwBN1SJh1OKF']);
     }
     public function down(Schema $schema) : void
     {

1084) /home/barney/projects/matchbot/src/Migrations/Version20220104121300.php:64    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $this->addSql($updateDonorGAIncorrectlyClaimed, ['uuid' => 'bd7a0b27-bddf-4728-9e39-facc0f6b4172', 'paymentIntentId' => 'pi_3K3d9dKkGuKkxwBN1Dlln6TX']);
         $this->addSql($updateDonorGAIncorrectlyClaimed, ['uuid' => 'fe2c6084-61bc-4d65-b510-95cce859dc24', 'paymentIntentId' => 'pi_3K1WhbKkGuKkxwBN0hXKeHh1']);
         $this->addSql($updateDonorGAIncorrectlyClaimed, ['uuid' => '5495a028-742e-4d71-9392-4a3cb722f595', 'paymentIntentId' => 'pi_3K3i7MKkGuKkxwBN1WWThUP3']);
-        $this->addSql($updateDonorGAIncorrectlyClaimed, ['uuid' => '3f79c7ef-d6d1-406f-a2c8-80e006d17312', 'paymentIntentId' => 'pi_3K2YdQKkGuKkxwBN1SJh1OKF']);
+        
     }
     public function down(Schema $schema) : void
     {

1089) /home/barney/projects/matchbot/src/Migrations/Version20220104135535.php:24    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function up(Schema $schema) : void
     {
         $this->abortIf($this->connection->getDatabasePlatform()->getName() !== 'mysql', 'Migration can only be executed safely on \'mysql\'.');
-        $this->addSql('ALTER TABLE Donation ADD transferId VARCHAR(255) DEFAULT NULL');
+        
         $this->addSql('CREATE UNIQUE INDEX UNIQ_C893E3F6AE9826DA ON Donation (transferId)');
     }
     public function down(Schema $schema) : void

1093) /home/barney/projects/matchbot/src/Migrations/Version20220104135535.php:32    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function down(Schema $schema) : void
     {
         $this->abortIf($this->connection->getDatabasePlatform()->getName() !== 'mysql', 'Migration can only be executed safely on \'mysql\'.');
-        $this->addSql('DROP INDEX UNIQ_C893E3F6AE9826DA ON Donation');
+        
         $this->addSql('ALTER TABLE Donation DROP transferId');
     }
 }

1095) /home/barney/projects/matchbot/src/Migrations/Version20220107173738.php:22    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     }
     public function up(Schema $schema) : void
     {
-        $this->addSql('ALTER TABLE Donation CHANGE tbgGiftAidRequestQueuedAt tbgGiftAidRequestQueuedAt DATETIME DEFAULT NULL, CHANGE tbgGiftAidRequestFailedAt tbgGiftAidRequestFailedAt DATETIME DEFAULT NULL');
+        
     }
     public function down(Schema $schema) : void
     {

1096) /home/barney/projects/matchbot/src/Migrations/Version20220107173738.php:27    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     }
     public function down(Schema $schema) : void
     {
-        $this->addSql('ALTER TABLE Donation CHANGE tbgGiftAidRequestQueuedAt tbgGiftAidRequestQueuedAt TINYINT(1) DEFAULT NULL, CHANGE tbgGiftAidRequestFailedAt tbgGiftAidRequestFailedAt TINYINT(1) DEFAULT NULL');
+        
     }
 }

1099) /home/barney/projects/matchbot/src/Migrations/Version20220201161400.php:24    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function up(Schema $schema) : void
     {
         $this->abortIf($this->connection->getDatabasePlatform()->getName() !== 'mysql', 'Migration can only be executed safely on \'mysql\'.');
-        $this->addSql('UPDATE Donation SET tbgGiftAidRequestQueuedAt = NULL WHERE tbgGiftAidRequestQueuedAt IS NOT NULL');
+        
     }
     public function down(Schema $schema) : void
     {

1105) /home/barney/projects/matchbot/src/Migrations/Version20220308132408.php:23    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function up(Schema $schema) : void
     {
         $campaignId = 3076;
-        $this->addSql('DELETE FROM Donation WHERE uuid = :uuid AND campaign_id = :campaignId LIMIT 1', ['campaignId' => $campaignId, 'uuid' => '846b5692-4ccb-4e88-9cf3-ea0223951ee7']);
+        
         $this->addSql('DELETE FROM Campaign WHERE id = :campaignId AND salesforceId = :salesforceId LIMIT 1', ['campaignId' => $campaignId, 'salesforceId' => 'a0569000029jOkUAAU']);
     }
     public function down(Schema $schema) : void

1106) /home/barney/projects/matchbot/src/Migrations/Version20220308132408.php:25    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     public function up(Schema $schema) : void
     {
         $campaignId = 3076;
-        $this->addSql('DELETE FROM Donation WHERE uuid = :uuid AND campaign_id = :campaignId LIMIT 1', ['campaignId' => $campaignId, 'uuid' => '846b5692-4ccb-4e88-9cf3-ea0223951ee7']);
+        $this->addSql('DELETE FROM Donation WHERE uuid = :uuid AND campaign_id = :campaignId LIMIT 1', ['uuid' => '846b5692-4ccb-4e88-9cf3-ea0223951ee7']);
         $this->addSql('DELETE FROM Campaign WHERE id = :campaignId AND salesforceId = :salesforceId LIMIT 1', ['campaignId' => $campaignId, 'salesforceId' => 'a0569000029jOkUAAU']);
     }
     public function down(Schema $schema) : void

1107) /home/barney/projects/matchbot/src/Migrations/Version20220308132408.php:30    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         $campaignId = 3076;
         $this->addSql('DELETE FROM Donation WHERE uuid = :uuid AND campaign_id = :campaignId LIMIT 1', ['campaignId' => $campaignId, 'uuid' => '846b5692-4ccb-4e88-9cf3-ea0223951ee7']);
-        $this->addSql('DELETE FROM Campaign WHERE id = :campaignId AND salesforceId = :salesforceId LIMIT 1', ['campaignId' => $campaignId, 'salesforceId' => 'a0569000029jOkUAAU']);
+        
     }
     public function down(Schema $schema) : void
     {

1108) /home/barney/projects/matchbot/src/Migrations/Version20220308132408.php:32    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     {
         $campaignId = 3076;
         $this->addSql('DELETE FROM Donation WHERE uuid = :uuid AND campaign_id = :campaignId LIMIT 1', ['campaignId' => $campaignId, 'uuid' => '846b5692-4ccb-4e88-9cf3-ea0223951ee7']);
-        $this->addSql('DELETE FROM Campaign WHERE id = :campaignId AND salesforceId = :salesforceId LIMIT 1', ['campaignId' => $campaignId, 'salesforceId' => 'a0569000029jOkUAAU']);
+        $this->addSql('DELETE FROM Campaign WHERE id = :campaignId AND salesforceId = :salesforceId LIMIT 1', ['salesforceId' => 'a0569000029jOkUAAU']);
     }
     public function down(Schema $schema) : void
     {

1110) /home/barney/projects/matchbot/src/Migrations/Version20220402132026.php:22    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     }
     public function up(Schema $schema) : void
     {
-        $this->addSql('ALTER TABLE Donation ADD tbgGiftAidRequestConfirmedCompleteAt DATETIME DEFAULT NULL, ADD tbgGiftAidRequestCorrelationId VARCHAR(255) DEFAULT NULL, ADD tbgGiftAidResponseDetail TEXT DEFAULT NULL');
+        
     }
     public function down(Schema $schema) : void
     {
