1116) /home/barney/projects/matchbot/src/Migrations/Version20220404153900.php:36    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function up(Schema $schema) : void
     {
-        $this->addSql(
-            <<<EOT
-UPDATE Donation
-SET
-    tbgGiftAidRequestConfirmedCompleteAt = NOW(),
-    tbgGiftAidRequestCorrelationId = :correlationId,
-    tbgGiftAidResponseDetail = :responseDetail
-WHERE
-    tbgGiftAidRequestQueuedAt IS NOT NULL AND
-    tbgGiftAidRequestConfirmedCompleteAt IS NULL AND
-    tbgGiftAidRequestCorrelationId IS NULL AND
-    uuid IN (:completeUuids)
-LIMIT 10
-EOT
-,
-            ['correlationId' => '6DB2614C26324981B0CB34C19FE6FF00', 'responseDetail' => 'Thank you for your submission', 'completeUuids' => $donationIdsClaimed],
-            // https://stackoverflow.com/a/36710894/2803757
-            ['correlationId' => \PDO::PARAM_STR, 'responseDetail' => \PDO::PARAM_STR, 'completeUuids' => Connection::PARAM_STR_ARRAY]
-        );
+        
         $this->addSQL(
             <<<EOT
 UPDATE Donation

1117) /home/barney/projects/matchbot/src/Migrations/Version20220404153900.php:49    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
 LIMIT 10
 EOT
 ,
-            ['correlationId' => '6DB2614C26324981B0CB34C19FE6FF00', 'responseDetail' => 'Thank you for your submission', 'completeUuids' => $donationIdsClaimed],
+            ['responseDetail' => 'Thank you for your submission', 'completeUuids' => $donationIdsClaimed],
             // https://stackoverflow.com/a/36710894/2803757
             ['correlationId' => \PDO::PARAM_STR, 'responseDetail' => \PDO::PARAM_STR, 'completeUuids' => Connection::PARAM_STR_ARRAY]
         );

1118) /home/barney/projects/matchbot/src/Migrations/Version20220404153900.php:55    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
 ,
             ['correlationId' => '6DB2614C26324981B0CB34C19FE6FF00', 'responseDetail' => 'Thank you for your submission', 'completeUuids' => $donationIdsClaimed],
             // https://stackoverflow.com/a/36710894/2803757
-            ['correlationId' => \PDO::PARAM_STR, 'responseDetail' => \PDO::PARAM_STR, 'completeUuids' => Connection::PARAM_STR_ARRAY]
+            ['responseDetail' => \PDO::PARAM_STR, 'completeUuids' => Connection::PARAM_STR_ARRAY]
         );
         $this->addSQL(
             <<<EOT

1119) /home/barney/projects/matchbot/src/Migrations/Version20220404153900.php:62    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             // https://stackoverflow.com/a/36710894/2803757
             ['correlationId' => \PDO::PARAM_STR, 'responseDetail' => \PDO::PARAM_STR, 'completeUuids' => Connection::PARAM_STR_ARRAY]
         );
-        $this->addSQL(
-            <<<EOT
-UPDATE Donation
-SET tbgGiftAidRequestQueuedAt = NULL
-WHERE
-    tbgGiftAidRequestQueuedAt IS NOT NULL AND
-    tbgGiftAidRequestConfirmedCompleteAt IS NULL AND
-    tbgGiftAidRequestCorrelationId IS NULL AND
-    uuid NOT IN (:completeUuids)
-LIMIT 10
-EOT
-,
-            ['completeUuids' => $donationIdsClaimed],
-            // https://stackoverflow.com/a/36710894/2803757
-            ['completeUuids' => Connection::PARAM_STR_ARRAY]
-        );
+        
     }
     public function down(Schema $schema) : void
     {

1120) /home/barney/projects/matchbot/src/Migrations/Version20220404153900.php:72    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
 LIMIT 10
 EOT
 ,
-            ['completeUuids' => $donationIdsClaimed],
+            [],
             // https://stackoverflow.com/a/36710894/2803757
             ['completeUuids' => Connection::PARAM_STR_ARRAY]
         );

1121) /home/barney/projects/matchbot/src/Migrations/Version20220404153900.php:76    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
 ,
             ['completeUuids' => $donationIdsClaimed],
             // https://stackoverflow.com/a/36710894/2803757
-            ['completeUuids' => Connection::PARAM_STR_ARRAY]
+            []
         );
     }
     public function down(Schema $schema) : void

1124) /home/barney/projects/matchbot/src/Migrations/Version20220404165640.php:51    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $responseDetail = 'Thank you for your submission';
-        $this->addSql(
-            <<<EOT
-UPDATE Donation
-SET
-    tbgGiftAidRequestConfirmedCompleteAt = NOW(),
-    tbgGiftAidRequestCorrelationId = :correlationId,
-    tbgGiftAidResponseDetail = :responseDetail
-WHERE
-    tbgGiftAidRequestQueuedAt IS NOT NULL AND
-    tbgGiftAidRequestConfirmedCompleteAt IS NULL AND
-    tbgGiftAidRequestCorrelationId IS NULL AND
-    uuid IN (:completeUuids)
-LIMIT 10
-EOT
-,
-            ['correlationId' => $correlationId, 'responseDetail' => $responseDetail, 'completeUuids' => $donationIdsClaimed],
-            // https://stackoverflow.com/a/36710894/2803757
-            ['correlationId' => \PDO::PARAM_STR, 'responseDetail' => \PDO::PARAM_STR, 'completeUuids' => Connection::PARAM_STR_ARRAY]
-        );
+        
         $this->addSQL(
             <<<EOT
 UPDATE Donation

1125) /home/barney/projects/matchbot/src/Migrations/Version20220404165640.php:64    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
 LIMIT 10
 EOT
 ,
-            ['correlationId' => $correlationId, 'responseDetail' => $responseDetail, 'completeUuids' => $donationIdsClaimed],
+            ['responseDetail' => $responseDetail, 'completeUuids' => $donationIdsClaimed],
             // https://stackoverflow.com/a/36710894/2803757
             ['correlationId' => \PDO::PARAM_STR, 'responseDetail' => \PDO::PARAM_STR, 'completeUuids' => Connection::PARAM_STR_ARRAY]
         );

1127) /home/barney/projects/matchbot/src/Migrations/Version20220404165640.php:77    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             // https://stackoverflow.com/a/36710894/2803757
             ['correlationId' => \PDO::PARAM_STR, 'responseDetail' => \PDO::PARAM_STR, 'completeUuids' => Connection::PARAM_STR_ARRAY]
         );
-        $this->addSQL(
-            <<<EOT
-UPDATE Donation
-SET tbgGiftAidRequestQueuedAt = NULL
-WHERE
-    tbgGiftAidRequestQueuedAt IS NOT NULL AND
-    tbgGiftAidRequestConfirmedCompleteAt IS NULL AND
-    tbgGiftAidRequestCorrelationId IS NULL AND
-    uuid IN (:notCompleteUuids)
-LIMIT 10
-EOT
-,
-            ['notCompleteUuids' => $donationIdsQueuedAndNotClaimed],
-            // https://stackoverflow.com/a/36710894/2803757
-            ['notCompleteUuids' => Connection::PARAM_STR_ARRAY]
-        );
+        
     }
     public function down(Schema $schema) : void
     {

1128) /home/barney/projects/matchbot/src/Migrations/Version20220404165640.php:87    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
 LIMIT 10
 EOT
 ,
-            ['notCompleteUuids' => $donationIdsQueuedAndNotClaimed],
+            [],
             // https://stackoverflow.com/a/36710894/2803757
             ['notCompleteUuids' => Connection::PARAM_STR_ARRAY]
         );

1129) /home/barney/projects/matchbot/src/Migrations/Version20220404165640.php:91    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
 ,
             ['notCompleteUuids' => $donationIdsQueuedAndNotClaimed],
             // https://stackoverflow.com/a/36710894/2803757
-            ['notCompleteUuids' => Connection::PARAM_STR_ARRAY]
+            []
         );
     }
     public function down(Schema $schema) : void

1130) /home/barney/projects/matchbot/src/Migrations/Version20220406113351.php:22    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     }
     public function up(Schema $schema) : void
     {
-        $this->addSql(<<<EOT
-UPDATE Donation
-SET tbgGiftAidRequestQueuedAt = NULL, tbgGiftAidRequestFailedAt = NULL
-WHERE
-      tbgGiftAidRequestQueuedAt IS NOT NULL AND
-      tbgGiftAidRequestConfirmedCompleteAt IS NULL
-LIMIT 543
-EOT
-);
+        
     }
     public function down(Schema $schema) : void
     {

1133) /home/barney/projects/matchbot/src/Migrations/Version20220421090453.php:22    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     }
     public function up(Schema $schema) : void
     {
-        $this->addSql(<<<EOT
-UPDATE Donation
-SET
-    tbgGiftAidRequestQueuedAt = NULL,
-    tbgGiftAidRequestFailedAt = NULL,
-    tbgGiftAidRequestConfirmedCompleteAt = NULL,
-    tbgGiftAidRequestCorrelationId = NULL,
-    tbgGiftAidResponseDetail = NULL
-WHERE
-    tbgGiftAidRequestQueuedAt IS NOT NULL
-    AND tbgGiftAidRequestQueuedAt < '2022-04-21 00:00:00'
-EOT
-);
+        
     }
     public function down(Schema $schema) : void
     {

1134) /home/barney/projects/matchbot/src/Migrations/Version20220421121601.php:22    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     }
     public function up(Schema $schema) : void
     {
-        $this->addSql(<<<EOT
-UPDATE Donation
-SET
-    tbgGiftAidRequestQueuedAt = NULL,
-    tbgGiftAidRequestFailedAt = NULL,
-    tbgGiftAidRequestConfirmedCompleteAt = NULL,
-    tbgGiftAidRequestCorrelationId = NULL,
-    tbgGiftAidResponseDetail = NULL
-WHERE
-    tbgGiftAidRequestQueuedAt IS NOT NULL
-    AND tbgGiftAidRequestQueuedAt > '2022-04-21 00:00:00'
-    AND tbgGiftAidRequestQueuedAt < '2022-04-21 15:00:00'
-    AND tbgGiftAidRequestConfirmedCompleteAt IS NULL
-EOT
-);
+        
         // Only reset things queued today (21 April) up to 16:00 BST.
     }
     public function down(Schema $schema) : void

1135) /home/barney/projects/matchbot/src/Migrations/Version20220503091108.php:22    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     }
     public function up(Schema $schema) : void
     {
-        $this->addSql(<<<EOT
-            UPDATE Donation SET giftAid = 0, tipGiftAid = 0, salesforcePushStatus = 'pending-update'
-            WHERE uuid = :uuid AND salesforceId = :salesforceId AND giftAid = 1
-            LIMIT 1
-EOT
-, ['uuid' => 'b8fed725-70b2-41f7-aa65-803bbff89632', 'salesforceId' => 'a066900001uHRJzAAO']);
+        
     }
     public function down(Schema $schema) : void
     {

1136) /home/barney/projects/matchbot/src/Migrations/Version20220503091108.php:27    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
             WHERE uuid = :uuid AND salesforceId = :salesforceId AND giftAid = 1
             LIMIT 1
 EOT
-, ['uuid' => 'b8fed725-70b2-41f7-aa65-803bbff89632', 'salesforceId' => 'a066900001uHRJzAAO']);
+, ['salesforceId' => 'a066900001uHRJzAAO']);
     }
     public function down(Schema $schema) : void
     {

1137) /home/barney/projects/matchbot/src/Migrations/Version20220531094925.php:26    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     }
     public function up(Schema $schema) : void
     {
-        // MAT-246.
-        $this->addSql(<<<EOT
-            UPDATE Donation SET tbgShouldProcessGiftAid = 0
-            WHERE campaign_id = :campaignId AND
-                  giftAid = 1 AND
-                  tbgShouldProcessGiftAid = 1
-            LIMIT 76
-EOT
-, ['campaignId' => 3016]);
+        
         // MAT-250. 25 donations to the affected charity not fully processed.
         $this->addSql(
             <<<EOT

1138) /home/barney/projects/matchbot/src/Migrations/Version20220531094925.php:33    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
                   tbgShouldProcessGiftAid = 1
             LIMIT 76
 EOT
-, ['campaignId' => 3016]);
+, []);
         // MAT-250. 25 donations to the affected charity not fully processed.
         $this->addSql(
             <<<EOT

1139) /home/barney/projects/matchbot/src/Migrations/Version20220531094925.php:34    [M] DecrementInteger

--- Original
+++ New
@@ @@
                   tbgShouldProcessGiftAid = 1
             LIMIT 76
 EOT
-, ['campaignId' => 3016]);
+, ['campaignId' => 3015]);
         // MAT-250. 25 donations to the affected charity not fully processed.
         $this->addSql(
             <<<EOT

1140) /home/barney/projects/matchbot/src/Migrations/Version20220531094925.php:34    [M] IncrementInteger

--- Original
+++ New
@@ @@
                   tbgShouldProcessGiftAid = 1
             LIMIT 76
 EOT
-, ['campaignId' => 3016]);
+, ['campaignId' => 3017]);
         // MAT-250. 25 donations to the affected charity not fully processed.
         $this->addSql(
             <<<EOT

1141) /home/barney/projects/matchbot/src/Migrations/Version20220531094925.php:39    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             LIMIT 76
 EOT
 , ['campaignId' => 3016]);
-        // MAT-250. 25 donations to the affected charity not fully processed.
-        $this->addSql(
-            <<<EOT
-UPDATE Donation
-SET
-    tbgGiftAidRequestQueuedAt = NULL,
-    tbgGiftAidRequestFailedAt = NULL,
-    tbgGiftAidRequestConfirmedCompleteAt = NULL,
-    tbgGiftAidRequestCorrelationId = NULL,
-    tbgGiftAidResponseDetail = NULL
-WHERE
-    tbgGiftAidRequestQueuedAt IS NOT NULL AND
-    tbgGiftAidRequestCorrelationId IN (:correlationIdsToResubmit)
-LIMIT 25
-EOT
-,
-            ['correlationIdsToResubmit' => ['271C66984399459FB28366A527897AB6', '3AE1F6653D9F43C795E570DDA5C5E83C', '8E237A0CB284419C98F1EC0DFB40B38B']],
-            // https://stackoverflow.com/a/36710894/2803757
-            ['correlationIdsToResubmit' => Connection::PARAM_STR_ARRAY]
-        );
+        
     }
     public function down(Schema $schema) : void
     {

1142) /home/barney/projects/matchbot/src/Migrations/Version20220531094925.php:52    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
 LIMIT 25
 EOT
 ,
-            ['correlationIdsToResubmit' => ['271C66984399459FB28366A527897AB6', '3AE1F6653D9F43C795E570DDA5C5E83C', '8E237A0CB284419C98F1EC0DFB40B38B']],
+            [],
             // https://stackoverflow.com/a/36710894/2803757
             ['correlationIdsToResubmit' => Connection::PARAM_STR_ARRAY]
         );

1143) /home/barney/projects/matchbot/src/Migrations/Version20220531094925.php:53    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
 LIMIT 25
 EOT
 ,
-            ['correlationIdsToResubmit' => ['271C66984399459FB28366A527897AB6', '3AE1F6653D9F43C795E570DDA5C5E83C', '8E237A0CB284419C98F1EC0DFB40B38B']],
+            ['correlationIdsToResubmit' => ['3AE1F6653D9F43C795E570DDA5C5E83C', '8E237A0CB284419C98F1EC0DFB40B38B']],
             // https://stackoverflow.com/a/36710894/2803757
             ['correlationIdsToResubmit' => Connection::PARAM_STR_ARRAY]
         );

1144) /home/barney/projects/matchbot/src/Migrations/Version20220531094925.php:60    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
 ,
             ['correlationIdsToResubmit' => ['271C66984399459FB28366A527897AB6', '3AE1F6653D9F43C795E570DDA5C5E83C', '8E237A0CB284419C98F1EC0DFB40B38B']],
             // https://stackoverflow.com/a/36710894/2803757
-            ['correlationIdsToResubmit' => Connection::PARAM_STR_ARRAY]
+            []
         );
     }
     public function down(Schema $schema) : void

1146) /home/barney/projects/matchbot/src/Migrations/Version20220623122551.php:37    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
 LIMIT 76
 EOT
 ,
-            ['correlationIdsToResubmit' => [
-                // First 5 for 31 donations to Global Ecovillage Network (charity id 1718)
-                'F18E8038C1694F27B58208A22F63C9FD',
-                'C0FCB56D3352438DB49A8E1563E62E0F',
-                '416F0EBB7581473F86B7513A1FED2CEC',
-                'ABA1A41CDC6A400A87E0144577D0845F',
-                'C11284ACA90940E5A24C46D458AF6FC1',
-                // Second 5 for 45 donations to Cambridge Rape Crisis Centre (charity id 1656)
-                '770F55B41EB34BB1AEDF43EAE971420F',
-                '1A35A214B81A41BBA6DAF78164B73FF8',
-                '2011B9F341D54A4DB3A281CDD0B43465',
-                '287E66C1CE4246C1AACC0144CA2212AC',
-                'C02E6128327648649D56C56ECC05B245',
-            ]],
+            [],
             // https://stackoverflow.com/a/36710894/2803757
             ['correlationIdsToResubmit' => Connection::PARAM_STR_ARRAY]
         );

1150) /home/barney/projects/matchbot/src/Migrations/Version20220624112013.php:25    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         // This DB migration is only to be ran in staging!
         if (getenv('APP_ENV') === 'staging') {
-            // Add hmrcReferenceNumber in MatchBot DB
-            $this->addSql(<<<EOT
-    UPDATE Charity
-    SET hmrcReferenceNumber = 'AB98765'
-    WHERE salesforceId = '0011r00002HoeprAAB'
-    LIMIT 1
-EOT
-);
+            
             // Prepare donations for ClaimBot
             $this->addSql(<<<EOT
 UPDATE Donation

1151) /home/barney/projects/matchbot/src/Migrations/Version20220624112013.php:33    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     LIMIT 1
 EOT
 );
-            // Prepare donations for ClaimBot
-            $this->addSql(<<<EOT
-UPDATE Donation
-SET donationStatus = 'Paid',
-    tbgShouldProcessGiftAid = 1
-WHERE campaign_id = 1781
-    AND donationStatus = 'Collected'
-    AND tbgShouldProcessGiftAid = 0
-    AND donorEmailAddress = 'Dominique@thebiggive.org.uk'
-    AND collectedAt >= '2022-06-01 00:00:00'
-    AND collectedAt <= '2022-06-01 23:59:59'
-LIMIT 12;
-EOT
-);
+            
         }
     }
     public function down(Schema $schema) : void

1152) /home/barney/projects/matchbot/src/Migrations/Version20220705130951.php:22    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     }
     public function up(Schema $schema) : void
     {
-        $this->addSql(<<<EOT
-UPDATE Donation
-SET
-    tbgGiftAidRequestQueuedAt = NULL,
-    tbgGiftAidRequestFailedAt = NULL,
-    tbgGiftAidRequestConfirmedCompleteAt = NULL,
-    tbgGiftAidRequestCorrelationId = NULL,
-    tbgGiftAidResponseDetail = NULL
-WHERE
-    tbgGiftAidRequestQueuedAt BETWEEN '2022-06-27 00:00:00' AND '2022-06-27 23:59:59' AND
-    tbgGiftAidRequestCorrelationId IS NULL AND
-    tbgGiftAidRequestFailedAt IS NULL
-LIMIT 148
-EOT
-);
+        
     }
     public function down(Schema $schema) : void
     {

1153) /home/barney/projects/matchbot/src/Migrations/Version20220819094649.php:23    [M] DecrementInteger

--- Original
+++ New
@@ @@
     }
     public function up(Schema $schema) : void
     {
-        $campaignIds = [2596, 3028, 3046];
+        $campaignIds = [2595, 3028, 3046];
         $this->addSql(<<<EOT
 UPDATE Donation
 SET

1155) /home/barney/projects/matchbot/src/Migrations/Version20220819094649.php:23    [M] DecrementInteger

--- Original
+++ New
@@ @@
     }
     public function up(Schema $schema) : void
     {
-        $campaignIds = [2596, 3028, 3046];
+        $campaignIds = [2596, 3027, 3046];
         $this->addSql(<<<EOT
 UPDATE Donation
 SET

1156) /home/barney/projects/matchbot/src/Migrations/Version20220819094649.php:23    [M] IncrementInteger

--- Original
+++ New
@@ @@
     }
     public function up(Schema $schema) : void
     {
-        $campaignIds = [2596, 3028, 3046];
+        $campaignIds = [2596, 3029, 3046];
         $this->addSql(<<<EOT
 UPDATE Donation
 SET

1157) /home/barney/projects/matchbot/src/Migrations/Version20220819094649.php:23    [M] DecrementInteger

--- Original
+++ New
@@ @@
     }
     public function up(Schema $schema) : void
     {
-        $campaignIds = [2596, 3028, 3046];
+        $campaignIds = [2596, 3028, 3045];
         $this->addSql(<<<EOT
 UPDATE Donation
 SET

1159) /home/barney/projects/matchbot/src/Migrations/Version20220819094649.php:23    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     }
     public function up(Schema $schema) : void
     {
-        $campaignIds = [2596, 3028, 3046];
+        $campaignIds = [3028, 3046];
         $this->addSql(<<<EOT
 UPDATE Donation
 SET

1160) /home/barney/projects/matchbot/src/Migrations/Version20220819094649.php:25    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function up(Schema $schema) : void
     {
         $campaignIds = [2596, 3028, 3046];
-        $this->addSql(<<<EOT
-UPDATE Donation
-SET
-    tbgGiftAidRequestQueuedAt = NULL,
-    tbgGiftAidRequestFailedAt = NULL,
-    tbgGiftAidRequestConfirmedCompleteAt = NULL,
-    tbgGiftAidRequestCorrelationId = NULL,
-    tbgGiftAidResponseDetail = NULL
-WHERE
-    collectedAt < '2022-08-01 00:00:00' AND
-    campaign_id IN (:campaignIdsToRequeue) AND
-    tbgGiftAidRequestQueuedAt IS NOT NULL
-LIMIT 392
-EOT
-, ['campaignIdsToRequeue' => $campaignIds], ['campaignIdsToRequeue' => Connection::PARAM_INT_ARRAY]);
+        
     }
     public function down(Schema $schema) : void
     {

1161) /home/barney/projects/matchbot/src/Migrations/Version20220819094649.php:39    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     tbgGiftAidRequestQueuedAt IS NOT NULL
 LIMIT 392
 EOT
-, ['campaignIdsToRequeue' => $campaignIds], ['campaignIdsToRequeue' => Connection::PARAM_INT_ARRAY]);
+, [], ['campaignIdsToRequeue' => Connection::PARAM_INT_ARRAY]);
     }
     public function down(Schema $schema) : void
     {

1162) /home/barney/projects/matchbot/src/Migrations/Version20220819094649.php:40    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     tbgGiftAidRequestQueuedAt IS NOT NULL
 LIMIT 392
 EOT
-, ['campaignIdsToRequeue' => $campaignIds], ['campaignIdsToRequeue' => Connection::PARAM_INT_ARRAY]);
+, ['campaignIdsToRequeue' => $campaignIds], []);
     }
     public function down(Schema $schema) : void
     {

1165) /home/barney/projects/matchbot/src/Migrations/Version20221004134449.php:23    [M] DecrementInteger

--- Original
+++ New
@@ @@
     }
     public function up(Schema $schema) : void
     {
-        $campaignIds = [1805, 2758, 2469];
+        $campaignIds = [1804, 2758, 2469];
         $this->addSql(<<<EOT
 UPDATE Donation
 SET

1166) /home/barney/projects/matchbot/src/Migrations/Version20221004134449.php:23    [M] IncrementInteger

--- Original
+++ New
@@ @@
     }
     public function up(Schema $schema) : void
     {
-        $campaignIds = [1805, 2758, 2469];
+        $campaignIds = [1806, 2758, 2469];
         $this->addSql(<<<EOT
 UPDATE Donation
 SET

1168) /home/barney/projects/matchbot/src/Migrations/Version20221004134449.php:23    [M] IncrementInteger

--- Original
+++ New
@@ @@
     }
     public function up(Schema $schema) : void
     {
-        $campaignIds = [1805, 2758, 2469];
+        $campaignIds = [1805, 2759, 2469];
         $this->addSql(<<<EOT
 UPDATE Donation
 SET

1169) /home/barney/projects/matchbot/src/Migrations/Version20221004134449.php:23    [M] DecrementInteger

--- Original
+++ New
@@ @@
     }
     public function up(Schema $schema) : void
     {
-        $campaignIds = [1805, 2758, 2469];
+        $campaignIds = [1805, 2758, 2468];
         $this->addSql(<<<EOT
 UPDATE Donation
 SET

1171) /home/barney/projects/matchbot/src/Migrations/Version20221004134449.php:23    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     }
     public function up(Schema $schema) : void
     {
-        $campaignIds = [1805, 2758, 2469];
+        $campaignIds = [2758, 2469];
         $this->addSql(<<<EOT
 UPDATE Donation
 SET

1172) /home/barney/projects/matchbot/src/Migrations/Version20221004134449.php:24    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function up(Schema $schema) : void
     {
         $campaignIds = [1805, 2758, 2469];
-        $this->addSql(<<<EOT
-UPDATE Donation
-SET
-    tbgGiftAidRequestQueuedAt = NULL,
-    tbgGiftAidRequestFailedAt = NULL,
-    tbgGiftAidRequestConfirmedCompleteAt = NULL,
-    tbgGiftAidRequestCorrelationId = NULL,
-    tbgGiftAidResponseDetail = NULL
-WHERE
-    campaign_id IN (:campaignIdsToRequeue) AND
-    tbgGiftAidRequestQueuedAt IS NOT NULL AND
-    giftAid = 1 AND
-    tbgShouldProcessGiftAid = 1
-LIMIT 130
-EOT
-, ['campaignIdsToRequeue' => $campaignIds], ['campaignIdsToRequeue' => Connection::PARAM_INT_ARRAY]);
+        
     }
     public function down(Schema $schema) : void
     {

1175) /home/barney/projects/matchbot/src/Migrations/Version20221021174752.php:28    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
 WHERE salesforceId = :sfId
 LIMIT 1
 EOT;
-        $this->addSql($updateSql, ['sfId' => 'a066900001u4YTvAAM']);
+        $this->addSql($updateSql, []);
     }
     public function down(Schema $schema) : void
     {

1176) /home/barney/projects/matchbot/src/Migrations/Version20221021174752.php:28    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
 WHERE salesforceId = :sfId
 LIMIT 1
 EOT;
-        $this->addSql($updateSql, ['sfId' => 'a066900001u4YTvAAM']);
+        
     }
     public function down(Schema $schema) : void
     {

1180) /home/barney/projects/matchbot/src/Migrations/Version20221101143104.php:30    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
 WHERE salesforceId IN (:sfIds)
 LIMIT 2
 EOT;
-        $this->addSql($updateSql, ['sfIds' => ['a066900001u4sBVAAY', 'a066900001u4sD7AAI']], ['sfIds' => Connection::PARAM_STR_ARRAY]);
+        
     }
     public function down(Schema $schema) : void
     {

1181) /home/barney/projects/matchbot/src/Migrations/Version20221101143104.php:32    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
 WHERE salesforceId IN (:sfIds)
 LIMIT 2
 EOT;
-        $this->addSql($updateSql, ['sfIds' => ['a066900001u4sBVAAY', 'a066900001u4sD7AAI']], ['sfIds' => Connection::PARAM_STR_ARRAY]);
+        $this->addSql($updateSql, [], ['sfIds' => Connection::PARAM_STR_ARRAY]);
     }
     public function down(Schema $schema) : void
     {

1182) /home/barney/projects/matchbot/src/Migrations/Version20221101143104.php:33    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
 WHERE salesforceId IN (:sfIds)
 LIMIT 2
 EOT;
-        $this->addSql($updateSql, ['sfIds' => ['a066900001u4sBVAAY', 'a066900001u4sD7AAI']], ['sfIds' => Connection::PARAM_STR_ARRAY]);
+        $this->addSql($updateSql, ['sfIds' => ['a066900001u4sD7AAI']], ['sfIds' => Connection::PARAM_STR_ARRAY]);
     }
     public function down(Schema $schema) : void
     {

1183) /home/barney/projects/matchbot/src/Migrations/Version20221101143104.php:38    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
 WHERE salesforceId IN (:sfIds)
 LIMIT 2
 EOT;
-        $this->addSql($updateSql, ['sfIds' => ['a066900001u4sBVAAY', 'a066900001u4sD7AAI']], ['sfIds' => Connection::PARAM_STR_ARRAY]);
+        $this->addSql($updateSql, ['sfIds' => ['a066900001u4sBVAAY', 'a066900001u4sD7AAI']], []);
     }
     public function down(Schema $schema) : void
     {

1184) /home/barney/projects/matchbot/src/Migrations/Version20221203115436.php:24    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     }
     public function up(Schema $schema) : void
     {
-        $this->addSql(<<<EOT
-            UPDATE Donation SET donorEmailAddress = REPLACE(donorEmailAddress, '..com', '.com')
-EOT
-, []);
+        
     }
     public function down(Schema $schema) : void
     {

1185) /home/barney/projects/matchbot/src/Migrations/Version20221203151735.php:33    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
 WHERE salesforceId IN (:sfIds)
 LIMIT 1
 EOT;
-        // Sticking with str array to minimise differences from `Version20221101143104`.
-        $this->addSql($updateSql, ['sfIds' => ['a066900001vVp3kAAC']], ['sfIds' => Connection::PARAM_STR_ARRAY]);
+        
     }
     public function down(Schema $schema) : void
     {

1186) /home/barney/projects/matchbot/src/Migrations/Version20221203151735.php:35    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
 LIMIT 1
 EOT;
         // Sticking with str array to minimise differences from `Version20221101143104`.
-        $this->addSql($updateSql, ['sfIds' => ['a066900001vVp3kAAC']], ['sfIds' => Connection::PARAM_STR_ARRAY]);
+        $this->addSql($updateSql, [], ['sfIds' => Connection::PARAM_STR_ARRAY]);
     }
     public function down(Schema $schema) : void
     {

1187) /home/barney/projects/matchbot/src/Migrations/Version20221203151735.php:36    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
 LIMIT 1
 EOT;
         // Sticking with str array to minimise differences from `Version20221101143104`.
-        $this->addSql($updateSql, ['sfIds' => ['a066900001vVp3kAAC']], ['sfIds' => Connection::PARAM_STR_ARRAY]);
+        $this->addSql($updateSql, ['sfIds' => []], ['sfIds' => Connection::PARAM_STR_ARRAY]);
     }
     public function down(Schema $schema) : void
     {

1188) /home/barney/projects/matchbot/src/Migrations/Version20221203151735.php:40    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
 LIMIT 1
 EOT;
         // Sticking with str array to minimise differences from `Version20221101143104`.
-        $this->addSql($updateSql, ['sfIds' => ['a066900001vVp3kAAC']], ['sfIds' => Connection::PARAM_STR_ARRAY]);
+        $this->addSql($updateSql, ['sfIds' => ['a066900001vVp3kAAC']], []);
     }
     public function down(Schema $schema) : void
     {

1198) /home/barney/projects/matchbot/src/Migrations/Version20230117173337.php:29    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
 WHERE salesforceId IN (:sfIds)
 LIMIT 3
 EOT;
-        $this->addSql($updateCollectedAtSql, ['sfIds' => [
-            'a066900001u4sBVAAY',
-            // See Version20221101143104
-            'a066900001u4sD7AAI',
-            // See Version20221101143104
-            'a066900001vVp3kAAC',
-        ]], ['sfIds' => Connection::PARAM_STR_ARRAY]);
+        
     }
     public function down(Schema $schema) : void
     {

1199) /home/barney/projects/matchbot/src/Migrations/Version20230117173337.php:31    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
 WHERE salesforceId IN (:sfIds)
 LIMIT 3
 EOT;
-        $this->addSql($updateCollectedAtSql, ['sfIds' => [
-            'a066900001u4sBVAAY',
-            // See Version20221101143104
-            'a066900001u4sD7AAI',
-            // See Version20221101143104
-            'a066900001vVp3kAAC',
-        ]], ['sfIds' => Connection::PARAM_STR_ARRAY]);
+        $this->addSql($updateCollectedAtSql, [], ['sfIds' => Connection::PARAM_STR_ARRAY]);
     }
     public function down(Schema $schema) : void
     {
