1201) /home/barney/projects/matchbot/src/Migrations/Version20230117173337.php:38    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
             'a066900001u4sD7AAI',
             // See Version20221101143104
             'a066900001vVp3kAAC',
-        ]], ['sfIds' => Connection::PARAM_STR_ARRAY]);
+        ]], []);
     }
     public function down(Schema $schema) : void
     {

1202) /home/barney/projects/matchbot/src/Migrations/Version20230124121155.php:32    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     createdAt BETWEEN :firstDate AND :lastDate AND
     campaign_id NOT IN (:campaignIdsToNotPatch)
 EOT;
-        $this->addSql($updateStatusSql, [
-            'campaignIdsToNotPatch' => [3493, 3728, 3809, 3922, 4150, 4431],
-            'firstDate' => '2022-11-16 00:00:00',
-            // UTC === local UK in this case.
-            'lastDate' => '2023-01-09 23:59:59',
-        ], ['campaignIdsToNotPatch' => Connection::PARAM_INT_ARRAY, 'firstDate' => ParameterType::STRING, 'lastDate' => ParameterType::STRING]);
+        
     }
     public function down(Schema $schema) : void
     {

1204) /home/barney/projects/matchbot/src/Migrations/Version20230124121155.php:35    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     campaign_id NOT IN (:campaignIdsToNotPatch)
 EOT;
         $this->addSql($updateStatusSql, [
-            'campaignIdsToNotPatch' => [3493, 3728, 3809, 3922, 4150, 4431],
+            'campaignIdsToNotPatch' => [3728, 3809, 3922, 4150, 4431],
             'firstDate' => '2022-11-16 00:00:00',
             // UTC === local UK in this case.
             'lastDate' => '2023-01-09 23:59:59',

1205) /home/barney/projects/matchbot/src/Migrations/Version20230124121155.php:36    [M] DecrementInteger

--- Original
+++ New
@@ @@
     campaign_id NOT IN (:campaignIdsToNotPatch)
 EOT;
         $this->addSql($updateStatusSql, [
-            'campaignIdsToNotPatch' => [3493, 3728, 3809, 3922, 4150, 4431],
+            'campaignIdsToNotPatch' => [3492, 3728, 3809, 3922, 4150, 4431],
             'firstDate' => '2022-11-16 00:00:00',
             // UTC === local UK in this case.
             'lastDate' => '2023-01-09 23:59:59',

1206) /home/barney/projects/matchbot/src/Migrations/Version20230124121155.php:36    [M] IncrementInteger

--- Original
+++ New
@@ @@
     campaign_id NOT IN (:campaignIdsToNotPatch)
 EOT;
         $this->addSql($updateStatusSql, [
-            'campaignIdsToNotPatch' => [3493, 3728, 3809, 3922, 4150, 4431],
+            'campaignIdsToNotPatch' => [3494, 3728, 3809, 3922, 4150, 4431],
             'firstDate' => '2022-11-16 00:00:00',
             // UTC === local UK in this case.
             'lastDate' => '2023-01-09 23:59:59',

1207) /home/barney/projects/matchbot/src/Migrations/Version20230124121155.php:37    [M] DecrementInteger

--- Original
+++ New
@@ @@
     campaign_id NOT IN (:campaignIdsToNotPatch)
 EOT;
         $this->addSql($updateStatusSql, [
-            'campaignIdsToNotPatch' => [3493, 3728, 3809, 3922, 4150, 4431],
+            'campaignIdsToNotPatch' => [3493, 3727, 3809, 3922, 4150, 4431],
             'firstDate' => '2022-11-16 00:00:00',
             // UTC === local UK in this case.
             'lastDate' => '2023-01-09 23:59:59',

1208) /home/barney/projects/matchbot/src/Migrations/Version20230124121155.php:37    [M] IncrementInteger

--- Original
+++ New
@@ @@
     campaign_id NOT IN (:campaignIdsToNotPatch)
 EOT;
         $this->addSql($updateStatusSql, [
-            'campaignIdsToNotPatch' => [3493, 3728, 3809, 3922, 4150, 4431],
+            'campaignIdsToNotPatch' => [3493, 3729, 3809, 3922, 4150, 4431],
             'firstDate' => '2022-11-16 00:00:00',
             // UTC === local UK in this case.
             'lastDate' => '2023-01-09 23:59:59',

1209) /home/barney/projects/matchbot/src/Migrations/Version20230124121155.php:38    [M] DecrementInteger

--- Original
+++ New
@@ @@
     campaign_id NOT IN (:campaignIdsToNotPatch)
 EOT;
         $this->addSql($updateStatusSql, [
-            'campaignIdsToNotPatch' => [3493, 3728, 3809, 3922, 4150, 4431],
+            'campaignIdsToNotPatch' => [3493, 3728, 3808, 3922, 4150, 4431],
             'firstDate' => '2022-11-16 00:00:00',
             // UTC === local UK in this case.
             'lastDate' => '2023-01-09 23:59:59',

1210) /home/barney/projects/matchbot/src/Migrations/Version20230124121155.php:38    [M] IncrementInteger

--- Original
+++ New
@@ @@
     campaign_id NOT IN (:campaignIdsToNotPatch)
 EOT;
         $this->addSql($updateStatusSql, [
-            'campaignIdsToNotPatch' => [3493, 3728, 3809, 3922, 4150, 4431],
+            'campaignIdsToNotPatch' => [3493, 3728, 3810, 3922, 4150, 4431],
             'firstDate' => '2022-11-16 00:00:00',
             // UTC === local UK in this case.
             'lastDate' => '2023-01-09 23:59:59',

1211) /home/barney/projects/matchbot/src/Migrations/Version20230124121155.php:39    [M] DecrementInteger

--- Original
+++ New
@@ @@
     campaign_id NOT IN (:campaignIdsToNotPatch)
 EOT;
         $this->addSql($updateStatusSql, [
-            'campaignIdsToNotPatch' => [3493, 3728, 3809, 3922, 4150, 4431],
+            'campaignIdsToNotPatch' => [3493, 3728, 3809, 3921, 4150, 4431],
             'firstDate' => '2022-11-16 00:00:00',
             // UTC === local UK in this case.
             'lastDate' => '2023-01-09 23:59:59',

1212) /home/barney/projects/matchbot/src/Migrations/Version20230124121155.php:39    [M] IncrementInteger

--- Original
+++ New
@@ @@
     campaign_id NOT IN (:campaignIdsToNotPatch)
 EOT;
         $this->addSql($updateStatusSql, [
-            'campaignIdsToNotPatch' => [3493, 3728, 3809, 3922, 4150, 4431],
+            'campaignIdsToNotPatch' => [3493, 3728, 3809, 3923, 4150, 4431],
             'firstDate' => '2022-11-16 00:00:00',
             // UTC === local UK in this case.
             'lastDate' => '2023-01-09 23:59:59',

1213) /home/barney/projects/matchbot/src/Migrations/Version20230124121155.php:40    [M] DecrementInteger

--- Original
+++ New
@@ @@
     campaign_id NOT IN (:campaignIdsToNotPatch)
 EOT;
         $this->addSql($updateStatusSql, [
-            'campaignIdsToNotPatch' => [3493, 3728, 3809, 3922, 4150, 4431],
+            'campaignIdsToNotPatch' => [3493, 3728, 3809, 3922, 4149, 4431],
             'firstDate' => '2022-11-16 00:00:00',
             // UTC === local UK in this case.
             'lastDate' => '2023-01-09 23:59:59',

1214) /home/barney/projects/matchbot/src/Migrations/Version20230124121155.php:40    [M] IncrementInteger

--- Original
+++ New
@@ @@
     campaign_id NOT IN (:campaignIdsToNotPatch)
 EOT;
         $this->addSql($updateStatusSql, [
-            'campaignIdsToNotPatch' => [3493, 3728, 3809, 3922, 4150, 4431],
+            'campaignIdsToNotPatch' => [3493, 3728, 3809, 3922, 4151, 4431],
             'firstDate' => '2022-11-16 00:00:00',
             // UTC === local UK in this case.
             'lastDate' => '2023-01-09 23:59:59',

1215) /home/barney/projects/matchbot/src/Migrations/Version20230124121155.php:41    [M] DecrementInteger

--- Original
+++ New
@@ @@
     campaign_id NOT IN (:campaignIdsToNotPatch)
 EOT;
         $this->addSql($updateStatusSql, [
-            'campaignIdsToNotPatch' => [3493, 3728, 3809, 3922, 4150, 4431],
+            'campaignIdsToNotPatch' => [3493, 3728, 3809, 3922, 4150, 4430],
             'firstDate' => '2022-11-16 00:00:00',
             // UTC === local UK in this case.
             'lastDate' => '2023-01-09 23:59:59',

1216) /home/barney/projects/matchbot/src/Migrations/Version20230124121155.php:41    [M] IncrementInteger

--- Original
+++ New
@@ @@
     campaign_id NOT IN (:campaignIdsToNotPatch)
 EOT;
         $this->addSql($updateStatusSql, [
-            'campaignIdsToNotPatch' => [3493, 3728, 3809, 3922, 4150, 4431],
+            'campaignIdsToNotPatch' => [3493, 3728, 3809, 3922, 4150, 4432],
             'firstDate' => '2022-11-16 00:00:00',
             // UTC === local UK in this case.
             'lastDate' => '2023-01-09 23:59:59',

1217) /home/barney/projects/matchbot/src/Migrations/Version20230124121155.php:46    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
             'firstDate' => '2022-11-16 00:00:00',
             // UTC === local UK in this case.
             'lastDate' => '2023-01-09 23:59:59',
-        ], ['campaignIdsToNotPatch' => Connection::PARAM_INT_ARRAY, 'firstDate' => ParameterType::STRING, 'lastDate' => ParameterType::STRING]);
+        ], ['firstDate' => ParameterType::STRING, 'lastDate' => ParameterType::STRING]);
     }
     public function down(Schema $schema) : void
     {

1224) /home/barney/projects/matchbot/src/Migrations/Version20230801110114.php:20    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     }
     public function up(Schema $schema) : void
     {
-        // SQL copied from \MatchBot\Migrations\Version20230707100241, campaign id changed.
-        $this->addSql(<<<SQL
-    UPDATE Donation
-    SET
-        tbgGiftAidRequestQueuedAt = NULL,
-        tbgGiftAidRequestFailedAt = NULL,
-        tbgGiftAidRequestConfirmedCompleteAt = NULL,
-        tbgGiftAidRequestCorrelationId = NULL,
-        tbgGiftAidResponseDetail = NULL
-    WHERE
-        campaign_id = 4644 AND
-        giftAid = 1 AND
-        tbgShouldProcessGiftAid = 1 AND
-        tbgGiftAidRequestCorrelationId IS NOT NULL AND
-        donationStatus = 'Paid'
-    LIMIT 97;
-SQL
-);
+        
     }
     public function down(Schema $schema) : void
     {

1228) /home/barney/projects/matchbot/src/Migrations/Version20230907114841.php:24    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function up(Schema $schema) : void
     {
         $campaignIdForMAT311 = 4661;
-        $this->addSql(<<<SQL
-    UPDATE Donation
-    SET
-        tbgGiftAidRequestQueuedAt = NULL,
-        tbgGiftAidRequestFailedAt = NULL,
-        tbgGiftAidRequestConfirmedCompleteAt = NULL,
-        tbgGiftAidRequestCorrelationId = NULL,
-        tbgGiftAidResponseDetail = NULL
-    WHERE
-        campaign_id = {$campaignIdForMAT311} AND
-        giftAid = 1 AND
-        tbgShouldProcessGiftAid = 1 AND
-        tbgGiftAidRequestCorrelationId IS NOT NULL AND
-        donationStatus = 'Paid'
-    LIMIT 218;
-SQL
-);
+        
     }
     public function down(Schema $schema) : void
     {

1235) /home/barney/projects/matchbot/src/Migrations/Version20230928150700.php:25    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function up(Schema $schema) : void
     {
         $this->addSql('ALTER TABLE Charity ADD tbgApprovedToClaimGiftAid TINYINT(1) NOT NULL');
-        // For existing charities, set starting state to the same as the previous onboarded flag.
-        $this->addSql('UPDATE Charity SET tbgApprovedToClaimGiftAid = tbgClaimingGiftAid');
+        
     }
     public function down(Schema $schema) : void
     {

1239) /home/barney/projects/matchbot/src/Migrations/Version20231016115215.php:23    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     }
     public function up(Schema $schema) : void
     {
-        // this up() migration is auto-generated, please modify it to your needs
-        $this->addSql('CREATE TABLE DonorAccount (id INT UNSIGNED AUTO_INCREMENT NOT NULL, emailAddress VARCHAR(256) NOT NULL, stripeCustomerId VARCHAR(50) NOT NULL, PRIMARY KEY(id)) DEFAULT CHARACTER SET utf8mb4 COLLATE `utf8mb4_unicode_ci` ENGINE = InnoDB');
+        
     }
     public function down(Schema $schema) : void
     {

1240) /home/barney/projects/matchbot/src/Migrations/Version20231016115215.php:29    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     }
     public function down(Schema $schema) : void
     {
-        // this down() migration is auto-generated, please modify it to your needs
-        $this->addSql('DROP TABLE DonorAccount');
+        
     }
 }

1247) /home/barney/projects/matchbot/src/Migrations/Version20231018104935.php:25    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     }
     public function up(Schema $schema) : void
     {
-        // we have a duplicate already in staging, but we don't care much about any of the data in this table yet.
-        $this->addSql('DELETE FROM DonorAccount WHERE ID > 0');
+        
         $this->addSql('CREATE UNIQUE INDEX UNIQ_STRIPE_ID ON DonorAccount(stripeCustomerId) ');
     }
     public function down(Schema $schema) : void

1254) /home/barney/projects/matchbot/src/Monolog/Handler/SlackHandler.php:40    [M] FalseValue

--- Original
+++ New
@@ @@
     public function handle(array|\ArrayAccess $record) : bool
     {
         if ($record['level'] < Logger::ERROR) {
-            return false;
+            return true;
             // allows another handle to handle this.
         }
         $message = $record['message'];

1255) /home/barney/projects/matchbot/src/Monolog/Handler/SlackHandler.php:48    [M] IncrementInteger

--- Original
+++ New
@@ @@
         $message = $record['message'];
         $levelName = $record['level_name'];
         $lines = explode(PHP_EOL, $message);
-        $messageFirstLine = $lines[0] ?? '';
+        $messageFirstLine = $lines[1] ?? '';
         $messageFirstSeveralLines = implode(\PHP_EOL, array_slice($lines, 0, 9)) . \PHP_EOL;
         $heading = "Matchbot {$levelName}: {$messageFirstLine}";
         $chatMessage = new ChatMessage($heading);

1256) /home/barney/projects/matchbot/src/Monolog/Handler/SlackHandler.php:48    [M] Coalesce

--- Original
+++ New
@@ @@
         $message = $record['message'];
         $levelName = $record['level_name'];
         $lines = explode(PHP_EOL, $message);
-        $messageFirstLine = $lines[0] ?? '';
+        $messageFirstLine = '' ?? $lines[0];
         $messageFirstSeveralLines = implode(\PHP_EOL, array_slice($lines, 0, 9)) . \PHP_EOL;
         $heading = "Matchbot {$levelName}: {$messageFirstLine}";
         $chatMessage = new ChatMessage($heading);

1257) /home/barney/projects/matchbot/src/Monolog/Handler/SlackHandler.php:49    [M] DecrementInteger

--- Original
+++ New
@@ @@
         $levelName = $record['level_name'];
         $lines = explode(PHP_EOL, $message);
         $messageFirstLine = $lines[0] ?? '';
-        $messageFirstSeveralLines = implode(\PHP_EOL, array_slice($lines, 0, 9)) . \PHP_EOL;
+        $messageFirstSeveralLines = implode(\PHP_EOL, array_slice($lines, -1, 9)) . \PHP_EOL;
         $heading = "Matchbot {$levelName}: {$messageFirstLine}";
         $chatMessage = new ChatMessage($heading);
         $options = (new SlackOptions())->block(new SlackHeaderBlock(substr($heading, 0, 150)))->block((new SlackSectionBlock())->text($messageFirstSeveralLines));

1258) /home/barney/projects/matchbot/src/Monolog/Handler/SlackHandler.php:49    [M] IncrementInteger

--- Original
+++ New
@@ @@
         $levelName = $record['level_name'];
         $lines = explode(PHP_EOL, $message);
         $messageFirstLine = $lines[0] ?? '';
-        $messageFirstSeveralLines = implode(\PHP_EOL, array_slice($lines, 0, 9)) . \PHP_EOL;
+        $messageFirstSeveralLines = implode(\PHP_EOL, array_slice($lines, 1, 9)) . \PHP_EOL;
         $heading = "Matchbot {$levelName}: {$messageFirstLine}";
         $chatMessage = new ChatMessage($heading);
         $options = (new SlackOptions())->block(new SlackHeaderBlock(substr($heading, 0, 150)))->block((new SlackSectionBlock())->text($messageFirstSeveralLines));

1260) /home/barney/projects/matchbot/src/Monolog/Handler/SlackHandler.php:49    [M] IncrementInteger

--- Original
+++ New
@@ @@
         $levelName = $record['level_name'];
         $lines = explode(PHP_EOL, $message);
         $messageFirstLine = $lines[0] ?? '';
-        $messageFirstSeveralLines = implode(\PHP_EOL, array_slice($lines, 0, 9)) . \PHP_EOL;
+        $messageFirstSeveralLines = implode(\PHP_EOL, array_slice($lines, 0, 10)) . \PHP_EOL;
         $heading = "Matchbot {$levelName}: {$messageFirstLine}";
         $chatMessage = new ChatMessage($heading);
         $options = (new SlackOptions())->block(new SlackHeaderBlock(substr($heading, 0, 150)))->block((new SlackSectionBlock())->text($messageFirstSeveralLines));

1261) /home/barney/projects/matchbot/src/Monolog/Handler/SlackHandler.php:49    [M] UnwrapArraySlice

--- Original
+++ New
@@ @@
         $levelName = $record['level_name'];
         $lines = explode(PHP_EOL, $message);
         $messageFirstLine = $lines[0] ?? '';
-        $messageFirstSeveralLines = implode(\PHP_EOL, array_slice($lines, 0, 9)) . \PHP_EOL;
+        $messageFirstSeveralLines = implode(\PHP_EOL, $lines) . \PHP_EOL;
         $heading = "Matchbot {$levelName}: {$messageFirstLine}";
         $chatMessage = new ChatMessage($heading);
         $options = (new SlackOptions())->block(new SlackHeaderBlock(substr($heading, 0, 150)))->block((new SlackSectionBlock())->text($messageFirstSeveralLines));

1262) /home/barney/projects/matchbot/src/Monolog/Handler/SlackHandler.php:49    [M] Concat

--- Original
+++ New
@@ @@
         $levelName = $record['level_name'];
         $lines = explode(PHP_EOL, $message);
         $messageFirstLine = $lines[0] ?? '';
-        $messageFirstSeveralLines = implode(\PHP_EOL, array_slice($lines, 0, 9)) . \PHP_EOL;
+        $messageFirstSeveralLines = \PHP_EOL . implode(\PHP_EOL, array_slice($lines, 0, 9));
         $heading = "Matchbot {$levelName}: {$messageFirstLine}";
         $chatMessage = new ChatMessage($heading);
         $options = (new SlackOptions())->block(new SlackHeaderBlock(substr($heading, 0, 150)))->block((new SlackSectionBlock())->text($messageFirstSeveralLines));

1264) /home/barney/projects/matchbot/src/Monolog/Handler/SlackHandler.php:49    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         $levelName = $record['level_name'];
         $lines = explode(PHP_EOL, $message);
         $messageFirstLine = $lines[0] ?? '';
-        $messageFirstSeveralLines = implode(\PHP_EOL, array_slice($lines, 0, 9)) . \PHP_EOL;
+        $messageFirstSeveralLines = implode(\PHP_EOL, array_slice($lines, 0, 9));
         $heading = "Matchbot {$levelName}: {$messageFirstLine}";
         $chatMessage = new ChatMessage($heading);
         $options = (new SlackOptions())->block(new SlackHeaderBlock(substr($heading, 0, 150)))->block((new SlackSectionBlock())->text($messageFirstSeveralLines));

1265) /home/barney/projects/matchbot/src/Monolog/Handler/SlackHandler.php:57    [M] DecrementInteger

--- Original
+++ New
@@ @@
         $messageFirstSeveralLines = implode(\PHP_EOL, array_slice($lines, 0, 9)) . \PHP_EOL;
         $heading = "Matchbot {$levelName}: {$messageFirstLine}";
         $chatMessage = new ChatMessage($heading);
-        $options = (new SlackOptions())->block(new SlackHeaderBlock(substr($heading, 0, 150)))->block((new SlackSectionBlock())->text($messageFirstSeveralLines));
+        $options = (new SlackOptions())->block(new SlackHeaderBlock(substr($heading, -1, 150)))->block((new SlackSectionBlock())->text($messageFirstSeveralLines));
         $chatMessage->options($options);
         $this->slackConnction->send($chatMessage);
         return false;

1266) /home/barney/projects/matchbot/src/Monolog/Handler/SlackHandler.php:57    [M] IncrementInteger

--- Original
+++ New
@@ @@
         $messageFirstSeveralLines = implode(\PHP_EOL, array_slice($lines, 0, 9)) . \PHP_EOL;
         $heading = "Matchbot {$levelName}: {$messageFirstLine}";
         $chatMessage = new ChatMessage($heading);
-        $options = (new SlackOptions())->block(new SlackHeaderBlock(substr($heading, 0, 150)))->block((new SlackSectionBlock())->text($messageFirstSeveralLines));
+        $options = (new SlackOptions())->block(new SlackHeaderBlock(substr($heading, 1, 150)))->block((new SlackSectionBlock())->text($messageFirstSeveralLines));
         $chatMessage->options($options);
         $this->slackConnction->send($chatMessage);
         return false;

1267) /home/barney/projects/matchbot/src/Monolog/Handler/SlackHandler.php:57    [M] DecrementInteger

--- Original
+++ New
@@ @@
         $messageFirstSeveralLines = implode(\PHP_EOL, array_slice($lines, 0, 9)) . \PHP_EOL;
         $heading = "Matchbot {$levelName}: {$messageFirstLine}";
         $chatMessage = new ChatMessage($heading);
-        $options = (new SlackOptions())->block(new SlackHeaderBlock(substr($heading, 0, 150)))->block((new SlackSectionBlock())->text($messageFirstSeveralLines));
+        $options = (new SlackOptions())->block(new SlackHeaderBlock(substr($heading, 0, 149)))->block((new SlackSectionBlock())->text($messageFirstSeveralLines));
         $chatMessage->options($options);
         $this->slackConnction->send($chatMessage);
         return false;

1268) /home/barney/projects/matchbot/src/Monolog/Handler/SlackHandler.php:57    [M] IncrementInteger

--- Original
+++ New
@@ @@
         $messageFirstSeveralLines = implode(\PHP_EOL, array_slice($lines, 0, 9)) . \PHP_EOL;
         $heading = "Matchbot {$levelName}: {$messageFirstLine}";
         $chatMessage = new ChatMessage($heading);
-        $options = (new SlackOptions())->block(new SlackHeaderBlock(substr($heading, 0, 150)))->block((new SlackSectionBlock())->text($messageFirstSeveralLines));
+        $options = (new SlackOptions())->block(new SlackHeaderBlock(substr($heading, 0, 151)))->block((new SlackSectionBlock())->text($messageFirstSeveralLines));
         $chatMessage->options($options);
         $this->slackConnction->send($chatMessage);
         return false;

1269) /home/barney/projects/matchbot/src/Monolog/Handler/SlackHandler.php:57    [M] UnwrapSubstr

--- Original
+++ New
@@ @@
         $messageFirstSeveralLines = implode(\PHP_EOL, array_slice($lines, 0, 9)) . \PHP_EOL;
         $heading = "Matchbot {$levelName}: {$messageFirstLine}";
         $chatMessage = new ChatMessage($heading);
-        $options = (new SlackOptions())->block(new SlackHeaderBlock(substr($heading, 0, 150)))->block((new SlackSectionBlock())->text($messageFirstSeveralLines));
+        $options = (new SlackOptions())->block(new SlackHeaderBlock($heading))->block((new SlackSectionBlock())->text($messageFirstSeveralLines));
         $chatMessage->options($options);
         $this->slackConnction->send($chatMessage);
         return false;

1270) /home/barney/projects/matchbot/src/Monolog/Handler/SlackHandler.php:59    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $heading = "Matchbot {$levelName}: {$messageFirstLine}";
         $chatMessage = new ChatMessage($heading);
         $options = (new SlackOptions())->block(new SlackHeaderBlock(substr($heading, 0, 150)))->block((new SlackSectionBlock())->text($messageFirstSeveralLines));
-        $chatMessage->options($options);
+        
         $this->slackConnction->send($chatMessage);
         return false;
         // record will go to other handlers in addition to being sent to slack.

1271) /home/barney/projects/matchbot/src/Monolog/Handler/SlackHandler.php:61    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $chatMessage = new ChatMessage($heading);
         $options = (new SlackOptions())->block(new SlackHeaderBlock(substr($heading, 0, 150)))->block((new SlackSectionBlock())->text($messageFirstSeveralLines));
         $chatMessage->options($options);
-        $this->slackConnction->send($chatMessage);
+        
         return false;
         // record will go to other handlers in addition to being sent to slack.
     }

1272) /home/barney/projects/matchbot/src/Monolog/Handler/SlackHandler.php:63    [M] FalseValue

--- Original
+++ New
@@ @@
         $options = (new SlackOptions())->block(new SlackHeaderBlock(substr($heading, 0, 150)))->block((new SlackSectionBlock())->text($messageFirstSeveralLines));
         $chatMessage->options($options);
         $this->slackConnction->send($chatMessage);
-        return false;
+        return true;
         // record will go to other handlers in addition to being sent to slack.
     }
     public function handleBatch(array $records) : void

1273) /home/barney/projects/matchbot/src/Monolog/Handler/SlackHandler.php:68    [M] Foreach_

--- Original
+++ New
@@ @@
     }
     public function handleBatch(array $records) : void
     {
-        foreach ($records as $record) {
+        foreach (array() as $record) {
             $this->handle($record);
         }
     }
